Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/AIAssistant.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AIAssistantLaunchButtonText
source: Chat with GitHub Copilot
cs: Chat s GitHub Copilotem
de: Mit GitHub Copilot chatten
es: Chatear con GitHub Copilot
fr: Conversation avec GitHub Copilot
it: Chatta con GitHub Copilot
ja: GitHub Copilot とチャットする
ko: GitHub Copilot과 채팅
pl: Czat z funkcją GitHub Copilot
pt_br: Chat com o GitHub Copilot
ru: Чат с GitHub Copilot
tr: GitHub Copilot ile sohbet edin
zh_hans: 与 GitHub Copilot 聊天
zh_hant: 與 GitHub Copilot 聊天

# ChatIDEConnectionDisclaimerText
source: Aspire uses your {0} connection to generate Copilot insights.
cs: Aspire používá vaše připojení {0} ke generování přehledů Copilotu.
de: Aspire verwendet Ihre {0}-Verbindung, um Copilot-Insights zu generieren.
es: Aspire usa la conexión {0} para generar Información de Copilot.
fr: Vous utilisez votre connexion {0} pour générer des insights Copilot.
it: Aspire utilizza la tua connessione {0} per generare dati su Copilot.
ja: Aspire は、{0} 接続を使用して Copilot インサイトを生成します。
ko: Aspire는 {0} 연결을 사용하여 Copilot 인사이트를 생성합니다.
pl: W celu wygenerowania szczegółowych informacji funkcji Copilot, usługa Aspire korzysta z Twojego połączenia {0}.
pt_br: O Aspire usa sua conexão {0} para gerar insights do Copilot.
ru: Aspire использует ваше подключение к {0} для генерации аналитики Copilot.
tr: Aspire, Copilot içgörüleri oluşturmak için {0} bağlantınızı kullanır.
zh_hans: Aspire 使用连接 {0} 来生成 Copilot 见解。
zh_hant: Aspire 會使用您的 {0} 連線來產生 Copilot 深入解析。

# ChatLoadingText
source: Getting ready...
cs: Probíhá příprava…
de: Wird vorbereitet …
es: En preparación...
fr: Préparation en cours... Merci de patienter.
it: Preparazione...
ja: 準備しています...
ko: 준비 중...
pl: Trwa przygotowywanie...
pt_br: Preparando-se...
ru: Идет подготовка...
tr: Hazırlanıyor...
zh_hans: 正在准备...
zh_hant: 即將就緒...

# ChatMistakesDisclaimerText
source: Copilot uses AI. Check for mistakes.
cs: Copilot používá AI. Zkontrolujte, jestli nedošlo k chybám.
de: Copilot verwendet KI. Überprüfen Sie, ob Fehler vorhanden sind.
es: Copilot usa IA. Compruebe si hay errores.
fr: Copilot utilise l’IA. Vérifiez s’il y a des erreurs.
it: Copilot usa l'IA. Controlla la presenza di errori.
ja: Copilot は AI を使用しています。間違いがないか確認してください。
ko: Copilot은 AI를 사용합니다. 실수를 확인하세요.
pl: Funkcja Copilot używa sztucznej inteligencji. Sprawdź, czy nie ma błędów.
pt_br: O Copilot usa IA. Verifique se há erros.
ru: Copilot использует ИИ. Проверьте, нет ли ошибок.
tr: Copilot, yapay zekayı kullanır. Hataları kontrol edin.
zh_hans: Copilot 使用 AI。检查是否存在错误。
zh_hant: Copilot 使用 AI。請檢查錯誤。

# ChatModelSelectButtonTitle
source: Select a model (current: {0})
cs: Vyberte model (aktuální: {0})
de: Modell auswählen (aktuell: {0})
es: Seleccione un modelo (actual: {0})
fr: Sélectionnez un modèle (actuel : {0})
it: Seleziona un modello (corrente: {0})
ja: モデルの選択 (現在: {0})
ko: 모델 선택(현재: {0})
pl: Wybierz model (bieżący: {0})
pt_br: Selecionar um modelo (atual: {0})
ru: Выберите модель (в настоящее время: {0})
tr: Bir model seçin (geçerli: {0})
zh_hans: 选择模型(当前: {0})
zh_hant: 選取模型 (目前: {0})

# ChatRefreshFollowUpPrompts
source: Refresh follow-up prompts
cs: Aktualizovat následné výzvy
de: Folgeäußerungen aktualisieren
es: Actualizar indicaciones de seguimiento
fr: Actualiser les invites de suivi
it: Aggiungi richieste di completamento
ja: フォローアップ プロンプトを更新する
ko: 후속 프롬프트 새로 고침
pl: Odśwież polecenia kolejnych czynności
pt_br: Atualizar solicitações de acompanhamento
ru: Обновить дальнейшие запросы
tr: İzleme istemlerini yenileyin
zh_hans: 刷新后续提示
zh_hant: 重新整理後續提示

# ChatRequestErrorCanceled
source: Request canceled
cs: Žádost se zrušila.
de: Anforderung abgebrochen
es: Solicitud cancelada
fr: Demande annulée
it: Richiesta annullata
ja: 要求が取り消されました
ko: 요청이 취소됨
pl: Żądanie anulowane
pt_br: Solicitação cancelada
ru: Запрос отменен
tr: İstek iptal edildi
zh_hans: 已取消请求
zh_hant: 要求已取消

# ChatRequestErrorForbidden
source: Permission denied when sending request.
cs: Při odesílání žádosti byla odepřena oprávnění.
de: Beim Senden der Anfrage wurde die Berechtigung verweigert.
es: Permiso denegado al enviar la solicitud.
fr: Autorisation refusée lors de l’envoi de la requête.
it: Autorizzazione negata durante l'invio della richiesta.
ja: 要求の送信中にアクセス許可が拒否されました。
ko: 요청을 보내는 동안 권한이 거부되었습니다.
pl: Odmowa uprawnień podczas wysyłania żądania.
pt_br: Permissão negada ao enviar solicitação.
ru: При отправке запроса отказано в разрешении.
tr: İstek gönderilirken izin reddedildi.
zh_hans: 发送请求时权限被拒绝。
zh_hant: 傳送要求時權限遭拒。

# ChatRequestErrorForbiddenCopilotSubscription
source: If you don't yet have a Copilot subscription, you can <a href="{0}" target="_blank">get one here</a>.
cs: Pokud ještě nemáte předplatné Copilotu, můžete ho <a href="{0}" target="_blank">získat tady</a>.
de: Wenn Sie noch kein Copilot-Abonnement haben, können Sie <a href="{0}" target="_blank">hier</a> eines erwerben.
es: Si aún no tiene una suscripción a Copilot, puede <a href="{0}" target="_blank">obtener una aquí</a>.
fr: Si vous n’avez pas encore d’abonnement Copilot, vous pouvez <a href="{0}" target="_blank">en obtenir un ici</a>.
it: Se non hai ancora una sottoscrizione a Copilot, puoi <a href="{0}" target="_blank">ottenerne una qui</a>.
ja: まだ Copilot サブスクリプションをお持ちでない場合は、 <a href="{0}" target="_blank">こちらで取得できます</a>。
ko: Copilot 구독이 아직 없는 경우 <a href="{0}" target="_blank">여기에서 구독을 받을 수</a> 있습니다.
pl: Jeśli nie masz jeszcze subskrypcji Copilot, możesz <a href="{0}" target="_blank">uzyskać ją tutaj</a>.
pt_br: Se você ainda não tiver uma assinatura do Copilot, <a href="{0}" target="_blank">obtenha uma aqui</a>.
ru: Если у вас еще нет подписки на Copilot, вы можете <a href="{0}" target="_blank">получить ее здесь</a>.
tr: Henüz bir Copilot aboneliğiniz yoksa, <a href="{0}" target="_blank">buradan bir tane</a> edinebilirsiniz.
zh_hans: 如果还没有 Copilot 订阅，则可以<a href="{0}" target="_blank">在此处获取一个</a>。
zh_hant: 如果您還沒有 Copilot 訂用帳戶，您可以<a href="{0}" target="_blank">在這裡取得一個訂用帳戶</a>。

# ChatRequestErrorForbiddenDescription
source: To use GitHub Copilot in .NET Aspire, you must have a recent version of your IDE installed, and your GitHub account needs to have access to GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 or later</li><li>VS Code and C# Dev Kit 1.19.63 or later</li></ul>
cs: Pokud chcete používat GitHub Copilot v .NET Aspire, musíte mít nainstalovanou nejnovější verzi integrovaného vývojového prostředí (IDE) a váš účet GitHub musí mít přístup ke GitHub Copilotu.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 nebo novější</li><li>VS Code a C# Dev Kit 1.19.63 nebo novější</li></ul>
zh_hant: 若要在 .NET Aspire 中使用 GitHub Copilot，您必須安裝最新版本的 IDE，而且 GitHub 帳戶必須能夠存取 GitHub Copilot。<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 或更新版本</li><li>VS Code 和 C# Dev Kit 1.19.63 或更新版本</li></ul>

# ChatRequestErrorForbiddenVSCode
source: Sign into VS Code with a GitHub account that has a Copilot subscription. Follow the steps in <a href="{0}" target="_blank">Set up GitHub Copilot in VS Code</a>.
cs: Přihlaste se k VS Code pomocí účtu GitHub, který má předplatné Copilotu. Postupujte podle pokynů v tématu věnovaném <a href="{0}" target="_blank">porovnání nastavení GitHub Copilotu ve VS Code</a>.
de: Melden Sie sich bei VS Code mit einem GitHub-Konto an, das über ein Copilot-Abonnement verfügt. Befolgen Sie die Schritte in <a href="{0}" target="_blank">Einrichten von GitHub Copilot in VS Code</a>.
es: Inicie sesión en VS Code con una cuenta de GitHub que tenga una suscripción de Copilot. Siga los pasos en <a href="{0}" target="_blank">Configurar GitHub Copilot en VS Code</a>.
fr: Connectez-vous à VS Code avec un compte GitHub disposant d’un abonnement Copilot. Suivez les étapes de la rubrique <a href="{0}" target="_blank">Configurer GitHub Copilot dans VS Code </a>.
it: Accedi a VS Code con un account GitHub che ha una sottoscrizione a Copilot. Segui i passaggi in <a href="{0}" target="_blank">Configurare GitHub Copilot in VS Code</a>.
ja: Copilot サブスクリプションを持つ GitHub アカウントで VS Code にサインインします。「<a href="{0}" target="_blank">VS Code で GitHub Copilot を設定する</a>」の手順に従ってください。
ko: Copilot 구독이 있는 GitHub 계정으로 VS Code에 로그인합니다. <a href="{0}" target="_blank">VS Code에서 GitHub Copilot 설정</a>의 단계를 따릅니다.
pl: Zaloguj się do programu VS Code przy użyciu konta usługi GitHub, które ma subskrypcję funkcji Copilot. Wykonaj kroki opisane w artykule <a href="{0}" target="_blank">Konfigurowanie funkcji GitHub Copilot w programie VS Code</a>.
pt_br: Entre no VS Code com uma conta do GitHub que tenha uma assinatura do Copilot. Siga as etapas em <a href="{0}" target="_blank">Configurar o GitHub Copilot no VS Code</a>.
ru: Войдите в VS Code, используя учетную запись GitHub, у которой есть подписка Copilot. Следуйте инструкциям в разделе <a href="{0}" target="_blank">Настройка GitHub Copilot в VS Code</a>.
tr: Copilot aboneliği olan bir GitHub hesabıyla VS Code'da oturum açın. <a href="{0}" target="_blank">VS Code'da GitHub Copilot'u ayarlama</a> adımlarını izleyin.
zh_hans: 使用具有 Copilot 订阅的 GitHub 帐户登录到 VS Code。按照<a href="{0}" target="_blank">在 VS Code 中设置 GitHub Copilot</a> 中的步骤进行操作。
zh_hant: 使用具有 Copilot 訂閱的 GitHub 帳戶登入 VS Code。請遵循 <a href="{0}" target="_blank">在 VS Code 中設定 GitHub Copilot</a> 中的步驟。

# ChatRequestErrorForbiddenVisualStudio
source: Sign into Visual Studio with a GitHub account that has a Copilot subscription. Follow the steps in <a href="{0}" target="_blank">Add GitHub accounts to your Visual Studio keychain</a>.
cs: Přihlaste se k sadě Visual Studio pomocí účtu GitHub, který má předplatné Copilotu. Postupujte podle pokynů v tématu věnovaném <a href="{0}" target="_blank">přidání účtů GitHubu do klíčenky sady Visual Studio</a>.
de: Melden Sie sich mit einem GitHub-Konto, das über ein Copilot-Abonnement verfügt, bei Visual Studio an. Führen Sie die Schritte unter <a href="{0}" target="_blank">Hinzufügen von GitHub-Konten zu Ihrer Visual Studio-Keychain</a> aus.
es: Inicie sesión en Visual Studio con una cuenta de GitHub que tenga una suscripción de Copilot. Siga los pasos descritos en <a href="{0}" target="_blank">Agregar cuentas de GitHub a la cadena de claves de Visual Studio</a>.
fr: Connectez-vous à Visual Studio avec un compte GitHub disposant d’un abonnement Copilot. Suivez les étapes de la rubrique <a href="{0}" target="_blank">Ajouter des comptes GitHub à votre keychain Visual Studio</a>.
it: Accedi a Visual Studio con un account GitHub che ha una sottoscrizione a Copilot. Segui i passaggi in <a href="{0}" target="_blank">Aggiungere account GitHub al keychain di Visual Studio</a>.
ja: Copilot サブスクリプションを持つ GitHub アカウントで Visual Studio にサインインします。「<a href="{0}" target="_blank">GitHub アカウントを Visual Studio キーチェーンに追加する</a>」の手順に従ってください。
ko: Copilot 구독이 있는 GitHub 계정으로 Visual Studio에 로그인합니다. <a href="{0}" target="_blank">Visual Studio 키체인에 GitHub 계정 추가</a>의 단계를 따릅니다.
pl: Zaloguj się do programu Visual Studio przy użyciu konta usługi GitHub, które ma subskrypcję funkcji Copilot. Wykonaj kroki opisane w artykule <a href="{0}" target="_blank">Dodawanie kont usługi GitHub do pęku kluczy programu Visual Studio</a>.
pt_br: Entre no Visual Studio com uma conta do GitHub que tenha uma assinatura do Copilot. Siga as etapas em <a href="{0}" target="_blank">Adicionar contas do GitHub ao keychain do Visual Studio</a>.
ru: Войдите в Visual Studio, используя учетную запись GitHub, у которой есть подписка Copilot. Выполните действия, описанные в разделе <a href="{0}" target="_blank">Добавление учетных записей GitHub в связку ключей Visual Studio</a>.
tr: Copilot aboneliğine sahip bir GitHub hesabıyla Visual Studio'da oturum açın. <a href="{0}" target="_blank">GitHub hesaplarını Visual Studio anahtar zincirinize ekleme</a> bölümündeki adımları izleyin.
zh_hans: 使用具有 Copilot 订阅的 GitHub 帐户登录到 Visual Studio。按照<a href="{0}" target="_blank">将 GitHub 帐户添加到 Visual Studio 密钥链</a>中的步骤操作。
zh_hant: 使用具有 Copilot 訂閱的 GitHub 帳戶登入 Visual Studio。請遵循 <a href="{0}" target="_blank">將 GitHub 帳戶新增到 Visual Studio 金鑰鏈</a> 中的步驟。

# ChatRequestErrorRateLimited
source: Sorry, your request was rate limited. Please try again later.
cs: Je nám líto, ale vaši žádost nebylo možné zpracovat z důvodu omezení objemu zpracování žádostí. Zkuste to prosím znovu později.
de: Für Ihre Anforderung gibt es leider ein Ratenlimit. Versuchen Sie es später erneut.
es: Su solicitud estaba limitada. Vuelva a intentarlo más tarde.
fr: Désolé... Votre requête a été limitée par le débit. Veuillez réessayer plus tard.
it: La velocità della richiesta è stata limitata. Riprova più tardi.
ja: 申し訳ございません。要求はレート制限されました。後でもう一度お試しください。
ko: 죄송합니다. 요청의 속도가 제한되었습니다. 나중에 다시 시도하세요.
pl: Niestety, Twoja prośba została ograniczona. Spróbuj ponownie później.
pt_br: A sua solicitação foi limitada por taxa. Tente novamente mais tarde.
ru: К сожалению, ваш запрос был ограничен частотой запросов. Повторите попытку позже.
tr: Üzgünüz, sınır aşıldığı için isteğiniz gerçekleştirilemedi. Lütfen daha sonra yeniden deneyin.
zh_hans: 很抱歉，你的请求受到速率限制。请稍后重试。
zh_hant: 很抱歉，已針對您的要求進行速率限制。請稍後再試。

# ChatRequestErrorReachedLimit
source: Unable to send request
cs: Nepovedlo se poslat požadavek.
de: Die Anforderung kann nicht gesendet werden.
es: No se pudo enviar la solicitud.
fr: Impossible d’envoyer la demande
it: Non è possibile inviare la richiesta
ja: 要求を送信できません
ko: 요청을 보낼 수 없음
pl: Nie można wysłać żądania
pt_br: Não é possível enviar a solicitação
ru: Не удалось отправить запрос
tr: İstek gönderilemiyor
zh_hans: 无法发送请求
zh_hant: 無法傳送要求

# ChatRequestErrorReachedLimitCopilot
source: You've reached your monthly limit of chat on the Copilot Free plan. <a href="{0}" target="_blank">Upgrade now</a> or wait until {1} for your limit to reset.
cs: Dosáhli jste měsíčního limitu chatu v plánu Copilot Free. <a href="{0}" target="_blank">Upgradujte hned</a> nebo počkejte do {1}, až se vám resetuje limit.
de: Sie haben Ihr monatliches Chatlimit für den Copilot Free-Plan erreicht. Wählen Sie <a href="{0}" target="_blank">Upgrade jetzt ausführen</a> aus, oder warten Sie, bis sich Ihr Limit am {1} zurücksetzt.
es: Ha el su límite mensual de chats en el plan Copilot Free. <a href="{0}" target="_blank">Actualice ahora</a> o espere hasta {1} para que se restablezca el límite.
fr: Vous avez atteint votre limite mensuelle de conversation sur le Plan Gratuit de Copilot. <a href="{0}" target="_blank">Effectuez la mise à niveau maintenant</a> ou attendez jusqu’à {1} pour réinitialiser votre limite.
it: Hai raggiunto il limite mensile di chat nel piano gratuito di Copilot. <a href="{0}" target="_blank">Aggiorna ora</a> o attendi fino a {1} per la reimpostazione del tuo limite.
ja: Copilot Free プランの月間チャット利用上限に達しました。<a href="{0}" target="_blank">今すぐアップグレードする</a>か、制限がリセットされる {1} までお待ちください。
ko: Copilot 무료 요금제의 월간 채팅 한도에 도달했습니다. <a href="{0}" target="_blank">지금 업그레이드</a>하거나 한도가 재설정될 때까지 {1}까지 기다리세요.
pl: Osiągnięto miesięczny limit czatu w ramach planu bezpłatnej funkcji Copilot. <a href="{0}" target="_blank">Uaktualnij teraz</a> lub poczekaj do {1}, aby zresetować limit.
pt_br: Você atingiu o limite mensal de chat no plano gratuito do Copilot. <a href="{0}" target="_blank">Atualize agora</a> ou aguarde até {1} para que o limite seja redefinido.
ru: Вы исчерпали месячный лимит чата в бесплатном плане Copilot. <a href="{0}" target="_blank">Повысьте статус</a> или дождитесь {1}, когда вам будет выделен новый лимит.
tr: Copilot Ücretsiz planında aylık sohbet sınırınıza ulaştınız. <a href="{0}" target="_blank">Şimdi yükseltin</a> veya {1} sınırınızın sıfırlanmasını bekleyin.
zh_hans: 你已达到 Copilot 免费计划的每月聊天限制。<a href="{0}" target="_blank">立即升级</a>或等待至 {1} 重置限制。
zh_hant: 您已達到 Copilot 免費方案的每月聊天限制。<a href="{0}" target="_blank">立即升級</a>或等到 {1} 重設您的限制。

# ChatRequestErrorStatusCode
source: Error when sending request. Status code: {0}
cs: Chyba při odesílání žádosti Stavový kód: {0}
de: Fehler beim Senden der Anforderung Statuscode: {0}
es: Error al enviar la solicitud. Código de estado: {0}
fr: Désolé, erreur lors de l’envoi de la requête. Code d’état : {0}
it: Errore durante l'invio della richiesta. Codice di stato: {0}
ja: 要求の送信中にエラーが発生しました。状態コード: {0}
ko: 요청을 보내는 동안 오류가 발생했습니다. 상태 코드: {0}
pl: Błąd podczas wysyłania żądania. Kod stanu: {0}
pt_br: Erro ao enviar a solicitação. Código de status: {0}
ru: Ошибка при отправке запроса. Код состояния: {0}
tr: İstek gönderilirken hata oluştu. Durum kodu: {0}
zh_hans: 发送请求时出错。状态代码: {0}
zh_hant: 傳送要求時發生錯誤。狀態代碼: {0}

# ChatRequestErrorUnknown
source: Error when sending request
cs: Chyba při odesílání žádosti
de: Fehler beim Senden der Anfrage
es: Error al enviar la solicitud
fr: Désolé, erreur lors de l’envoi de la requête
it: Errore durante l'invio della richiesta
ja: 要求の送信中にエラーが発生しました
ko: 요청을 보내는 중 오류 발생
pl: Błąd podczas wysyłania żądania
pt_br: Erro ao enviar a solicitação
ru: Ошибка при отправке запроса
tr: İstek gönderilirken hata oluştu
zh_hans: 发送请求时出错
zh_hant: 傳送要求時發生錯誤

# ChatTextAreaPlaceHolder
source: Type your message...
cs: Zadejte text zprávy...
de: Nachricht eingeben …
es: Escribe tu mensaje...
fr: Tapez votre message...
it: Digita il messaggio...
ja: メッセージを入力...
ko: 메시지를 입력하세요.
pl: Wpisz swoją wiadomość...
pt_br: Digite sua mensagem...
ru: Введите сообщение...
tr: İletinizi yazın...
zh_hans: 键入你的消息...
zh_hant: 輸入您的訊息...

# ChatThinkingText
source: Thinking...
cs: Přemýšlím…
de: Denkt nach …
es: Pensando...
fr: Je réfléchis...
it: In elaborazione...
ja: 考え中...
ko: 생각 중...
pl: Zastanawiam się...
pt_br: Pensativo...
ru: Думаю...
tr: Düşünüyor...
zh_hans: 正在思考...
zh_hant: 思考中...

# ChatUnavailableText
source: GitHub Copilot unavailable
cs: GitHub Copilot není k dispozici
de: GitHub Copilot nicht verfügbar
es: GitHub Copilot no disponible
fr: GitHub Copilot non disponible
it: GitHub Copilot non disponibile
ja: GitHub Copilot を使用できません
ko: GitHub Copilot 사용 불가
pl: Funkcja GitHub Copilot jest niedostępna
pt_br: GitHub Copilot indisponível
ru: GitHub Copilot недоступен
tr: GitHub Copilot kullanılamıyor
zh_hans: GitHub Copilot 不可用
zh_hant: GitHub Copilot 無法使用

# CopyMessageButtonText
source: Copy to clipboard
cs: Kopírovat do schránky
de: In Zwischenablage kopieren
es: Copiar en el portapapeles
fr: Copier dans le Presse-papiers
it: Copia negli Appunti
ja: クリップボードにコピーする
ko: 클립보드에 복사
pl: Kopiuj do schowka
pt_br: Copiar para a área de transferência
ru: Копировать в буфер обмена
tr: Panoya kopyala
zh_hans: 复制到剪贴板
zh_hant: 複製到剪貼簿

# DialogTitle
source: GitHub Copilot chat
cs: Chat s GitHub Copilotem
es: Chat de GitHub Copilot
fr: Conversation GitHub Copilot
it: Chat di GitHub Copilot
ja: GitHub Copilot チャット
ko: GitHub Copilot 채팅
pl: Czat narzędzia GitHub Copilot
pt_br: Chat do GitHub Copilot
ru: Чат GitHub Copilot
tr: GitHub Copilot sohbeti
zh_hans: GitHub Copilot 聊天
zh_hant: GitHub Copilot 聊天

# DislikeMessageButtonText
source: Unhelpful
cs: Neužitečné
de: Nicht hilfreich
es: Inútil
fr: Inutile
it: Poco utile
ja: 役に立たなかった
ko: 유용하지 않음
pl: Nieprzydatne
pt_br: Inútil
ru: Бесполезно
tr: Yardımcı olmadı
zh_hans: 无用
zh_hant: 沒有幫助

# ExplainErrorsButtonText
source: Explain errors
cs: Vysvětlit chyby
de: Fehler erläutern
es: Explicar errores
fr: Expliquer les erreurs
it: Spiega gli errori
ja: エラーの説明
ko: 오류 설명
pl: Wyjaśnij błędy
pt_br: Explicar erros
ru: Объяснить ошибки
tr: Hataları açıkla
zh_hans: 解释错误
zh_hant: 說明錯誤

# ExplainTraceButtonText
source: Explain trace
cs: Vysvětlit trasování
de: Ablaufverfolgung erklären
es: Explicar el seguimiento
fr: Expliquer la trace
it: Spiega la traccia
ja: トレースの説明
ko: 추적 설명
pl: Objaśnienie śledzenia
pt_br: Explicar rastreamento
ru: Объяснить трассировку
tr: İzlemeyi açıkla
zh_hans: 解释跟踪
zh_hant: 說明追蹤

# LikeMessageButtonText
source: Helpful
cs: Užitečné
de: Hilfreich
es: Útil
fr: Utile
it: Utile
ja: 役に立った
ko: 유용함
pl: Przydatne
pt_br: Útil
ru: Полезно
tr: Yardımcı oldu
zh_hans: 有用
zh_hant: 有幫助

# MenuTextAskGitHubCopilot
source: Ask GitHub Copilot
cs: Zeptejte se GitHub Copilota
de: GitHub Copilot fragen
es: Preguntar a GitHub Copilot
fr: Demander à GitHub Copilot
it: Chiedi a GitHub Copilot
ja: GitHub Copilot に質問する
ko: GitHub Copilot에게 물어보기
pl: Zapytaj funkcję GitHub Copilot
pt_br: Perguntar ao GitHub Copilot
ru: Спросить GitHub Copilot
tr: GitHub Copilot’a sorun
zh_hans: 询问 GitHub Copilot
zh_hant: 詢問 GitHub Copilot

# RetryMessageButtonText
source: Retry
cs: Zkusit znovu
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
ja: 再試行する
ko: 다시 시도
pl: Ponów próbę
pt_br: Tentar novamente
ru: Повторить попытку
tr: Yeniden dene
zh_hans: 重试
zh_hant: 重試

# SidebarExpandDialog
source: Expand dialog
cs: Rozbalit dialog
de: Dialogfeld erweitern
es: Expandir cuadro de diálogo
fr: Boîte de dialogue Développer
it: Espandi finestra di dialogo
ja: ダイアログの展開
ko: 대화 상자 확장
pl: Rozwiń okno dialogowe
pt_br: Expandir diálogo
ru: Развернуть диалоговое окно
tr: İletişim kutusunu genişlet
zh_hans: 展开对话框
zh_hant: 展開對話方塊

# SidebarNewChat
source: Start new chat
cs: Zahájit nový chat
de: Neuen Chat starten
es: Iniciar nuevo chat
fr: Démarrer une nouvelle conversation
it: Avvia nuova chat
ja: 新しいチャットを開始する
ko: 새 채팅 시작
pl: Rozpocznij nowy czat
pt_br: Iniciar novo chat
ru: Начать новый чат
tr: Yeni sohbet başlat
zh_hans: 开始新聊天
zh_hant: 開始新的聊天

# SidebarSendMessage
source: Send message
cs: Poslat zprávu
de: Nachricht senden
es: Enviar mensaje
fr: Envoyer un message
it: Invia messaggio
ja: メッセージの送信
ko: 메시지 보내기
pl: Wyślij wiadomość
pt_br: Enviar mensagem
ru: Отправить сообщение
tr: İleti gönder
zh_hans: 发送消息
zh_hant: 傳送訊息

# SidebarShrinkDialog
source: Shrink dialog
cs: Dialogové okno Zmenšit
de: Dialogfeld verkleinern
es: Reducir cuadro de diálogo
fr: Boîte de dialogue Réduire
it: Compatta finestra di dialogo
ja: ダイアログの縮小
ko: 대화 상자 축소
pl: Okno dialogowe Zmniejszanie
pt_br: Reduzir diálogo
ru: Сжать диалоговое окно
tr: İletişim kutusunu küçült
zh_hans: 收缩对话框
zh_hant: 縮小對話方塊

# SidebarTitle
source: GitHub Copilot chat
cs: Chat s GitHub Copilotem
es: Chat de GitHub Copilot
fr: Conversation GitHub Copilot
it: Chat di GitHub Copilot
ja: GitHub Copilot チャット
ko: GitHub Copilot 채팅
pl: Czat narzędzia GitHub Copilot
pt_br: Chat do GitHub Copilot
ru: Чат GitHub Copilot
tr: GitHub Copilot sohbeti
zh_hans: GitHub Copilot 聊天
zh_hant: GitHub Copilot 聊天

# ToolNotificationConsoleLogs
source: Getting console logs for `{0}`...
cs: získávají se protokoly konzoly pro {0}...
de: Konsolenprotokolle für `{0}` werden abgerufen …
es: Obteniendo registros de consola para ''{0}"...
fr: Obtention des journaux de la console pour « {0} »...
it: Recupero dei log della console per '{0}'...
ja: `{0}` のコンソール ログを取得しています...
ko: `{0}`의 콘솔 로그를 가져오는 중...
pl: Trwa pobieranie dzienników konsoli dla „{0}”...
pt_br: Obtendo logs do console para `{0}`...
ru: Получение журналов консоли для "{0}"...
tr: `{0}` için konsol günlükleri alınıyor...
zh_hans: 正在获取 `{0}` 的控制台日志...
zh_hant: 正在取得 '{0}' 的主控台記錄...

# ToolNotificationConsoleLogsFailure
source: Failed to get console logs for `{0}`.
cs: Nepovedlo se získat protokoly konzoly pro {0}.
de: Fehler beim Abrufen der Konsolenprotokolle für „{0}“.
es: No se han podido obtener los registros de la consola para "{0}".
fr: Échec de l’obtention des journaux de console pour « {0} ».
it: Non è possibile ottenere log della console per '{0}'.
ja: `{0}` のコンソール ログを取得できませんでした。
ko: `{0}`에 대한 콘솔 로그를 가져오지 못했습니다.
pl: Nie można pobrać dzienników konsoli dla zasobu „{0}”.
pt_br: Falha ao obter logs do console para '{0}'.
ru: Не удалось получить журналы консоли для "{0}".
tr: `{0}` için konsol günlükleri alınamadı.
zh_hans: 无法获取 `{0}` 的控制台日志。
zh_hant: 無法取得 `{0}` 的主控台記錄。
