Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/AIAssistant.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ToolNotificationResourceGraph
source: Getting resource graph....
cs: Získává se graf prostředků...
de: Ressourcendiagramm wird abgerufen …
es: Obteniendo gráfico de recursos...
fr: Obtention du graphe des ressources...
it: Recupero del diagramma risorse...
ja: リソース グラフを取得しています...
ko: 리소스 그래프를 가져오는 중...
pl: Trwa pobieranie wykresu zasobów...
pt_br: Obtendo o gráfico de recurso...
ru: Получение графика ресурсов....
tr: Kaynak grafiği alınıyor...
zh_hans: 正在获取资源图表...
zh_hant: 正在取得資源圖表...

# ToolNotificationStructuredLogsAll
source: Getting structured logs for all resources...
cs: Získávají se strukturované protokoly pro všechny prostředky...
de: Strukturierte Protokolle für alle Ressourcen werden abgerufen …
es: Obteniendo registros estructurados para todos los recursos...
fr: Obtention de journaux structurés pour toutes les ressources...
it: Recupero dei log strutturati per tutte le risorse...
ja: すべてのリソースの構造化ログを取得しています...
ko: 모든 리소스에 대한 구조적 로그를 가져오는 중...
pl: Trwa pobieranie dzienników strukturalnych dla wszystkich zasobów...
pt_br: Obtendo logs estruturados para todos os recursos...
ru: Получение структурированных журналов для всех ресурсов...
tr: Tüm kaynaklar için yapılandırılmış günlükler alınıyor...
zh_hans: 正在获取所有资源的结构化日志...
zh_hant: 正在取得所有資源的結構化記錄...

# ToolNotificationStructuredLogsResource
source: Getting structured logs for `{0}`...
cs: Získávají se strukturované protokoly pro {0}...
de: Strukturierte Protokolle für `{0}` werden abgerufen …
es: Obteniendo registros estructurados para ''{0}"...
fr: Obtention des journaux structurés pour « {0} »...
it: Recupero dei log strutturati per '{0}'...
ja: `{0}` の構造化ログを取得しています...
ko: `{0}`에 대한 구조적 로그를 가져오는 중...
pl: Trwa pobieranie dzienników strukturalnych dla „{0}”...
pt_br: Obtendo logs estruturados para `{0}`...
ru: Получение структурированных журналов для "{0}"...
tr: `{0}` için yapılandırılmış günlükler alınıyor...
zh_hans: 正在获取 `{0}` 的结构化日志...
zh_hant: 正在取得 '{0}' 的結構化記錄...

# ToolNotificationStructuredLogsResourceFailure
source: Failed to get structured logs for `{0}`.
cs: Nepovedlo se získat strukturované protokoly pro {0}.
de: Fehler beim Abrufen strukturierter Protokolle für „{0}“.
es: No se han podido obtener los registros estructurados de "{0}".
fr: Échec de l’obtention des journaux structurés pour « {0} ».
it: Non è possibile ottenere log strutturati per '{0}'.
ja: `{0}` の構造化ログを取得できませんでした。
ko: `{0}`에 대한 구조적 로그를 가져오지 못했습니다.
pl: Nie można pobrać dzienników ze strukturą dla zasobu „{0}”.
pt_br: Falha ao obter logs estruturados para '{0}'.
ru: Не удалось получить структурированные журналы для "{0}".
tr: `{0}` için yapılandırılmış günlükler alınamadı.
zh_hans: 无法获取 `{0}` 的结构化日志。
zh_hant: 無法取得 '{0}' 的結構化記錄。

# ToolNotificationTrace
source: Getting trace `{0}`...
cs: Získává se trasování {0}...
de: Ablaufverfolgung `{0}` wird abgerufen …
es: Obteniendo seguimiento '{0}'...
fr: Obtention de la trace « {0} »...
it: Recupero della traccia '{0}'...
ja: トレース `{0}` を取得しています...
ko: 추적 `{0}` 가져오는 중...
pl: Trwa pobieranie śladu „{0}”...
pt_br: Obtendo rastreamento `{0}`...
ru: Получение трассировки "{0}"...
tr: `{0}` izlemesi alınıyor...
zh_hans: 正在获取跟踪 `{0}`...
zh_hant: 正在取得痕跡 '{0}'...

# ToolNotificationTraceFailure
source: Failed to get trace `{0}`.
cs: Nepovedlo se získat trasování {0}.
de: Fehler beim Abrufen der Ablaufverfolgung „{0}“.
es: No se ha podido obtener la traza "{0}".
fr: Échec de l'obtention de la trace « {0} ».
it: Non è possibile ottenere la traccia '{0}'.
ja: トレース `{0}` を取得できませんでした。
ko: 추적 `{0}`을(를) 가져오지 못했습니다.
pl: Nie można pobrać śladu „{0}”.
pt_br: Falha ao obter o rastreamento '{0}'.
ru: Не удалось получить трассировку "{0}".
tr: `{0}` izlemesi alınamadı.
zh_hans: 无法获取跟踪 `{0}`。
zh_hant: 無法取得追蹤 `{0}`。

# ToolNotificationTraceStructuredLogs
source: Getting trace `{0}` logs...
cs: Získávají se protokoly trasování {0}...
de: Protokolle der Ablaufverfolgung `{0}` werden abgerufen …
es: Obteniendo registros de seguimiento "{0}"...
fr: Obtention de la trace des journaux « {0} »...
it: Recupero dei log della traccia '{0}'...
ja: トレース `{0}` ログを取得しています...
ko: 추적 `{0}` 로그를 가져오는 중...
pl: Trwa pobieranie dzienników śledzenia „{0}”...
pt_br: Obtendo logs de rastreamento `{0}`...
ru: Получение журналов трассировки "{0}"...
tr: `{0}` izleme günlükleri alınıyor...
zh_hans: 正在获取跟踪 `{0}` 日志...
zh_hant: 正在取得痕跡 '{0} 記錄'...

# ToolNotificationTracesAll
source: Getting traces for all resources...
cs: Získává se trasování pro všechny prostředky...
de: Ablaufverfolgungen für alle Ressourcen werden abgerufen …
es: Obteniendo seguimientos de todos los recursos...
fr: Obtention des traces pour toutes les ressources...
it: Recupero delle tracce per tutte le risorse...
ja: すべてのリソースのトレースを取得しています...
ko: 모든 리소스에 대한 추적을 가져오는 중...
pl: Trwa pobieranie śladów dla wszystkich zasobów...
pt_br: Obtendo rastreamentos para todos os recursos...
ru: Получение трассировок для всех ресурсов...
tr: Tüm kaynaklar için izlemeler alınıyor...
zh_hans: 正在获取所有资源的跟踪...
zh_hant: 正在取得所有資源的痕跡...

# ToolNotificationTracesResource
source: Getting traces for `{0}`...
cs: Získávají se trasování pro {0}...
de: Ablaufverfolgungen für `{0}` werden abgerufen …
es: Obteniendo seguimientos para "{0}"...
fr: Obtention des traces pour « {0} »...
it: Recupero delle tracce per '{0}'...
ja: `{0}` のトレースを取得しています...
ko: `{0}`에 대한 추적을 가져오는 중...
pl: Trwa pobieranie śladów dla „{0}”...
pt_br: Obtendo rastreamentos para `{0}`...
ru: Получение трассировки для "{0}"...
tr: `{0}` için izlemeler alınıyor...
zh_hans: 正在获取 `{0}` 的跟踪...
zh_hant: 正在取得 '{0}' 的痕跡...

# ToolNotificationTracesResourceFailure
source: Failed to get traces for `{0}`.
cs: Nepovedlo se získat trasování pro {0}.
de: Fehler beim Abrufen von Ablaufverfolgungen für „{0}“.
es: No se han podido obtener las trazas de "{0}".
fr: Échec de l’obtention des traces pour « {0} ».
it: Non è possibile ottenere tracce per '{0}'.
ja: `{0}` のトレースを取得できませんでした。
ko: `{0}`에 대한 추적을 가져오지 못했습니다.
pl: Nie można pobrać śladów dla zasobu „{0}”.
pt_br: Falha ao obter rastreamentos para '{0}'.
ru: Не удалось получить трассировки для "{0}".
tr: `{0}` için izlemeler alınamadı.
zh_hans: 无法获取 `{0}` 的跟踪。
zh_hant: 無法取得 '{0}' 的追蹤。

# ChatRequestErrorForbiddenDescription
source: To use GitHub Copilot in Aspire, you must have a recent version of your IDE installed, and your GitHub account needs to have access to GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 or later</li><li>VS Code and C# Dev Kit 1.19.63 or later</li></ul>
de: Um GitHub Copilot in .NET Aspire verwenden zu können, muss eine aktuelle Version Ihrer IDE installiert sein, und Ihr GitHub-Konto benötigt Zugriff auf GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 oder höher</li><li>VS Code und C# Dev Kit 1.19.63 oder höher</li></ul>
es: Para utilizar GitHub Copilot en .NET Aspire, debes tener instalada una versión reciente de tu IDE y tu cuenta de GitHub debe tener acceso a GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 o posterior</li><li>VS Code y el Kit de desarrollo de C# 1.19.63 o posterior</li></ul>
fr: Pour utiliser GitHub Copilot dans Aspire, vous devez disposer d’une version récente de votre IDE et votre compte GitHub doit avoir accès à GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 ou version ultérieure</li><li>VS Code et le kit de développement C# 1.19.63 ou version ultérieure</li></ul>
it: Per usare GitHub Copilot in .NET Aspire, è necessario che sia installata una versione recente dell'IDE e che l'account GitHub abbia accesso a GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 o versione successiva</li><li>Visual Studio Code e C# Dev Kit 1.19.63 o versione successiva</li></ul>
ja: .NET Aspire で GitHub Copilot を使用するには、最新バージョンの IDE がインストールされており、お使いの GitHub アカウントで GitHub Copilot にアクセスできる必要があります。<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 以降</li><li>VS Code および C# Dev Kit 1.19.63 以降</li></ul>
ko: Aspire에서 GitHub Copilot을 사용하려면 최신 버전의 IDE가 설치되어 있어야 하며, GitHub 계정이 GitHub Copilot에 액세스할 수 있어야 합니다.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 이상</li><li>VS Code 및 C# Dev Kit 1.19.63 이상</li></ul>
pl: Aby używać GitHub Copilot w .NET Aspire, musisz mieć zainstalowaną aktualną wersję swojego IDE, a Twoje konto GitHub musi mieć dostęp do GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 lub nowsze</li><li>VS Code i C# Dev Kit 1.19.63 lub nowsze</li></ul>
pt_br: Para usar o GitHub Copilot no Aspire, você deve ter uma versão recente da sua IDE instalada e sua conta do GitHub precisa ter acesso ao GitHub Copilot.<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 ou posterior</li><li>VS Code e Kit de Desenvolvimento do C# 1.19.63 ou posterior</li></ul>
zh_hans: 要在 .NET Aspire 中使用 GitHub Copilot，必须安装最新版本的 IDE，并且 GitHub 帐户需要有权访问 GitHub Copilot。<ul style="margin-top:8px"><li>Visual Studio 2022 17.14 或更高版本</li><li>VS Code 和 C# 开发工具包 1.19.63 或更高版本</li></ul>
