Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/AIPrompts.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PromptAnalyzeLogEntry
source: Analyze log entry `log_id: {0}`
cs: Analyzovat položku protokolu log_id: {0}
de: Protokolleintrag „log_id {0}“ analysieren
es: Analizar entrada de registro 'log_id: {0}'
fr: Analysez l’entrée de journal `log_id: {0}`
it: Analizza la voce di log 'log_id: {0}'
ja: ログ エントリ `log_id: {0}` を分析します
ko: 로그 항목 'log_id: {0}' 분석
pl: Analizuj wpis dziennika „log_id: {0}”
ru: Анализ записи журнала "log_id: {0}"
tr: 'log_id: {0}' günlük girdisini analiz et
zh_hans: 分析日志条目 `log_id: {0}`
zh_hant: 分析記錄項目 'log_id: {0}'

# PromptAnalyzePerformance
source: Analyze performance
cs: Analyzovat výkon
de: Leistung analysieren
es: Analizar el rendimiento
fr: Analysez le niveau de performance
it: Analizza le prestazioni
ja: パフォーマンスを分析します
ko: 성능 분석
pl: Analizuj wydajność
pt_br: Desempenho da análise
ru: Анализ производительности
tr: Performansı analiz et
zh_hans: 分析性能
zh_hant: 分析效能

# PromptAnalyzeResource
source: Analyze resource `{0}`
cs: Analyzovat prostředek {0}
de: Ressource „{0}“ analysieren
es: Analizar recurso '{0}'
fr: Analysez la ressource `{0}`
it: Analizza la risorsa '{0}'
ja: リソース `{0}` を分析します
ko: 리소스 '{0}' 분석
pl: Analizuj zasób „{0}”
pt_br: Analisar recurso '{0}'
ru: Анализ ресурса "{0}"
tr: '{0}' kaynağını analiz et
zh_hans: 分析资源 `{0}`
zh_hant: 分析資源 `{0}`

# PromptAnalyzeResourcePerformance
source: Analyze performance for `{0}`
cs: Analyzovat výkon pro: {0}
de: Leistung für „{0}“ analysieren
es: Analizar el rendimiento de '{0}'
fr: Analysez le niveau de performance pour `{0}`
it: Analizza le prestazioni per '{0}'
ja: `{0}` のパフォーマンスを分析します
ko: `{0}`의 성능 분석
pl: Analizuj wydajność dla „{0}”
pt_br: Analisar o desempenho de '{0}'
ru: Анализ производительности для "{0}"
tr: '{0}' için performansı analiz et
zh_hans: 分析 `{0}` 的性能
zh_hant: 分析 `{0}` 的效能

# PromptAnalyzeResources
source: Explain the current state of my app's resources
cs: Vysvětlit aktuální stav prostředků mé aplikace
de: Den aktuellen Zustand der Ressourcen meiner App erläutern
es: Explicar el estado actual de los recursos de mi aplicación
fr: Expliquez l’état actuel des ressources de mon application
it: Spiega lo stato attuale delle risorse dell'app
ja: アプリのリソースの現在の状態を説明します
ko: 내 앱 리소스의 현재 상태 설명
pl: Objaśnij bieżący stan zasobów mojej aplikacji
pt_br: Explicar o estado atual dos recursos do meu aplicativo
ru: Объяснить текущее состояние ресурсов моего приложения
tr: Uygulamamın kaynaklarının mevcut durumunu açıkla
zh_hans: 解释应用资源的当前状态
zh_hant: 說明我應用程式資源的目前狀態

# PromptAnalyzeSpan
source: Analyze span `{0}`
cs: Analyzovat rozsah {0}
de: Bereich „{0}“ analysieren
es: Analizar intervalo '{0}'
fr: Analysez l’étendue `{0}`
it: Analizza lo span '{0}'
ja: スパン `{0}` を分析します
ko: '{0}' 범위 분석
pl: Analizuj zakres „{0}”
pt_br: Analisar intervalo '{0}'
ru: Анализ диапазона "{0}"
tr: '{0}' yayılımını analiz et
zh_hans: 分析范围 `{0}`
zh_hant: 分析跨度 `{0}`

# PromptAnalyzeStructuredLogs
source: Get structured logs for all resources
cs: Získat strukturované protokoly pro všechny prostředky
de: Strukturierte Protokolle für alle Ressourcen abrufen
es: Obtener registros estructurados para todos los recursos
fr: Obtenez des journaux structurés pour toutes les ressources
it: Recupera i log strutturati per tutte le risorse
ja: すべてのリソースの構造化ログを取得します
ko: 모든 리소스에 대한 구조적 로그 가져오기
pl: Pobierz dzienniki strukturalne dla wszystkich zasobów
pt_br: Obter logs estruturados para todos os recursos
ru: Получите структурированные журналы для всех ресурсов
tr: Tüm kaynaklar için yapılandırılmış günlükleri getir
zh_hans: 获取所有资源的结构化日志
zh_hant: 取得所有資源的結構化記錄

# PromptAnalyzeTrace
source: Analyze distributed trace `trace_id: {0}`
cs: Analyzovat distribuované trasování trace_id: {0}
de: Verteilte Ablaufverfolgung „trace_id {0}“ analysieren
es: Analizar seguimiento distribuido 'trace_id: {0}'
fr: Analysez les traces distribuées `trace_id: {0}`
it: Analizza la traccia distribuita 'trace_id: {0}'
ja: `trace_id: {0}` の分散トレースを分析します
ko: 분산 추적 'trace_id: {0}' 분석
pl: Analizuj śledzenia rozproszonego „trace_id: {0}„
pt_br: Analisar rastreamento distribuído 'trace_id: {0}'
ru: Анализ распределенной трассировки "trace_id: {0}"
tr: 'trace_id: {0}' dağıtılmış izlemeyi analiz et
zh_hans: 分析分布式跟踪 `trace_id: {0}`
zh_hant: 分析分散式追蹤 `trace_id: {0}`

# PromptConsoleLogs
source: Get console logs for all resources
cs: Získat protokoly konzoly pro všechny prostředky
de: Konsolenprotokolle für alle Ressourcen abrufen
es: Obtener registros de consola para todos los recursos
fr: Obtenez les journaux de la console pour toutes les ressources
it: Recupera i log della console per tutte le risorse
ja: すべてのリソースのコンソール ログを取得します
ko: 모든 리소스에 대해 콘솔 로그 가져오기
pl: Pobierz dzienniki konsoli dla wszystkich zasobów
pt_br: Obter logs do console para todos os recursos
ru: Получить журналы консоли для всех ресурсов
tr: Tüm kaynaklar için konsol günlüklerini getir
zh_hans: 获取所有资源的控制台日志
zh_hant: 取得所有資源的主機記錄

# PromptErrorTraces
source: Analyze distributed trace errors
cs: Analyzovat chyby distribuovaného trasování
de: Fehler bei verteilter Ablaufverfolgung analysieren
es: Analizar errores de seguimiento distribuido
fr: Analysez les erreurs de trace distribuée
it: Analisi errori delle tracce distribuite
ja: 分散トレース エラーを分析します
ko: 분산 추적 오류 분석
pl: Analizuj błędy śledzenia rozproszonego
pt_br: Analisar erros de rastreamento distribuído
ru: Анализировать ошибки распределенной трассировки
tr: Dağıtılmış izleme hatalarını analiz et
zh_hans: 分析分布式跟踪错误
zh_hant: 分析分散式追蹤錯誤

# PromptErrorsStructuredLogs
source: Analyze structured log errors
cs: Analyzovat chyby strukturovaného protokolu
de: Fehler in strukturierten Protokollen analysieren
es: Analizar errores de registro estructurados
fr: Analysez les erreurs de journal structuré
it: Analizza errori nei log strutturati
ja: 構造化ログ エラーを分析します
ko: 구조적 로그 오류 분석
pl: Analizuj błędy dzienników strukturalnych
pt_br: Analisar erros de log estruturado
ru: Анализ ошибок структурированного журнала
tr: Yapılandırılmış günlük hatalarını analiz et
zh_hans: 分析结构化日志错误
zh_hant: 分析結構化記錄錯誤

# PromptHelpConsoleLogs
source: Describe using console logs
cs: Popsat použití protokolů konzoly
de: Verwendung von Konsolenprotokollen beschreiben
es: Describir el uso de registros de consola
fr: Décrivez à l’aide des journaux de console
it: Descrivi l'utilizzo dei log della console
ja: コンソール ログを使用して説明します
ko: 콘솔 로그 사용 설명
pl: Opisz użycie dzienników konsoli
pt_br: Descrever o uso de logs do console
ru: Опишите использование журналов консоли
tr: Konsol günlüklerini kullanarak açıkla
zh_hans: 描述如何使用控制台日志
zh_hant: 使用主機記錄進行描述

# PromptHelpResources
source: Describe using resources
cs: Popsat použití prostředků
de: Verwendung von Ressourcen beschreiben
es: Describir el uso de recursos
fr: Décrivez l’utilisation des ressources
it: Descrivi l'utilizzo delle risorse
ja: リソースを使用して説明します
ko: 리소스 사용 설명
pl: Opisz użycie zasobów
pt_br: Descrever o uso de recursos
ru: Опишите использование ресурсов
tr: Kaynakları kullanarak açıkla
zh_hans: 描述如何使用资源
zh_hant: 使用資源進行描述

# PromptHelpStructuredLogs
source: Describe using structured logs
cs: Popsat použití strukturovaných protokolů
de: Verwendung strukturierter Protokolle beschreiben
es: Describir el uso de registros estructurados
fr: Décrivez à l’aide de journaux structurés
it: Descrivi utilizzando log strutturati
ja: 構造化ログを使用して説明します
ko: 구조적 로그 사용 설명
pl: Opisz użycie dzienników strukturalnych
pt_br: Descrever o uso de logs estruturados
ru: Описать использование структурированных журналов
tr: Yapılandırılmış günlükleri kullanarak açıkla
zh_hans: 描述如何使用结构化日志
zh_hant: 使用結構化記錄進行描述

# PromptHelpTraces
source: Describe using distributed traces
cs: Popsat použití distribuovaných trasování
de: Verwendung verteilter Ablaufverfolgungen beschreiben
es: Describir el uso de seguimientos distribuidos
fr: Décrivez à l’aide de traces distribuées
it: Descrivi utilizzando tracce distribuite
ja: 分散トレースを使用して説明します
ko: 분산 추적 사용 설명
pl: Opisz użycie śladów rozproszonych
pt_br: Descrever o uso de rastreamentos distribuídos
ru: Описать с помощью распределенных трассировок
tr: Dağıtılmış izlemeleri kullanarak açıkla
zh_hans: 描述如何使用分布式跟踪
zh_hant: 使用分散式追蹤進行描述

# PromptResourceConsoleLogs
source: Get console logs for `{0}`
cs: Získat protokoly konzoly pro: {0}
de: Konsolenprotokolle für „{0}“ abrufen
es: Obtener registros de consola para '{0}'
fr: Obtenez les journaux de la console pour `{0}`
it: Recupera i log della console per '{0}'
ja: `{0}` のコンソール ログを取得します
ko: '{0}’의 콘솔 로그 가져오기
pl: Pobierz dzienniki konsoli dla „{0}”
pt_br: Obter logs do console para '{0}'
ru: Получить журналы консоли для "{0}"
tr: '{0}' için konsol günlüklerini getir
zh_hans: 获取 `{0}` 的控制台日志
zh_hant: 取得 `{0}` 的主機記錄

# PromptResourceStructuredLogs
source: Get structured logs for `{0}`
cs: Získat strukturované protokoly pro {0}
de: Strukturierte Protokolle für „{0}“ abrufen
es: Obtener registros estructurados para '{0}'
fr: Journaux structurés introuvables pour `{0}`
it: Recupera log strutturati per '{0}'
ja: `{0}` の構造化ログを取得します
ko: ‘{0}’에 대한 구조적 로그 가져오기
pl: Pobierz dzienniki strukturalne dla „{0}”
pt_br: Obter logs estruturados para "{0}"
ru: Получить структурированные журналы для "{0}"
tr: '{0}' için yapılandırılmış günlükleri getir
zh_hans: 获取 `{0}` 的结构化日志
zh_hant: 取得 `{0}` 的結構化記錄

# PromptResourceTraces
source: Get distributed traces for `{0}`
cs: Získat distribuovaná trasování pro: {0}
de: Verteilte Ablaufverfolgungen für „{0}“ abrufen
es: Obtener seguimientos distribuidos para '{0}'
fr: Obtenez les traces distribuées pour `{0}`
it: Recupera tracce distribuite per '{0}'
ja: `{0}` の分散トレースを取得します
ko: '{0}'에 대한 분산 추적 가져오기
pl: Pobierz ślady rozproszone dla „{0}”
pt_br: Obter rastreamentos distribuídos para '{0}'
ru: Получить распределенные трассировки для "{0}"
tr: '{0}' için dağıtılmış izlemeleri getir
zh_hans: 获取 `{0}` 的分布式跟踪
zh_hant: 取得 `{0}` 的分散式追蹤

# PromptResourceTracesAndStructuredLogs
source: Get traces and structured logs for `{0}`
cs: Získat trasování a strukturované protokoly pro: {0}
de: Ablaufverfolgungen und strukturierte Protokolle für „{0}“ abrufen
es: Obtener seguimientos y registros estructurados para '{0}'
fr: Obtenez des traces et des journaux structurés pour `{0}`
it: Recupera tracce e log strutturati per '{0}'
ja: `{0}` のトレースと構造化ログを取得します
ko: '{0}'에 대한 추적 및 구조적 로그 가져오기
pl: Pobierz ślady i dzienniki strukturalne dla „{0}”
pt_br: Obter rastreamentos e logs estruturados para '{0}'
ru: Получить трассировки и структурированные журналы для "{0}"
tr: '{0}' için izlemeleri ve yapılandırılmış günlükleri getir
zh_hans: 获取 `{0}` 的跟踪和结构化日志
zh_hant: 取得 `{0}` 的追蹤和結構化記錄

# PromptTraces
source: Get distributed traces for all resources
cs: Získat distribuovaná trasování pro všechny prostředky
de: Verteilte Ablaufverfolgungen für alle Ressourcen abrufen
es: Obtener seguimientos distribuidos para todos los recursos
fr: Obtenez des traces distribuées pour toutes les ressources
it: Recupera tracce distribuite per tutte le risorse
ja: すべてのリソースの分散トレースを取得します
ko: 모든 리소스에 대한 분산 추적 가져오기
pl: Pobierz ślady rozproszone dla wszystkich zasobów
pt_br: Obter rastreamentos distribuídos para todos os recursos
ru: Получить распределенные трассировки для всех ресурсов
tr: Tüm kaynaklar için dağıtılmış izlemeleri getir
zh_hans: 获取所有资源的分布式跟踪
zh_hant: 取得所有資源的分散式追蹤

# PromptTracesAndStructuredLogs
source: Get traces and structured logs
cs: Získat trasování a strukturované protokoly
de: Ablaufverfolgungen und strukturierte Protokolle abrufen
es: Obtener seguimientos y registros estructurados
fr: Obtenez des traces et des journaux structurés
it: Recupera tracce e log strutturati
ja: トレースと構造化ログを取得します
ko: 추적 및 구조적 로그 가져오기
pl: Pobierz ślady i dzienniki strukturalne
pt_br: Obter rastreamentos e logs estruturados
ru: Получите трассировки и структурированные журналы
tr: İzlemeleri ve yapılandırılmış günlükleri getir
zh_hans: 获取跟踪和结构化日志
zh_hant: 取得追蹤和結構化記錄

# PromptUnhealthyResources
source: Check that all resources are in a healthy state
cs: Zkontrolovat, jestli jsou všechny prostředky ve stavu V pořádku
de: Überprüfen, ob sich alle Ressourcen in einem fehlerfreien Zustand befinden
es: Comprobar que todos los recursos están en un estado correcto
fr: Vérifiez que toutes les ressources sont dans un état sain
it: Verifica che tutte le risorse siano in uno stato integro
ja: すべてのリソースが正常な状態であることを確認します
ko: 모든 리소스가 정상 상태인지 확인
pl: Sprawdź, czy wszystkie zasoby są w dobrej kondycji
pt_br: Verificar se todos os recursos estão em um estado íntegro
ru: Проверьте, все ли ресурсы находятся в работоспособном состоянии
tr: Tüm kaynakların sağlıklı durumda olup olmadığını kontrol et
zh_hans: 检查所有资源是否处于正常状态
zh_hant: 檢查所有資源是否處於健康狀態

# TitleExplainErrors
source: Explain errors
cs: Vysvětlit chyby
de: Fehler erläutern
es: Explicar errores
fr: Expliquer les erreurs
it: Spiega gli errori
ja: エラーの説明
ko: 오류 설명
pl: Wyjaśnij błędy
pt_br: Explicar erros
ru: Объяснить ошибки
tr: Hataları açıkla
zh_hans: 解释错误
zh_hant: 說明錯誤

# TitleHelp
source: Help
cs: Nápověda
de: Hilfe
es: Ayuda
fr: Aide
it: Guida
ja: ヘルプ
ko: 도움말
pl: Pomoc
pt_br: Ajuda
ru: Справка
tr: Yardım
zh_hans: 帮助
zh_hant: 説明

# TitleInvestigate
source: Investigate
cs: Prošetřit
de: Untersuchen
es: Investigar
fr: Enquêter
it: Esegui indagine
ja: 調査
ko: 조사
pl: Zbadaj
pt_br: Investigar
ru: Исследование
tr: Araştır
zh_hans: 调查
zh_hant: 調查

# TitleInvestigateUnhealthyResources
source: Investigate unhealthy resources
cs: Prozkoumat prostředky, které nejsou ve stavu V pořádku
de: Fehlerhafte Ressourcen untersuchen
es: Investigar recursos incorrectos
fr: Examinez les ressources non saines
it: Indaga sulle risorse non integre
ja: 異常なリソースを調査します
ko: 비정상 리소스 조사
pl: Zbadaj zasoby w złej kondycji
pt_br: Investigar recursos não íntegros
ru: Исследование неработоспособных ресурсов
tr: İyi durumda olmayan kaynakları araştır
zh_hans: 调查运行不正常的资源
zh_hant: 調查狀況不良的資源

# TitlePerformance
source: Performance
cs: Výkon
de: Leistung
es: Rendimiento
fr: Niveau de performance
it: Prestazioni
ja: パフォーマンス
ko: 성능
pl: Wydajność
pt_br: Desempenho
ru: Производительность
tr: Performans
zh_hans: 性能
zh_hant: 效能

# TitleRecentActivity
source: Recent activity
cs: Nedávná aktivita
de: Kürzlich durchgeführte Aktivität
es: Actividad reciente
fr: Activité récente
it: Attività recenti
ja: 最近のアクティビティ
ko: 최근 활동
pl: Ostatnia aktywność
pt_br: Atividade recente
ru: Недавнее действие
tr: En son etkinlik
zh_hans: 最近的活动
zh_hant: 最近的活動

# TitleRecentConsoleLogs
source: Recent console logs
cs: Poslední protokoly konzoly
de: Zuletzt verwendete Konsolenprotokolle
es: Registros recientes de la consola
fr: Journaux récents de la console
it: Log della console recenti
ja: 最近のコンソール ログ
ko: 최근 콘솔 로그
pl: Ostatnie dzienniki konsoli
pt_br: Logs recentes do console
ru: Последние журналы консоли
tr: Son konsol günlükleri
zh_hans: 最近使用的控制台日志
zh_hant: 最近的主機記錄

# TitleSummarizeResources
source: Summarize resources
cs: Shrnout prostředky
de: Ressourcen zusammenfassen
es: Resumir recursos
fr: Résumez les ressources
it: Riepiloga le risorse
ja: リソースを要約する
ko: 리소스 요약
pl: Podsumuj zasoby
pt_br: Resumir recursos
ru: Резюмировать ресурсы
tr: Kaynakları özetle
zh_hans: 汇总资源
zh_hant: 摘要資源
