Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Columns.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PersistentContainerIconTooltip
source: This container is persistent and won't be stopped when the app host is shut down.
de: Dieser Container ist persistent und wird beim Herunterfahren des App-Hosts nicht beendet.
es: Este contenedor es persistente y no se detendrá cuando se apague el host de aplicaciones.
fr: Ce conteneur est persistant et ne sera pas arrêté lorsque l’hôte de l’application sera arrêté.
it: Questo contenitore è persistente e non verrà arrestato quando l'host dell'app viene arrestato.
ja: このコンテナーは永続的なものであり、アプリ ホスティング プロセスがシャットダウンしても停止されません。
ko: 이 컨테이너는 영구적이며 앱 호스트가 종료될 때 중지되지 않습니다.
pl: Ten kontener jest trwały i nie zostanie zatrzymany po zamknięciu hosta aplikacji.
ru: Этот контейнер является постоянным и не будет остановлен при завершении работы узла приложения.
zh_hans: 此容器是永久性的，在应用主机关闭时不会停止。
zh_hant: 此容器是持續性的，而且不會在應用程式主機關閉時停止。

# ResourceNameDisplayContainerIdText
source: Container ID: {0}
cs: ID kontejneru: {0}
es: Id. de contenedor: {0}
fr: ID de conteneur : {0}
it: ID contenitore: {0}
ja: コンテナー ID: {0}
ko: 컨테이너 ID: {0}
pl: Identyfikator kontenera: {0}
pt_br: ID do Contêiner: {0}
ru: ИД контейнера: {0}
tr: Kapsayıcı Kimliği: {0}
zh_hans: 容器 ID: {0}
zh_hant: 容器識別碼: {0}

# ResourceNameDisplayCopyContainerIdText
source: Copy container ID to clipboard
cs: Zkopírovat ID kontejneru do schránky
de: Container-ID in Zwischenablage kopieren
es: Copiar id. de contenedor en el Portapapeles
fr: Copier un ID de conteneur dans le Presse-papiers
it: Copia ID contenitore negli Appunti
ja: コンテナー ID をクリップボードにコピーする
ko: 컨테이너 ID를 클립보드에 복사
pl: Kopiuj identyfikator kontenera do schowka
pt_br: Copiar a ID do contêiner para a área de transferência
ru: Копировать ИД контейнера в буфер обмена
tr: Kapsayıcı kimliğini panoya kopyala
zh_hans: 将容器 ID 复制到剪贴板
zh_hant: 將容器識別碼複製至剪貼簿

# ResourceNameDisplayProcessIdText
source: Process ID: {0}
cs: ID procesu: {0}
de: Prozess-ID: {0}
es: Id. de proceso: {0}
fr: ID de processus : {0}
it: ID processo: {0}
ja: プロセス ID: {0}
ko: 프로세스 ID: {0}
pl: Identyfikator procesu: {0}
pt_br: ID do processo: {0}
ru: Идентификатор процесса: {0}
tr: İşlem kimliği: {0}
zh_hans: 进程 ID: {0}
zh_hant: 處理序識別碼: {0}

# RunningAndUnhealthyResourceStateToolTip
source: Resource is running but not in a healthy state.
fr: La ressource est en cours d’exécution, mais son état n’est pas sain.
ko: 리소스가 실행 중이지만 정상 상태가 아닙니다.
ru: Ресурс работает, но находится в неработоспособном состоянии. Щелкните, чтобы получить дополнительные сведения.
zh_hans: 资源正在运行，但状态不正常。单击以显示详细信息。
zh_hant: 資源正在執行，但未處於良好的狀態。

# SourceColumnDisplayContainerArgsTitle
source: Container args
cs: Argumenty kontejneru
de: Containerargumente
es: Argumentos de contenedor
fr: Arguments de conteneur
it: Argomenti contenitore
ja: コンテナー 引数
ko: 컨테이너 인수
pl: Argumenty kontenera
pt_br: Argumentos de contêiner
ru: Аргументы контейнера
tr: Kapsayıcı bağımsız değişkenleri
zh_hans: 容器参数
zh_hant: 容器引數

# SourceColumnDisplayContainerCommand
source: Command: {0}
cs: Příkaz: {0}
de: Befehl: {0}
es: Comando: {0}
fr: Commande : {0}
it: Comando: {0}
ja: コマンド: {0}
ko: 명령: {0}
pl: Polecenie: {0}
pt_br: Comando: {0}
ru: Команда: {0}
tr: Komut: {0}
zh_hans: 命令: {0}
zh_hant: 命令: {0}

# SourceColumnDisplayContainerCommandTitle
source: Container command
cs: Příkaz kontejneru
de: Containerbefehl
es: Comando de contenedor
fr: Commande de conteneur
it: Comando contenitore
ja: コンテナー コマンド
ko: 컨테이너 명령
pl: Polecenie kontenera
pt_br: Comando de contêiner
ru: Команда контейнера
tr: Kapsayıcı komutu
zh_hans: 容器命令
zh_hant: 容器命令

# SourceColumnDisplayCopyCommandToClipboard
source: Copy full command to clipboard
cs: Zkopírovat celý příkaz do schránky
de: Vollständigen Befehl in Zwischenablage kopieren
es: Copiar el comando completo en el Portapapeles
fr: Copier la commande complète dans le Presse-papiers
it: Copia intero comando negli Appunti
ja: 完全なコマンドをクリップボードにコピーする
ko: 전체 명령을 클립보드에 복사
pl: Kopiuj polecenie do schowka
pt_br: Copiar o comando completo para a área de transferência
ru: Копировать команду полностью в буфер обмена
tr: Tüm komutu panoya kopyalayın
zh_hans: 将完整命令复制到剪贴板
zh_hant: 將完整命令複製至剪貼簿

# SourceColumnDisplayPort
source: Port: {0}
es: Puerto: {0}
it: Porta: {0}
ja: ポート: {0}
ko: 포트: {0}
pt_br: Porta: {0}
ru: Порт: {0}
tr: Bağlantı noktası: {0}
zh_hans: 端口: {0}
zh_hant: 連接埠: {0}

# SourceColumnDisplayPorts
source: Ports: {0}
cs: Porty: {0}
es: Puertos: {0}
it: Porte: {0}
ja: ポート: {0}
ko: 포트: {0}
pl: Porty: {0}
pt_br: Portas: {0}
ru: Порты: {0}
tr: Bağlantı Noktaları: {0}
zh_hans: 端口: {0}
zh_hant: 連接埠: {0}

# SourceColumnDisplayWorkingDirectory
source: Working directory: {0}
cs: Pracovní adresář: {0}
de: Arbeitsverzeichnis: {0}
es: Directorio de trabajo: {0}
fr: Répertoire de travail : {0}
it: Directory di lavoro: {0}
ja: 作業ディレクトリ: {0}
ko: 작업 디렉터리: {0}
pl: Katalog roboczy: {0}
pt_br: Diretório de trabalho: {0}
ru: Рабочий каталог: {0}
tr: Çalışma dizini: {0}
zh_hans: 工作目录: {0}
zh_hant: 工作目錄: {0}

# SourceColumnSourceCopyContainerToClipboard
source: Copy image name and tag to clipboard
cs: Zkopírovat název a značku image do schránky
de: Bildnamen und -tag in Zwischenablage kopieren
es: Copiar el nombre y la etiqueta de la imagen en el Portapapeles
fr: Copier le nom et la balise de l’image dans le Presse-papiers
it: Copia nome e tag dell'immagine negli Appunti
ja: イメージ名とタグをクリップボードにコピーする
ko: 이미지 이름 및 태그를 클립보드에 복사
pl: Kopiuj nazwę i tag obrazu do schowka
pt_br: Copie o nome e a marca da imagem para a área de transferência
ru: Копировать имя и тег изображения в буфер обмена
tr: Resim adını ve etiketini panoya kopyala
zh_hans: 将图像名称和标记复制到剪贴板
zh_hant: 將影像名稱和標籤複製至剪貼簿

# SourceColumnSourceCopyFullPathToClipboard
source: Copy file path to clipboard
cs: Zkopírovat cestu k souboru do schránky
de: Vollständigen Dateipfad in Zwischenablage kopieren
es: Copiar la ruta de acceso del archivo al Portapapeles
fr: Copier le chemin d’accès du fichier dans le Presse-papiers
it: Copia percorso file negli Appunti
ja: ファイル パスをクリップボードにコピーする
ko: 파일 경로를 클립보드에 복사
pl: Kopiuj ścieżkę pliku do schowka
pt_br: Copiar caminho do arquivo para a área de transferência
ru: Копировать путь файла в буфер обмена
tr: Dosya yolunu panoya kopyala
zh_hans: 将文件路径复制到剪贴板
zh_hant: 將檔案路徑複製至剪貼簿

# StateColumnResourceContainerRuntimeUnhealthy
source: Container runtime was found but appears to be unhealthy. Ensure that it is running. For more information, see https://aka.ms/dotnet/aspire/container-runtime-unhealthy
de: Die Containerruntime wurde gefunden, scheint aber fehlerhaft zu sein. Stellen Sie sicher, dass sie ausgeführt wird. Weitere Informationen finden Sie unter https://aka.ms/dotnet/aspire/container-runtime-unhealthy
es: Se encontró el runtime de contenedor, pero parece que está en un estado incorrecto. Asegúrese de que se está ejecutando. Para obtener más información, consulte https://aka.ms/dotnet/aspire/container-runtime-unhealthy
fr: Le runtime de conteneur a été trouvé, mais il semble qu’il ne soit pas sain. Assurez-vous qu’il est en cours d’exécution. Pour plus d’informations, consultez https://aka.ms/dotnet/aspire/container-runtime-unhealthy
it: È stato trovato il runtime del contenitore, ma non è integro. Verificare che sia in esecuzione. Per altre informazioni, vedere https://aka.ms/dotnet/aspire/container-runtime-unhealthy
ja: コンテナー ランタイムが見つかりましたが、異常である可能性があります。実行中であることを確認してください。 詳細については、https://aka.ms/dotnet/aspire/container-runtime-unhealthy を参照してください。
ko: 컨테이너 런타임을 찾았지만 비정상 상태인 것 같습니다. 실행 중인지 확인하세요. 자세한 내용은 https://aka.ms/dotnet/aspire/container-runtime-unhealthy 페이지를 참조하세요.
pl: Znaleziono środowisko uruchomieniowe kontenera, ale wygląda na to, że jest w złej kondycji. Upewnij się, że jest uruchomione. Aby uzyskać więcej informacji, zobacz https://aka.ms/dotnet/aspire/container-runtime-unhealthy
ru: Среда выполнения контейнера обнаружена, но, по-видимому, неработоспособна. Убедитесь, что она запущена. Дополнительные сведения см. по адресу https://aka.ms/dotnet/aspire/container-runtime-unhealthy
zh_hans: 已找到容器运行时，但它似乎运行不正常。请确保它正在运行。 有关详细信息，请参阅 https://aka.ms/dotnet/aspire/container-runtime-unhealthy
zh_hant: 找到容器執行階段，但似乎狀況不良。確保它執行中。 如需詳細資訊，請參閱 https://aka.ms/dotnet/aspire/container-runtime-unhealthy

# StateColumnResourceExited
source: {0} is no longer running
cs: {0} už neběží.
de: {0} wird nicht mehr ausgeführt.
es: {0} ya no se está ejecutando
fr: {0} n’est plus en cours d’exécution.
it: {0} non è più in esecuzione
ja: {0} が実行されなくなりました
ko: {0}(이)가 더 이상 실행되고 있지 않습니다.
pl: Wątek {0} już nie działa
pt_br: {0} não está mais em execução
ru: {0} больше не выполняется.
tr: {0} artık çalışmıyor
zh_hans: {0} 已不再运行
zh_hant: {0} 不再執行

# StateColumnResourceExitedUnexpectedly
source: {0} exited unexpectedly with exit code {1}
cs: Prostředek {0} byl neočekávaně ukončen s ukončovacím kódem {1}.
de: {0} wurde unerwartet mit dem Exitcode {1} beendet.
es: {0} se cerró inesperadamente con el código de salida {1}
fr: {0} s’est arrêté de manière inattendue avec le code {1}
it: La risorsa {0} è stata chiusa in modo imprevisto con codice di uscita {1}
ja: {0} は終了コード{1} で予期せず終了しました
ko: {0}(이)가 종료 코드 {1}(으)로 예기치 않게 종료되었습니다.
pl: Nieoczekiwanie zakończony {0} z kodem zakończenia {1}
pt_br: {0} saiu inesperadamente com o código de saída {1}
ru: {0} неожиданно завершила работу, вернув код {1}.
tr: {0} {1} çıkış kodu ile beklenmedik bir şekilde çıktı
zh_hans: {0} 已意外退出，退出代码为 {1}
zh_hant: {0} 意外結束，結束代碼: {1}

# StateColumnResourceNotStarted
source: Resource has not started because it's configured to not automatically start.
fr: La ressource n’a pas démarré, car elle est configurée pour ne pas démarrer automatiquement.
ko: 리소스가 자동으로 시작되지 않도록 구성되어 있어 시작되지 않았습니다.
zh_hant: 資源尚未啟動，因為它已設定為不會自動啟動。

# StateColumnResourceWaiting
source: Resource is waiting for other resources to be in a running and healthy state.
fr: La ressource attend que les autres ressources soient dans un état d’exécution et sain.
ko: 해당 리소스는 다른 리소스가 실행 중이며 정상 상태가 될 때까지 대기하고 있습니다.
zh_hant: 資源正在等待其他資源處於執行中且狀態良好。

# UnknownStateLabel
source: Unknown
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto
ja: 不明
ko: 알 수 없음
pl: Nieznane
ru: Неизвестно
zh_hans: 未知
zh_hant: 未知

# UnreadLogErrorsBadgeErrorLogs
source: {0} error logs
cs: Počet protokolů chyb: {0}
de: {0} Fehlerprotokolle
es: {0} registros de errores
fr: {0} journaux d’erreurs
it: {0} log degli errori
ja: {0} 件のエラー ログ
ko: {0}개의 오류 로그
pl: Dzienniki błędów: {0}
pt_br: {0} log de erros
ru: Журналов ошибок: {0}
tr: {0} hata günlükleri
zh_hans: {0} 个错误日志
zh_hant: {0} 錯誤記錄

# UnreadLogErrorsBadgeOneErrorLog
source: 1 error log
cs: 1 protokol chyb
de: 1 Fehlerprotokoll
es: 1 registro de errores
fr: 1 journal des erreurs
it: 1 log degli errori
ja: 1 件のエラー ログ
ko: 1개의 오류 로그
pl: 1 dziennik błędów
pt_br: 1 log de erro
ru: 1 журнал ошибок
tr: 1 hata günlüğü
zh_hans: 1 个错误日志
zh_hant: 1 個錯誤記錄

# UrlsColumnDisplayOverflowTitle
source: URLs
es: Direcciones URL
fr: URL
it: URL
ja: URL
ko: URL
pl: Adresy URL
ru: URL-адреса
zh_hans: URL
zh_hant: URL

# UrlsColumnDisplayPlaceholder
source: Starting...
de: Wird gestartet…
es: Iniciando...
fr: Démarrage en cours...
it: Avvio in corso...
ja: 開始しています...
ko: 시작하는 중...
pl: Trwa uruchamianie...
ru: Запуск...
zh_hans: 正在启动...
zh_hant: 正在啟動...

# RunningAndUnhealthyResourceStateToolTip
source: Resource is running but not in a healthy state. Click for details.
de: Die Ressource wird ausgeführt, befindet sich jedoch nicht in einem fehlerfreien Zustand. Klicken Sie hier, um Einzelheiten anzuzeigen.
es: El recurso se está ejecutando, pero no en un estado correcto. Haga clic aquí para obtener detalles.
ja: リソースは実行中ですが、正常な状態ではありません。クリックして詳細を表示してください。

# EndpointsColumnDisplayNone
source: None
cs: Žádné
pt_br: Nenhum
tr: Yok

# EndpointsColumnDisplayPlaceholder
source: Starting...
cs: Spouštění…
pt_br: Iniciando...
tr: Başlatılıyor...

# LogMessageColumnExceptionDetailsTitle
source: Exception details
cs: Podrobnosti o výjimce
pt_br: Detalhes da exceção
tr: Özel durum ayrıntıları
