Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/ConsoleLogs.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ConsoleLogsErrorWatchingLogs
source: Error watching logs
es: Error al ver los registros
pl: Błąd podczas oglądania dzienników
pt_br: Erro ao monitorar logs
zh_hans: 监视日志时出错

# ConsoleLogsFinishedWatchingLogs
source: Finished watching logs
cs: Dokončeno sledování protokolů
de: Die Protokollwiedergabe ist abgeschlossen.
es: Finalizó la visualización de registros
fr: Fin de la surveillance des journaux
it: Controllo dei log terminato
ja: ログの監視が完了しました
ko: 로그 보기 완료
pl: Zakończono oglądanie dzienników
pt_br: Concluída a observação dos logs
ru: Просмотр журналов завершен
tr: Günlükleri izleme tamamlandı
zh_hans: 已完成监视日志
zh_hant: 已完成監看記錄

# ConsoleLogsHeader
source: Console logs
cs: Protokoly konzoly
de: Konsolenprotokolle
es: Registros de consola
fr: Journaux de console
it: Log della console
ja: コンソール ログ
ko: 콘솔 로그
pl: Dzienniki konsoli
pt_br: Logs do console
ru: Журналы консоли
tr: Konsol günlükleri
zh_hans: 控制台日志
zh_hant: 主控台記錄

# ConsoleLogsLoadingResources
source: Loading resources ...
cs: Načítají se prostředky...
de: Ressourcen werden geladen...
es: Cargando recursos...
fr: Chargement en cours des ressources... Merci de patienter.
it: Caricamento delle risorse in corso...
ja: リソースを読み込んでいます ...
ko: 리소스를 로드하는 중...
pl: Trwa ładowanie zasobów...
pt_br: Carregando recursos ...
ru: Производится загрузка ресурсов...
tr: Kaynaklar yükleniyor ...
zh_hans: 正在加载资源...
zh_hant: 正在載入資源 ...

# ConsoleLogsLogsNotYetAvailable
source: Logs not yet available
cs: Protokoly ještě nejsou k dispozici.
de: Protokolle noch nicht verfügbar
es: Los registros aún no están disponibles
fr: Journaux non disponibles pour le moment
it: Log non ancora disponibili
ja: ログはまだ使用できません
ko: 로그를 아직 사용할 수 없음
pl: Dzienniki nie są jeszcze dostępne
pt_br: Logs ainda não disponíveis
ru: Журналы пока недоступны
tr: Günlükler henüz kullanılamıyor
zh_hans: 日志尚不可用
zh_hant: 記錄尚不可用

# ConsoleLogsNoResourceSelected
source: No resource selected
cs: Nevybrán žádný prostředek
de: Keine Ressource ausgewählt
es: No hay ningún recurso seleccionado
fr: Aucune ressource sélectionnée
it: Nessuna risorsa selezionata
ja: リソースが選択されていません
ko: 리소스를 선택하지 않음
pl: Nie wybrano zasobu
pt_br: Não há nenhum recurso selecionado
ru: Нет выбранных ресурсов
tr: Hiçbir kaynak seçilmedi
zh_hans: 未选择资源
zh_hant: 未選取任何資源

# ConsoleLogsNoWrapLogs
source: Don't wrap log lines
pt_br: Não empacotar linhas de log
zh_hans: 不将日志换行

# ConsoleLogsPageTitle
source: {0} console logs
cs: Protokoly konzoly aplikace {0}
de: {0} Konsolenprotokolle
es: Registros de consola de {0}
fr: Journaux de console {0}
it: {0} log della console
ja: {0} のコンソール ログ
ko: {0} 콘솔 로그
pl: Dzienniki konsoli: {0}
pt_br: {0} logs do console
ru: Журналов консоли: {0}
tr: {0} konsol günlükleri
zh_hans: {0} 控制台日志
zh_hant: {0} 主控台記錄

# ConsoleLogsPauseActive
source: <Log capture paused at {0}, {1} log(s) filtered out>
cs: <Zachytávání protokolu bylo pozastaveno v {0}, odfiltrované protokoly: {1}>
de: <Protokollerfassung wurde um {0} angehalten, {1} Protokoll(e) herausgefiltert>
es: < Captura de registro en pausa en {0}, {1} registros filtrados>
fr: <Capture de journal suspendue à {0}, {1} journal(aux) est(sont) filtré(s)>
it: <L'acquisizione del log è stata sospesa alle {0}, {1} log filtrati>
ja: <ログ キャプチャが {0} で一時停止されました。{1} 件のログがフィルターで除外されました>
ko: <로그 캡처가 {0}에 일시 중지되었습니다. {1} 로그에서 필터링되었습니다>
pl: <Przechwytywanie dziennika zostało wstrzymane {0}, liczba odfiltrowanych dzienników: {1}>
pt_br: <Captura de log em pausa às {0}, {1} logs filtrados>
zh_hans: <日志捕获已在 {0} 暂停，筛选掉 {1} 条日志>

# ConsoleLogsPauseDetails
source: <Log capture paused between {0} and {1}, {2} log(s) filtered out>
cs: <Zachytávání protokolů bylo pozastaveno mezi {0} a {1}, odfiltrované protokoly: {2} >
de: <Protokollerfassung wurde zwischen {0} und {1} angehalten, {2} Protokoll(e) herausgefiltert>
es: < Captura de registro en pausa entre {0} y {1}, {2} registros filtrados>
fr: <Capture de journal suspendue entre le ou les journaux {0} et {1}, {2} filtrés>
it: <L'acquisizione dei log è stata sospesa tra {0} e {1}, {2} log filtrati>
ja: <ログ キャプチャが {0} と {1} の間で一時停止されました。{2} 件のログがフィルターで除外されました>
ko: <로그 캡처가 {0} 및 {1}간에 일시 중지되었습니다. {2} 로그가 필터링되었습니다>
pl: <Przechwytywanie dziennika zostało wstrzymane między {0} a {1}, liczba odfiltrowanych dzienników: {2}>
pt_br: <Captura de log em pausa entre {0} e {1}, {2} logs filtrados>
zh_hans: <日志捕获已在 {0} 和 {1} 之间暂停，筛选掉 {2} 条日志>

# ConsoleLogsResourceActions
source: Resource actions
cs: Akce prostředku
de: Ressourcenaktionen
es: Acciones de recursos
fr: Actions sur les ressources
it: Azioni delle risorse
ja: リソース アクション
ko: 리소스 작업
pl: Akcje zasobów
pt_br: Ações do recurso
zh_hans: 资源操作

# ConsoleLogsSelectResourceToolbar
source: Select resource
cs: Vybrat prostředek
de: Ressource auswählen
es: Seleccionar recurso
fr: Sélectionner une ressource
it: Seleziona risorsa
ja: リソースの選択
ko: 리소스 선택
pl: Wybierz zasób
pt_br: Selecionar recurso
tr: Kaynak seç
zh_hans: 选择资源

source: Console logs settings
cs: Nastavení protokolů konzoly
de: Einstellungen für Konsolenprotokolle
es: Configuración de registros de consola
fr: Paramètres des journaux de la console
it: Impostazioni dei log della console
ja: コンソール ログの設定
ko: 콘솔 로그 설정
pl: Ustawienia dzienników konsoli
pt_br: Configurações de logs do console
tr: Konsol günlük ayarları
zh_hans: 控制台日志设置

# ConsoleLogsTimestampHide
source: Hide timestamps
cs: Skrýt časová razítka
de: Zeitstempel ausblenden
es: Ocultar marcas de tiempo
fr: Masquer les horodatages
it: Nascondi timestamp
ja: タイムスタンプを非表示
ko: 타임스탬프 숨기기
pl: Ukryj sygnatury czasowe
pt_br: Ocultar carimbos de data/hora
tr: Zaman damgalarını gizle
zh_hans: 隐藏时间戳

# ConsoleLogsTimestampShow
source: Show timestamps
cs: Zobrazit časová razítka
de: Zeitstempel anzeigen
es: Mostrar marcas de tiempo
fr: Afficher les horodatages
it: Mostra timestamp
ja: タイムスタンプを表示
ko: 타임스탬프 표시
pl: Pokaż sygnatury czasowe
pt_br: Mostrar carimbos de data/hora
tr: Zaman damgalarını göster
zh_hans: 显示时间戳

# ConsoleLogsTimestampShowUtc
source: UTC timestamps
cs: Časová razítka UTC
de: UTC-Zeitstempel
es: Marca de tiempo UTC
fr: Horodateurs UTC
it: Timestamp UTC
ja: UTC タイムスタンプ
ko: UTC 타임스탬프
pl: Sygnatury czasowe UTC
pt_br: Carimbos de data/hora UTC
zh_hans: UTC 时间戳

# ConsoleLogsUnknownState
source: Unknown state
cs: Neznámý stav
de: Unbekannter Status
es: Estado desconocido
fr: État inconnu
it: Stato sconosciuto
ja: 不明な状態
ko: 알 수 없는 상태
pl: Nieznany stan
pt_br: Estado desconhecido
ru: Неизвестное состояние
tr: Bilinmeyen durum
zh_hans: 未知状态
zh_hant: 未知狀態

# ConsoleLogsWatchingLogs
source: Watching logs...
cs: Sledují se protokoly...
de: Protokolle werden überwacht...
es: Visualizando registros...
fr: Surveillance en cours des journaux... Merci de patienter.
it: Controllo dei log in corso...
ja: ログを監視しています...
ko: 로그를 보는 중...
pl: Trwa oglądanie dzienników...
pt_br: Observando logs...
ru: Просмотр журналов...
tr: Günlükler izleniyor...
zh_hans: 正在监视日志...
zh_hant: 正在監看記錄...

# ConsoleLogsWrapLogs
source: Wrap log lines
pt_br: Empacotar linhas de log
zh_hans: 将日志换行

source: Download logs
cs: Stáhnout protokoly
de: Protokolle herunterladen
es: Descargar registros
fr: Télécharger les journaux
it: Scarica log
ja: ログのダウンロード
ko: 로그 다운로드
pl: Pobierz dzienniki
pt_br: Baixar logs
tr: İndirme günlükleri
zh_hans: 下载日志

# LogStatusLabel
source: Service log status
cs: Stav protokolu služby
de: Status des Dienstprotokolls
es: Estado del registro de servicio
fr: État du journal de service
it: Stato del log del servizio
ja: サービス ログの状態
ko: 서비스 로그 상태
pl: Stan dziennika usługi
pt_br: Status de log de serviço
ru: Состояние журнала службы
tr: Hizmet günlüğü durumu
zh_hans: 服务日志状态
zh_hant: 服務記錄狀態

# ConsoleLogsFailedToInitialize
source: Failed to initialize
cs: Nepovedlo se inicializovat.
fr: Impossible d’effectuer l’initialisation
ko: 초기화 실패
ru: Не удалось выполнить инициализацию
tr: Başlatılamadı
zh_hant: 無法初始化

# ConsoleLogsInitializingLogViewer
source: Initializing log viewer...
cs: Inicializuje se prohlížeč protokolů...
fr: Initialisation en cours de la visionneuse du journal... Merci de patienter.
ko: 로그 뷰어를 초기화하는 중...
ru: Инициализируется средство просмотра журналов...
tr: Günlük görüntüleyicisi başlatılıyor...
zh_hant: 正在初始化記錄檢視器...

# ConsoleLogsResourceCommands
source: Resource commands
tr: Kaynak komutları
