Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Dialogs.*.xlf
Languages: cs, de, fr, it, ja, pl, pt_br, ru, tr, zh_hans, zh_hant

# DialogCloseButtonText
source: Close
cs: Zavřít
de: Schließen
fr: Fermer
it: Chiudi
ja: 閉じる
pl: Zamknij
pt_br: Fechar
ru: Закрыть
tr: Kapat
zh_hans: 关闭
zh_hant: 關閉

# ExemplarsDialogDetailsColumnHeader
source: Details
cs: Podrobnosti
fr: Détails
it: Dettagli
ja: 詳細
pl: Szczegóły
pt_br: Detalhes
ru: Сведения
tr: Ayrıntılar
zh_hans: 详细信息
zh_hant: 詳細資料

# ExemplarsDialogTimestampColumnHeader
source: Timestamp
cs: Časové razítko
de: Zeitstempel
ja: タイムスタンプ
pl: Znacznik czasu
pt_br: Carimbo de data/hora
ru: Метка времени
tr: Zaman damgası
zh_hans: 时间戳
zh_hant: 時間戳記

# ExemplarsDialogTitle
source: Exemplars
cs: Příklady
de: Exemplare
fr: Exemplaires
it: Esemplari
ja: 手本
pl: Przykłady
pt_br: Exemplares
ru: Экземпляры
tr: Örnekler
zh_hans: 样本
zh_hant: 樣本

# ExemplarsDialogTrace
source: Trace
cs: Trasování
de: Ablaufverfolgung
it: Traccia
ja: トレース
pl: Ślad
pt_br: Rastreamento
ru: Трассировка
tr: İzleme
zh_hans: 跟踪
zh_hant: 追蹤

# ExemplarsDialogTraceColumnHeader
source: Trace
cs: Trasování
de: Ablaufverfolgung
it: Traccia
ja: トレース
pl: Ślad
pt_br: Rastreamento
ru: Трассировка
tr: İzleme
zh_hans: 跟踪
zh_hant: 追蹤

# ExemplarsDialogValueColumnHeader
source: Value
cs: Hodnota
de: Wert
fr: Valeur
it: Valore
ja: 値
pl: Wartość
pt_br: Valor
ru: Значение
tr: Değer
zh_hans: 值
zh_hant: 值

# FieldRequired
source: A value is required.
cs: Požaduje se hodnota.
de: Ein Wert ist erforderlich.
fr: Une valeur est requise.
it: È necessario specificare un valore.
ja: 値が必要です。
pl: Wymagana wartość.
pt_br: Um valor é necessário.
ru: Требуется значение.
tr: Değer gereklidir.
zh_hans: 值是必需的。
zh_hant: 必須有值。

# FieldTooLong
source: A maximum length of {1} characters is allowed.
cs: Je povolena maximální délka {1} znaků.
de: Eine maximale Länge von {1} Zeichen ist zulässig.
fr: Une longueur maximale de {1} caractères est autorisée.
it: È consentita una lunghezza massima di {1} caratteri.
ja: 最大長の {1} 文字を使用できます。
pl: Maksymalna dozwolona długość {1} znaków.
pt_br: Um comprimento máximo de {1} caracteres é permitido.
ru: Максимально допустимая {1} символов.
tr: En fazla {1} karaktere izin verilir.
zh_hans: 允许 {1} 字符的最大长度。
zh_hant: 允許 {1} 字元的長度上限。

# FilterDialogApplyFilterButtonText
source: Apply filter
cs: Použít filtr
de: Filter anwenden
fr: Appliquer le filtre
it: Applica filtro
ja: フィルターの適用
pl: Zastosuj filtr
pt_br: Aplicar filtro
ru: Применить фильтр
tr: Filtre uygula
zh_hans: 应用筛选器
zh_hant: 套用篩選

# FilterDialogCancelButtonText
source: Cancel
cs: Zrušit
de: Abbrechen
fr: Annuler
it: Annulla
ja: キャンセル
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
zh_hans: 取消
zh_hant: 取消

# FilterDialogConditionInputLabel
source: Condition
cs: Podmínka
de: Bedingung
it: Condizione
ja: 条件
pl: Warunek
pt_br: Condição
ru: Условие
tr: Koşul
zh_hans: 条件
zh_hant: 條件

# FilterDialogDisableAll
source: Disable all
cs: Zakázat vše
de: Alle deaktivieren
fr: Désactiver tout
it: Disabilita tutto
ja: すべて無効にする
pl: Wyłącz wszystko
pt_br: Desabilitar tudo
ru: Отключить все
tr: Tümünü devre dışı bırak
zh_hans: 全部禁用
zh_hant: 全部停用

# FilterDialogDisableFilterButtonText
source: Disable filter
cs: Zakázat filtr
de: Filter deaktivieren
fr: Désactiver le filtre
it: Disabilita filtro
ja: フィルターを無効にする
pl: Wyłącz filtr
pt_br: Desabilitar filtro
ru: Отключить фильтр
tr: Filtreyi devre dışı bırak
zh_hans: 禁用筛选器
zh_hant: 停用篩選

# FilterDialogEnableAll
source: Enable all
cs: Povolit vše
de: Alle aktivieren
fr: Activer tout
it: Abilita tutto
ja: すべて有効にする
pl: Włącz wszystko
pt_br: Habilitar tudo
ru: Включить все
tr: Tümünü etkinleştir
zh_hans: 全部启用
zh_hant: 全部啟用

# FilterDialogFieldPlaceholder
source: Field
cs: Pole
de: Feld
fr: Champ
it: Campo
ja: フィールド
pl: Pole
pt_br: Campo
ru: Поле
tr: Alan
zh_hans: 字段
zh_hant: 欄位

# FilterDialogParameterInputLabel
source: Parameter
cs: Parametr
fr: Paramètre
it: Parametro
ja: パラメーター
pl: Parametr
pt_br: Parâmetro
ru: Параметр
tr: Parametre
zh_hans: 参数
zh_hant: 參數

# FilterDialogRemoveFilterButtonText
source: Remove filter
cs: Odebrat filtr
de: Filter entfernen
fr: Supprimer le filtre
it: Rimuovi filtro
ja: フィルターの削除
pl: Usuń filtr
pt_br: Remover filtro
ru: Удалить фильтр
tr: Filtreyi kaldır
zh_hans: 移除筛选器
zh_hant: 移除篩選

# FilterDialogTextValuePlaceholder
source: Value
cs: Hodnota
de: Wert
fr: Valeur
it: Valore
ja: 値
pl: Wartość
pt_br: Valor
ru: Значение
tr: Değer
zh_hans: 值
zh_hant: 值

# GenAIDetailsTabText
source: Details
cs: Podrobnosti
fr: Détails
it: Dettagli
ja: 詳細
pl: Szczegóły
pt_br: Detalhes
ru: Сведения
tr: Ayrıntılar
zh_hans: 详细信息
zh_hant: 詳細資料

# GenAIDisplayErrorMessageText
source: Error displaying GenAI content:
cs: Chyba při zobrazování obsahu GenAI:
de: Fehler beim Anzeigen des GenAI-Inhalts:
fr: Erreur lors de l’affichage du contenu GenAI :
it: Errore durante la visualizzazione del contenuto di IA generativa:
ja: GenAI コンテンツの表示中にエラーが発生しました。
pl: Błąd podczas wyświetlania zawartości GenAI:
pt_br: Erro ao exibir conteúdo GenAI:
ru: Ошибка при отображении содержимого генеративного ИИ:
tr: GenAI içeriğini görüntüleme hatası:
zh_hans: 显示 GenAI 内容时出错:
zh_hant: 顯示生成式 AI 內容時發生錯誤:

# GenAIDurationLabel
source: Duration
cs: Doba trvání
de: Dauer
fr: Durée
it: Durata
ja: 期間
pl: Czas trwania
pt_br: Duração
ru: Длительность
tr: Süre
zh_hans: 持续时间
zh_hant: 期間

# GenAIErrorHeaderText
source: Error
cs: Chyba
de: Fehler
fr: Erreur
it: Errore
ja: エラー
pl: Błąd
pt_br: Erro
ru: Ошибка
tr: Hata
zh_hans: 错误
zh_hant: 錯誤

# GenAIEvaluationsTabText
source: Evaluations
cs: Vyhodnocení
de: Bewertungen
fr: Évaluations
it: Valutazioni
ja: 評価
pl: Oceny
pt_br: Avaliações
ru: Оценки
tr: Değerlendirmeler
zh_hans: 评估
zh_hant: 評估

# GenAIInputHeaderText
source: Input
cs: Vstup
de: Eingabe
fr: Entrée
ja: 入力
pl: Dane wejściowe
pt_br: Entrada
ru: Входные данные
tr: Giriş
zh_hans: 输入
zh_hant: 輸入

# GenAIInputOutputTabText
source: Input & output
cs: Vstup a výstup
de: Eingabe und Ausgabe
fr: Entrée et sortie
it: Input e output
ja: 入力と出力
pl: Dane wejściowe i dane wyjściowe
pt_br: Entrada e saída
ru: Входные и выходные данные
tr: Giriş ve çıkış
zh_hans: 输入/输出
zh_hant: 輸入和輸出

# GenAIInputTokensText
source: Input tokens: {0}
cs: Vstupní tokeny: {0}
de: Eingabetoken: {0}
fr: Jetons d’entrée : {0}
it: Token di input: {0}
ja: 入力トークン: {0}
pl: Tokeny wejściowe: {0}
pt_br: Tokens de entrada: {0}
ru: Входные токены: {0}
tr: Giriş belirteçleri: {0}
zh_hans: 输入词元数: {0}
zh_hant: 輸入權杖: {0}

# GenAIMessageCategoryMessage
source: Message
cs: Zpráva
de: Nachricht
it: Messaggio
ja: メッセージ
pl: Wiadomość
pt_br: Mensagem
ru: Сообщение
tr: İleti
zh_hans: 消息
zh_hant: 訊息

# GenAIMessageCategoryOutput
source: Output
cs: Výstup
de: Ausgabe
fr: Sortie
ja: 出力
pl: Dane wyjściowe
pt_br: Saída
ru: Выходные данные
tr: Çıkış
zh_hans: 输出
zh_hant: 輸出

# GenAIMessageCategoryStatus
source: Status
cs: Stav
fr: État
it: Stato
ja: 状態
pl: Stan
ru: Состояние
tr: Durum
zh_hans: 状态
zh_hant: 狀態

# GenAIMessageCategoryToolCalls
source: Tool calls
cs: Volání nástrojů
de: Toolaufrufe
fr: Appels d’outils
it: Chiamate strumento
ja: ツール呼び出し
pl: Wywołania narzędzi
pt_br: Chamadas de ferramenta
ru: Вызовы инструментов
tr: Araç çağrıları
zh_hans: 工具调用
zh_hant: 工具呼叫

# GenAIMessageCategoryToolResponse
source: Tool response
cs: Odpověď nástroje
de: Toolantwort
fr: Réponse de l’outil
it: Risposta dello strumento
ja: ツールの応答
pl: Odpowiedź narzędzia
pt_br: Resposta da ferramenta
ru: Ответ инструмента
tr: Araç yanıtı
zh_hans: 工具响应
zh_hant: 工具回應

# GenAIMessageTitleAssistant
source: Assistant
cs: Asistent
de: Assistent
it: Assistente
ja: アシスタント
pl: Asystent
pt_br: Assistente
ru: Помощник
tr: Yardımcı
zh_hans: 助手
zh_hant: 助理

# GenAIMessageTitleError
source: Error
cs: Chyba
de: Fehler
fr: Erreur
it: Errore
ja: エラー
pl: Błąd
pt_br: Erro
ru: Ошибка
tr: Hata
zh_hans: 错误
zh_hant: 錯誤

# GenAIMessageTitleSystem
source: System
cs: Systém
fr: Système
it: Sistema
ja: システム
pt_br: Sistema
ru: Система
tr: Sistem
zh_hans: 系统
zh_hant: 系統

# GenAIMessageTitleTool
source: Tool
cs: Nástroj
fr: Outil
it: Strumento
ja: ツール
pl: Narzędzie
pt_br: Ferramenta
ru: Инструмент
tr: Araç
zh_hans: 工具
zh_hant: 工具

# GenAIMessageTitleUser
source: User
cs: Uživatel
de: Benutzende Person
fr: Utilisateur(-trice)
it: Utente
ja: ユーザー
pl: Użytkownik
pt_br: Usuário
ru: Пользователь
tr: Kullanıcı
zh_hans: 用户
zh_hant: 使用者

# GenAINAText
source: n/a
cs: není k dispozici
de: n/v
it: N/D
pl: brak
ru: нет данных
tr: yok
zh_hant: 不適用

# GenAINextButtonText
source: Next
cs: Další
de: Weiter
fr: Suivant
it: Avanti
ja: 次へ
pl: Dalej
pt_br: Próximo
ru: Далее
tr: Sonraki
zh_hans: 下一步
zh_hant: 下一步

# GenAINoMessageContent
source: No message content.
cs: Žádný obsah zprávy
de: Kein Nachrichteninhalt.
fr: Désolé, aucun contenu du message.
it: Nessun contenuto messaggio.
ja: メッセージの内容がありません。
pl: Brak zawartości wiadomości.
pt_br: Nenhum conteúdo de mensagem.
ru: Нет содержимого сообщения.
tr: İleti içeriği yok.
zh_hans: 无消息内容。
zh_hant: 沒有訊息內容。

# GenAINoMessageContentMoreInformationMessage
source: No message content was recorded to telemetry. Additional configuration may be required to view sensitive content. For more information, see <a href="{0}" target="_blank">AI telemetry configuration</a>.
cs: Do telemetrie nebyl zaznamenán žádný obsah zprávy. K zobrazení citlivého obsahu může být nutná další konfigurace. Další informace najdete v <a href="{0}" target="_blank">konfiguraci telemetrie AI</a>.
de: Es wurde kein Nachrichteninhalt in den Telemetriedaten aufgezeichnet. Möglicherweise ist eine zusätzliche Konfiguration erforderlich, um vertrauliche Inhalte anzuzeigen. Weitere Informationen finden Sie unter <a href="{0}" target="_blank">KI-Telemetriekonfiguration</a>.
fr: Désolé, aucun contenu de message n’a été enregistré dans la télémétrie. Une configuration supplémentaire peut être nécessaire pour afficher le contenu sensible. Pour plus d’informations, consultez <a href="{0}" target="_blank"> la configuration de la télémétrie IA </a>.
it: Non è registrato alcun contenuto messaggio per la telemetria. Potrebbe essere necessaria una configurazione aggiuntiva per visualizzare il contenuto sensibile. Per ulteriori informazioni, vedere <a href="{0}" target="_blank">Configurazione della telemetria IA</a>.
ja: テレメトリにメッセージ コンテンツが記録されませんでした。機密コンテンツを表示するには、追加の構成が必要になる場合があります。詳細については、<a href="{0}" target="_blank">AI テレメトリ構成</a>を参照してください。
pl: W telemetrii nie zarejestrowano żadnej zawartości wiadomości. Do wyświetlenia poufnej zawartości może być wymagana dodatkowa konfiguracja. Aby uzyskać więcej informacji, zobacz <a href="{0}" target="_blank">konfigurację telemetrii AI</a>.
pt_br: Nenhum conteúdo de mensagem foi registrado na telemetria. Configuração adicional pode ser necessária para visualizar conteúdo sensível. Para obter mais informações, consulte <a href="{0}" target="_blank">configuração de telemetria de IA</a>.
ru: Содержимое сообщения не было записано в телеметрию. Для просмотра конфиденциального содержимого может потребоваться дополнительная настройка. Подробнее см. в <a href="{0}" target="_blank">конфигурации телеметрии ИИ</a>.
tr: Telemetriye hiçbir ileti içeriği kaydedilmedi. Hassas içeriği görüntülemek için ek yapılandırma gerekebilir. Daha fazla bilgi için bkz. <a href="{0}" target="_blank">Yapay zeka telemetri yapılandırması</a>.
zh_hans: 未将任何消息内容记录到遥测。可能需要其他配置才能查看敏感内容。有关详细信息，请参阅 <a href="{0}" target="_blank">AI 遥测配置</a>。
zh_hant: 未將任何訊息內容記錄到遙測。可能需要其他設定才能檢視敏感性內容。如需詳細資訊，請參閱 <a href="{0}" target="_blank">AI 遙測設定</a>。

# GenAINoMessages
source: No messages found.
cs: Nenašly se žádné zprávy.
de: Keine Nachrichten gefunden.
fr: Désolé, aucun message trouvé.
it: Non sono stati trovati messaggi.
ja: メッセージが見つかりません。
pl: Nie znaleziono komunikatów.
pt_br: Nenhuma mensagem encontrada.
ru: Сообщения не найдены.
tr: İleti bulunamadı.
zh_hans: 找不到消息。
zh_hant: 找不到訊息。

# GenAINoTools
source: No tools found.
cs: Nenašly se žádné nástroje.
de: Keine Tools gefunden.
fr: Aucun outil trouvé.
it: Nessuno strumento trovato.
ja: ツールが見つかりません。
pl: Nie znaleziono żadnych narzędzi.
pt_br: Nenhuma ferramenta encontrada.
ru: Инструменты не найдены.
tr: Hiçbir araç bulunamadı.
zh_hans: 未找到任何工具。
zh_hant: 找不到工具。

# GenAIOutputHeaderText
source: Output
cs: Výstup
de: Ausgabe
fr: Sortie
ja: 出力
pl: Dane wyjściowe
pt_br: Saída
ru: Выходные данные
tr: Çıkış
zh_hans: 输出
zh_hant: 輸出

# GenAIOutputTokensText
source: Output tokens: {0}
cs: Výstupní tokeny: {0}
de: Ausgabetoken: {0}
fr: Jetons de sortie : {0}
it: Token di output: {0}
ja: 出力トークン: {0}
pl: Tokeny wyjściowe: {0}
pt_br: Tokens de saída: {0}
ru: Выходные токены: {0}
tr: Çıkış belirteçleri: {0}
zh_hans: 输出词元数: {0}
zh_hant: 輸出權杖: {0}

# GenAIPreviewTabText
source: Preview
de: Vorschau
fr: Préversion
it: Anteprima
ja: プレビュー
pl: Podgląd
pt_br: Visualizar
ru: Предварительный просмотр
tr: Önizleme
zh_hans: 预览
zh_hant: 預覽

# GenAIPreviousButtonText
source: Previous
cs: Předchozí
de: Zurück
fr: Précédent
it: Indietro
ja: 前へ
pl: Wstecz
pt_br: Anterior
ru: Назад
tr: Önceki
zh_hans: 上一步
zh_hant: 上一步

# GenAIRawTabText
source: Raw
cs: Nezpracováno
de: Roh
fr: Brut
it: Non elaborato
pl: Nieprzetworzone
pt_br: Bruto
ru: Без обработки
tr: Ham
zh_hans: 原始
zh_hant: 原始

# GenAITokensLabel
source: Tokens
cs: Tokeny
de: Token
fr: Jetons
it: Token
ja: トークン
pl: Tokeny
ru: Токены
tr: Belirteçler
zh_hans: 词元
zh_hant: 權杖

# GenAIToolNoParameters
source: No parameters
cs: Žádné parametry
de: Keine Parameter
fr: Aucun paramètre
it: Nessun parametro
ja: パラメーターがありません
pl: Brak parametrów
pt_br: Nenhum parâmetro
ru: Нет параметров
tr: Parametre yok
zh_hans: 无参数
zh_hant: 無參數

# GenAIToolParameterDescription
source: Description
cs: Popis
de: Beschreibung
it: Descrizione
ja: 説明
pl: Opis
pt_br: Descrição
ru: Описание
tr: Açıklama
zh_hans: 描述
zh_hant: 描述

# GenAIToolParameterName
source: Name
cs: Název
fr: Nom
it: Nome
ja: 名前
pl: Nazwa
pt_br: Nome
ru: Имя
tr: Ad
zh_hans: 名称
zh_hant: 名稱

# GenAIToolParameterType
source: Type
cs: Typ
de: Typ
it: Tipo
ja: 種類
pl: Typ
pt_br: Tipo
ru: Тип
tr: Tür
zh_hans: 类型
zh_hant: 類型

# GenAIToolRequiredParameter
source: Required parameter
cs: Povinný parametr
de: Erforderlicher Parameter
fr: Paramètre obligatoire
it: Parametro obbligatorio
ja: 必須のパラメーター
pl: Wymagany parametr
pt_br: Parâmetro obrigatório
ru: Обязательный параметр
tr: Gerekli parametre
zh_hans: 必需的参数
zh_hant: 必要參數

# GenAIToolsTabText
source: Tools
cs: Nástroje
fr: Outils
it: Strumenti
ja: ツール
pl: Narzędzia
pt_br: Ferramentas
ru: Инструменты
tr: Araçlar
zh_hans: 工具
zh_hant: 工具

# HelpDialogCategoryNavigation
source: Site-wide navigation
cs: Navigace na úrovni webu
de: Websiteweite Navigation
fr: Navigation à l’échelle du site
it: Spostamento a livello di sito
ja: サイト全体のナビゲーション
pl: Nawigacja w całej witrynie
pt_br: Navegação em todo o site
ru: Навигация на уровне сайта
tr: Site genelinde gezinti
zh_hans: 网站范围导航
zh_hant: 全網站瀏覽

# HelpDialogCategoryPageNavigation
source: Page navigation
cs: Navigace po stránkách
de: Seitennavigation
fr: Navigation entre les pages
it: Spostamento tra le pagine
ja: ページの移動
pl: Nawigacja między stronami
pt_br: Navegação na página
ru: Перемещение по страницам
tr: Sayfa gezintisi
zh_hans: 网页导航
zh_hant: 頁面瀏覽

# HelpDialogCategoryPanels
source: Panels
cs: Panely
de: Bereiche
fr: Panneaux
it: Pannelli
ja: パネル
pl: Panele
pt_br: Painéis
ru: Панели
tr: Paneller
zh_hans: 面板
zh_hant: 面板

# HelpDialogDecreasePanelSize
source: Decrease panel size
cs: Zmenšit velikost panelu
de: Bereichsgröße verringern
fr: Diminuer la taille du panneau
it: Riduci dimensioni del pannello
ja: パネルのサイズを小さくする
pl: Zmniejsz rozmiar panelu
pt_br: Diminuir tamanho do painel
ru: Уменьшить размер панели
tr: Panel boyutunu küçült
zh_hans: 减小面板大小
zh_hant: 減少面板大小

# HelpDialogGetHelpLinkText
source: Go to Microsoft Learn documentation
cs: Přejít na dokumentaci Microsoft Learn
de: Zur Microsoft Learn-Dokumentation wechseln
fr: Accédez à la documentation Microsoft Learn
it: Vai alla documentazione di Microsoft Learn
ja: Microsoft Learn ドキュメントに移動
pl: Przejdź do dokumentacji usługi Microsoft Learn
pt_br: Ir para a documentação do Microsoft Learn
ru: Перейти к документации Microsoft Learn
tr: Microsoft Learn belgelerine git
zh_hans: 转到 Microsoft Learn 文档
zh_hant: 前往 Microsoft Learn 文件

# HelpDialogGoToConsoleLogs
source: Go to Console Logs
cs: Přejít na Protokoly konzoly
de: Zu Konsolenprotokollen wechseln
fr: Accéder aux journaux de console
it: Vai a Log della console
ja: コンソール ログに移動
pl: Przejdź do dzienników konsoli
pt_br: Ir para Logs do Console
ru: Перейти к журналам консоли
tr: Konsol Günlükleri'ne Git
zh_hans: 转到“控制台日志”
zh_hant: 前往 [主控台記錄]

# HelpDialogGoToHelp
source: Go to Help
cs: Přejít na Nápověda
de: Zur Hilfe wechseln
fr: Accéder à l’aide
it: Vai a Guida
ja: ヘルプに移動
pl: Przejdź do Pomocy
pt_br: Ir para Ajuda
ru: Перейти к справке
tr: Yardım'a git
zh_hans: 转到“帮助”
zh_hant: 前往 [說明]

# HelpDialogGoToMetrics
source: Go to Metrics
cs: Přejít na Metriky
de: Zu Metriken wechseln
fr: Accéder aux métriques
it: Vai a Metriche
ja: メトリックに移動
pl: Przejdź do metryk
pt_br: Ir para Métricas
ru: Перейти к метрикам
tr: Ölçümlere Git
zh_hans: 转到“指标”
zh_hant: 移至 [計量]

# HelpDialogGoToResources
source: Go to Resources
cs: Přejít na Zdroje informací
de: Zu Ressourcen wechseln
fr: Accéder aux ressources
it: Vai a Risorse
ja: リソースに移動
pl: Przejdź do zasobów
pt_br: Ir para Recursos
ru: Перейти к ресурсам
tr: Kaynaklar'a git
zh_hans: 转到“资源”
zh_hant: 前往 [資源]

# HelpDialogGoToSettings
source: Go to Settings
cs: Přejít na Nastavení
de: Zu Einstellungen wechseln
fr: Accéder aux paramètres
it: Vai a Impostazioni
ja: 設定に移動
pl: Przejdź do ustawień
pt_br: Ir para Configurações
ru: Перейти к параметрам
tr: Ayarlar'a git
zh_hans: 转到“设置”
zh_hant: 前往 [設定]

# HelpDialogGoToStructuredLogs
source: Go to Structured Logs
cs: Přejít na Strukturované protokoly
de: Zu strukturierten Protokollen wechseln
fr: Accéder aux journaux structurés
it: Vai a Log strutturati
ja: 構造化ログに移動
pl: Przejdź do dzienników strukturalnych
pt_br: Ir para Logs Estruturados
ru: Перейти к структурированным журналам
tr: Yapılandırılmış Günlükler'e git
zh_hans: 转到“结构化日志”
zh_hant: 前往 [結構化記錄]

# HelpDialogGoToTraces
source: Go to Traces
cs: Přejít na Trasování
de: Zu Ablaufverfolgungen wechseln
fr: Accéder aux traces
it: Vai a Tracce
ja: トレースに移動
pl: Przejdź do obszaru Ślady
pt_br: Ir para Rastreamentos
ru: Перейти к трассировкам
tr: İzlemelere Git
zh_hans: 转到“跟踪”
zh_hant: 前往 [追蹤]

# HelpDialogIncreasePanelSize
source: Increase panel size
cs: Zvětšit velikost panelu
de: Bereichsgröße erhöhen
fr: Augmenter la taille du panneau
it: Aumenta dimensioni del pannello
ja: パネルのサイズを大きくする
pl: Zwiększ rozmiar panelu
pt_br: Aumentar o tamanho do painel
ru: Увеличить размер панели
tr: Panel boyutunu artır
zh_hans: 增加面板大小
zh_hant: 增加面板大小

# HelpDialogKeyboardShortcutsTitle
source: Keyboard Shortcuts
cs: Klávesové zkratky
de: Tastenkombinationen
fr: Raccourcis clavier
it: Scelte rapide da tastiera
ja: キーボード ショートカット
pl: Skróty klawiaturowe
pt_br: Atalhos de Teclado
ru: Сочетания клавиш
tr: Klavye Kısayolları
zh_hans: 键盘快捷方式
zh_hant: 鍵盤快速鍵

# HelpDialogResetPanelSize
source: Reset panel sizes
cs: Obnovit velikosti panelu
de: Bereichsgrößen zurücksetzen
fr: Réinitialiser les tailles de panneau
it: Ripristina dimensioni del pannello
ja: パネル サイズのリセット
pl: Resetuj rozmiary paneli
pt_br: Redefinir tamanhos do painel
ru: Сбросить размеры панели
tr: Panel boyutlarını sıfırla
zh_hans: 重置面板大小
zh_hant: 重設面板大小

# HelpDialogTogglePanelOpen
source: Close panel
cs: Zavřít panel
de: Bereich schließen
fr: Fermer le panneau
it: Chiudi pannello
ja: パネルを閉じる
pl: Zamknij panel
pt_br: Fechar o painel
ru: Закрыть панель
tr: Paneli kapat
zh_hans: 关闭面板
zh_hant: 關閉面板

# HelpDialogTogglePanelOrientation
source: Toggle panel orientation
cs: Přepnout orientaci panelu
de: Bereichsausrichtung umschalten
fr: Activer/désactiver l’orientation du panneau
it: Attiva/Disattiva orientamento del pannello
ja: パネルの向きを切り替える
pl: Przełącz orientację panelu
pt_br: Alternar orientação do painel
ru: Переключить ориентацию панели
tr: Panelin yönünü değiştir
zh_hans: 切换面板方向
zh_hant: 切換面板方向

# InteractionButtonCancel
source: Cancel
cs: Zrušit
de: Abbrechen
fr: Annuler
it: Annulla
ja: キャンセル
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
zh_hans: 取消
zh_hant: 取消

# InteractionButtonClose
source: Close
cs: Zavřít
de: Schließen
fr: Fermer
it: Chiudi
ja: 閉じる
pl: Zamknij
pt_br: Fechar
ru: Закрыть
tr: Kapat
zh_hans: 关闭
zh_hant: 關閉

# InteractionButtonOk
source: OK
ru: ОК
tr: Tamam
zh_hans: 确定
zh_hant: 確定

# McpServerDialogApiKeyLabel
source: Aspire MCP API key
cs: Klíč rozhraní API Aspirovat MCP
de: Aspire MCP-API-Schlüssel
it: Chiave API di Aspire MCP
ja: Aspire MCP API キー
pl: Klucz interfejsu API Aspire MCP
pt_br: Chave de API do Aspire MCP
ru: Ключ API Aspire MCP
tr: Aspire MCP API anahtarı
zh_hans: Aspire MCP API 密钥
zh_hant: Aspire MCP API 金鑰

# McpServerDialogCliInstructionsAbove
source: The fastest way to get started is to <a href="{0}" target="_blank">configure the Aspire MCP using the CLI</a>
cs: Nejrychlejší způsob, jak začít, je <a href="{0}" target="_blank">nakonfigurovat Aspire MCP pomocí CLI</a>
de: Die schnellste Möglichkeit, um zu beginnen, <a href="{0}" target="_blank">ist die Konfiguration der Aspire MCP über das CLI</a>
it: Il modo più rapido per iniziare consiste nel <a href="{0}" target="_blank">configurare Aspire MCP usando l'interfaccia della riga di comando</a>
ja: 作業を開始する最も簡単な方法は、<a href="{0}" target="_blank">CLI を使って Aspire MCP を構成する</a>ことです
pl: Najszybszym sposobem rozpoczęcia jest <a href="{0}" target="_blank">skonfigurowanie MSP platformy Aspire przy użyciu interfejsu wiersza polecenia</a>
pt_br: A maneira mais rápida de começar é <a href="{0}" target="_blank">configurar o Aspire MCP usando a CLI</a>
ru: Самый быстрый способ начать работу — <a href="{0}" target="_blank">настроить Aspire MCP с помощью CLI</a>
tr: Başlamak için en hızlı yol <a href="{0}" target="_blank">Aspire MCP'yi CLI kullanarak yapılandırmaktır</a>
zh_hans: 最快开始的方法是<a href="{0}" target="_blank">使用 CLI 配置 Aspire MCP</a>
zh_hant: 開始使用最快的方法，就是<a href="{0}" target="_blank">使用 CLI 設定 Aspire MCP</a>

# McpServerDialogCliInstructionsBelow
source: The <code>aspire mcp init</code> command writes MCP JSON to your local workspace. Alternatively, configure your local AI development tools using instructions below.
cs: Příkaz <code>aspire mcp init</code> zapíše JSON MCP do místního pracovního prostoru. Další možností je nakonfigurovat místní nástroje pro vývoj AI podle následujících pokynů.
de: Mit dem Befehl <code>aspire mcp init</code> wird MCP JSON in Ihren lokalen Arbeitsbereich geschrieben. Alternativ können Sie Ihre lokalen KI-Entwicklungstools mithilfe der folgenden Anweisungen konfigurieren.
it: Il comando <code>aspire mcp init</code> scrive codice JSON MCP nell'area di lavoro locale. In alternativa, configurare gli strumenti di sviluppo basati su IA locali usando le istruzioni riportate di seguito.
ja: <code>aspire mcp init</code> コマンドは、ローカル ワークスペースに MCP JSON を書き込みます。または、以下の手順を使用して、ローカルの AI 開発ツールを構成します。
pl: Polecenie <code>aspire mcp init</code> zapisuje kod MCP JSON w lokalnym obszarze roboczym. Alternatywnie skonfiguruj lokalne narzędzia programistyczne sztucznej inteligencji, korzystając z poniższych instrukcji.
pt_br: O comando <code>aspire mcp init</code> grava o JSON do MCP no seu workspace local. Como alternativa, configure suas ferramentas locais de desenvolvimento de IA usando as instruções abaixo.
ru: Команда <code>aspire mcp init</code> записывает JSON MCP в локальную рабочую область. Кроме того, можно настроить локальные средства разработки ИИ, следуя приведенным ниже инструкциям.
tr: <code>aspire mcp init</code> komutu MCP JSON dosyasını yerel çalışma alanınıza yazar. Alternatif olarak, aşağıdaki talimatları kullanarak yerel yapay zeka geliştirme araçlarınızı yapılandırabilirsiniz.
zh_hans: <code>aspire mcp init</code> 命令将 MCP JSON 写入你的本地工作区。或者，按照下面的说明来配置本地 AI 开发工具。
zh_hant: <code>aspire mcp init</code> 命令會將 MCP JSON 寫入您的本機工作區。或者，使用下列指示設定您的本機 AI 開發工具。
