Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Dialogs.*.xlf
Languages: cs, de, fr, it, ja, pl, pt_br, ru, tr, zh_hans, zh_hant

# McpServerDialogConfigurationHeading
source: Aspire MCP configuration
cs: Konfigurace Aspire MCP
de: Aspire MCP-Konfiguration
fr: Configuration Aspire MCP
it: Configurazione di Aspire MCP
ja: Aspire MCP 構成
pl: Konfiguracja Aspire MCP
pt_br: Configuração do Aspire MCP
ru: Конфигурация Aspire MCP
tr: Aspire MCP yapılandırması
zh_hans: Aspire MCP 配置
zh_hant: Aspire MCP 設定

# McpServerDialogCopyButton
source: Copy
cs: Kopírovat
de: Kopieren
it: Copia
ja: コピー
pl: Kopiuj
pt_br: Copiar
ru: Копировать
tr: Kopyala
zh_hans: 复制
zh_hant: 複製

# McpServerDialogInstallButtonAriaLabelVSCode
source: VS Code: Install Aspire MCP Server
cs: VS Code: Instalace serveru Aspire MCP
de: VS Code: Installieren des Aspire-MCP-Servers
fr: VS Code : installer le serveur Aspire MCP
it: VS Code: installare il server Aspire MCP
ja: VS Code: Aspire MCP サーバーのインストール
pl: Vs Code: instalowanie serwera Aspire MCP
pt_br: VS Code: Instalar o Servidor Aspire MCP
ru: VS Code: установка сервера Aspire MCP
tr: VS Code: Aspire MCP Sunucusunu Yükle
zh_hans: VS Code: 安装 Aspire MCP 服务器
zh_hant: VS Code: 安裝 Aspire MCP 伺服器

# McpServerDialogInstallButtonAriaLabelVSCodeInsiders
source: VS Code Insiders: Install Aspire MCP Server
cs: Účastníci programu Insiders VS Code: Instalace serveru Aspire MCP
de: VS Code-Insider: Installieren von Aspire-MCP-Server
fr: VS Code Insiders : installer le serveur Aspire MCP
it: VS Code Insiders: installare il server Aspire MCP
ja: VS Code Insiders: Aspire MCP サーバーのインストール
pl: Niejawni testerzy programu VS Code: instalowanie serwera Aspire MCP
pt_br: VS Code Insiders: Instalar o Servidor Aspire MCP
ru: VS Code Insiders: установка сервера Aspire MCP
tr: VS Code Insiders: Aspire MCP Sunucusunu Yükle
zh_hans: VS Code Insiders: 安装 Aspire MCP 服务器
zh_hant: VS Code Insiders: 安裝 Aspire MCP 伺服器

# McpServerDialogInstallButtonAriaLabelVisualStudio
source: Visual Studio: Install Aspire MCP Server
cs: Visual Studio: Instalace serveru Aspire MCP
de: Visual Studio: Installieren von Aspire MCP Server
fr: Visual Studio : installer le serveur Aspire MCP
it: Visual Studio: installare il server Aspire MCP
ja: Visual Studio: Aspire MCP サーバーのインストール
pl: Visual Studio: zainstaluj serwer Aspire MCP
pt_br: Visual Studio: Instalar o Servidor Aspire MCP
ru: Visual Studio: установка сервера Aspire MCP
tr: Visual Studio: Aspire MCP Sunucusunu Yükle
zh_hans: Visual Studio: 安装 Aspire MCP 服务器
zh_hant: Visual Studio： 安裝 Aspire MCP 伺服器

# McpServerDialogIntroduction
source: Aspire MCP connects AI assistants to Aspire app data. AI can use Aspire MCP to get information about app resources, health checks, commands, console logs and real-time telemetry.
cs: Aspire MCP připojí asistenty AI k datům aplikace Aspire. AI může pomocí Aspire MCP získat informace o prostředcích aplikace, kontrolách stavu, příkazech, protokolech konzoly a telemetrii v reálném čase.
de: Aspire MCP verbindet KI-Assistenten mit Aspire App-Daten. KI kann mithilfe von Aspire MCP Informationen zu App-Ressourcen, Integritätsprüfungen, Befehlen, Konsolenprotokollen und Echtzeittelemetriedaten abrufen.
fr: Aspire MCP connecte les assistants IA aux données de l’application Aspire. L’IA peut utiliser Aspire MCP pour obtenir des informations sur les ressources de l’application, les contrôles d’intégrité, les commandes, les journaux de la console et la télémétrie en temps réel.
it: Aspire MCP connette gli assistenti IA ai dati dell'app Aspire. L'intelligenza artificiale può usare Aspire MCP per ottenere informazioni su risorse dell'app, controlli di integrità, comandi, log della console e dati di telemetria in tempo reale.
ja: Aspire MCP により、AI アシスタントが Aspire アプリ データに接続されます。AI は Aspire MCP を使って、アプリのリソース、正常性チェック、コマンド、コンソール ログ、リアルタイム テレメトリに関する情報を取得できます。
pl: Aspire MCP łączy asystentów AI z danymi aplikacji Aspire. AI może korzystać z Aspire MCP, aby uzyskać informacje o zasobach aplikacji, kontrolach stanu, poleceniach, dziennikach konsoli oraz telemetrii w czasie rzeczywistym.
pt_br: O Aspire MCP conecta assistentes de IA aos dados do aplicativo Aspire. A IA pode usar o Aspire MCP para obter informações sobre recursos do aplicativo, verificações de integridade, comandos, logs do console e telemetria em tempo real.
ru: Aspire MCP подключает ИИ-помощников к данным приложения Aspire. ИИ может использовать Aspire MCP для получения информации о ресурсах приложения, проверках работоспособности, командах, журналах консоли и телеметрии в реальном времени.
tr: Aspire MCP, yapay zeka asistanlarını Aspire uygulama verilerine bağlar. Yapay zeka, Aspire MCP'yi kullanarak uygulama kaynakları, durum kontrolleri, komutlar, konsol günlükleri ve gerçek zamanlı telemetri hakkında bilgi edinebilir.
zh_hans: Aspire MCP 将 AI 助手连接到 Aspire 应用数据。AI 可通过 Aspire MCP 获取应用资源、运行状况检查、命令、控制台日志和实时遥测信息。
zh_hant: Aspire MCP 會將 AI 助理連線到 Aspire 應用程式資料。AI 可以使用 Aspire MCP 來取得應用程式資源、健康情況檢查、命令、主控台記錄及即時遙測的相關資訊。

# McpServerDialogLearnMoreLink
source: Use Aspire MCP with AI
cs: Použití Aspire MCP s AI
de: Verwenden von Aspire MCP mit KI
fr: Utiliser Aspire MCP avec l’IA
it: Usa Aspire MCP con intelligenza artificiale
ja: AI と Aspire MCP を使用する
pl: Używaj Aspire MCP z AI
pt_br: Usar o Aspire MCP com IA
ru: Использование Aspire MCP с ИИ
tr: Aspire MCP'yi Yapay Zeka ile kullan
zh_hans: 将 Aspire MCP 与 AI 配合使用
zh_hant: 使用 Aspire MCP 搭配 AI

# McpServerDialogManuallyUpdatingAccordionHeading
source: Manually updating <code>mcp.json</code>
cs: Ruční aktualizace <code>mcp.json</code>
de: Manuelles Aktualisieren von <code>mcp.json</code>
it: Aggiornamento manuale di <code>mcp.json</code> in corso...
ja: <code>mcp.json</code> を手動で更新する
pl: Ręczne aktualizowanie <code>mcp.json</code>
pt_br: Atualizando manualmente <code>mcp.json</code>
ru: Ручное обновление <code>mcp.json</code>
tr: <code>mcp.json</code> el ile güncelleştiriliyor
zh_hans: 手动更新 <code>mcp.json</code>
zh_hant: 手動更新 <code>mcp.json</code>

# McpServerDialogOtherDescription
source: Aspire MCP can be used with any AI tooling that supports streamable HTTP MCP servers.
cs: Aspire MCP se dá použít s libovolnými nástroji AI, které podporují streamovatelné servery HTTP MCP.
de: Aspire MCP kann mit allen KI-Tools verwendet werden, die streambare HTTP-MCP-Server unterstützen.
fr: Aspire MCP peut être utilisé avec tout outil IA qui prend en charge les serveurs MCP HTTP diffusables en continu.
it: Aspire MCP può essere usato con qualsiasi strumento di intelligenza artificiale che supporta server MCP HTTP abilitati per lo streaming.
ja: Aspire MCP は、ストリーミング可能な HTTP MCP サーバーをサポートする任意の AI ツールで使用できます。
pl: Aspire MCP można używać z dowolnymi narzędziami AI, które obsługują strumieniowe serwery HTTP MCP.
pt_br: O Aspire MCP pode ser usado com qualquer ferramenta de IA que dê suporte a servidores MCP HTTP com streaming.
ru: Aspire MCP можно использовать с любыми инструментами ИИ, поддерживающими HTTP-серверы MCP с возможностью потоковой передачи.
tr: Aspire MCP, akışa uygun HTTP MCP sunucularını destekleyen tüm yapay zeka araçlarıyla kullanılabilir.
zh_hans: Aspire MCP 可与任何支持可流式传输的 HTTP MCP 服务器的 AI 工具配合使用。
zh_hant: Aspire MCP 可以搭配支援可串流 HTTP MCP 伺服器的任何 AI 工具使用。

# McpServerDialogOtherInstructions
source: Important details for configuring Aspire MCP are below. Please refer to your AI client's documentation for how to add an MCP server.
cs: Důležité podrobnosti pro konfiguraci Aspire MCP najdete níže. Postup přidání serveru MCP najdete v klientově dokumentaci k AI.
de: Wichtige Details zum Konfigurieren von Aspire-MCP finden Sie unten. Informationen zum Hinzufügen eines MCP-Servers finden Sie in der Dokumentation Ihres KI-Clients.
fr: Vous trouverez ci-dessous des détails importants pour la configuration d’Aspire MCP. Reportez-vous à la documentation de votre client IA pour savoir comment ajouter un serveur MCP.
it: Di seguito sono riportati i dettagli importanti per la configurazione di Aspire MCP. Per informazioni su come aggiungere un server MCP, vedere la documentazione del client di intelligenza artificiale.
ja: Aspire MCP の構成に関する重要な詳細は以下のとおりです。MCP サーバーの追加方法については、AI クライアントのドキュメントを参照してください。
pl: Poniżej znajdziesz ważne informacje dotyczące konfigurowania Aspire MCP. Szczegóły dotyczące dodawania serwera MCP znajdziesz w dokumentacji klienta AI.
pt_br: Os detalhes importantes para configurar o Aspire MCP estão abaixo. Consulte a documentação do cliente de IA para saber como adicionar um servidor MCP.
ru: Ниже приведены важные сведения о настройке Aspire MCP. Обратитесь к документации клиента ИИ для получения сведений о добавлении сервера MCP.
tr: Aspire MCP'yi yapılandırmak için önemli ayrıntılar aşağıdadır. MCP sunucusunu eklemek için lütfen yapay zeka istemcinizin belgelerine bakın.
zh_hans: 以下是配置 Aspire MCP 的重要详细信息。有关如何添加 MCP 服务器，请参阅 AI 客户端的文档。
zh_hant: 以下是設定 Aspire MCP 的重要詳細資料。若要了解如何新增 MCP 伺服器，請參閱 AI 用戶端的文件。

# McpServerDialogOtherOptionsVSCode
source: For other options, such as updating <code>mcp.json</code>, see <a href="{0}" target="_blank">Add an MCP server to VS Code</a>.
cs: Další možnosti, jako je aktualizace <code>mcp.json</code>, najdete v tématu <a href="{0}" target="_blank">Přidání serveru MCP do VS Code</a>.
de: Weitere Optionen wie das Aktualisieren von <code>mcp.json</code> finden Sie unter <a href="{0}" target="_blank">Hinzufügen eines MCP-Servers zu VS Code</a>.
fr: Pour d’autres options, telles que la mise à jour de <code>mcp.json</code>, consultez <a href="{0}" target="_blank">Ajouter un serveur MCP à VS Code</a>.
it: Per altre opzioni, ad esempio l'aggiornamento di <code>mcp.json</code>, vedere <a href="{0}" target="_blank">Aggiungere un server MCP a VS Code</a>.
ja: <code>mcp.json</code> の更新など、その他のオプションについては、「<a href="{0}" target="_blank">VS Code に MCP サーバーを追加する</a>」をご覧ください。
pl: Aby poznać inne opcje, takie jak aktualizacja <code>mcp.json</code>, zobacz <a href="{0}" target="_blank">Dodaj serwer MCP do VS Code</a>.
pt_br: Para outras opções, como atualizar <code>mcp.json</code>, veja <a href="{0}" target="_blank">Adicionar um servidor MCP ao VS Code</a>.
ru: Сведения о других вариантах, таких как обновление <code>mcp.json</code>, см. в разделе <a href="{0}" target="_blank">Добавление сервера MCP в VS Code</a>.
tr: <code>mcp.json</code> dosyasını güncelleştirme gibi diğer seçenekler için, <a href="{0}" target="_blank">VS Code'a MCP sunucusu ekleme</a> bölümüne bakın.
zh_hans: 有关其他选项，例如更新 <code>mcp.json</code>，请参阅<a href="{0}" target="_blank">向 VS Code 添加 MCP 服务器</a>。
zh_hant: 針對其他選項，例如更新 <code>mcp.json</code>，請參閱<a href="{0}" target="_blank">將 MCP 伺服器新增至 VS Code</a>。

# McpServerDialogOtherOptionsVisualStudio
source: For other options, such as updating <code>mcp.json</code>, see <a href="{0}" target="_blank">Add an MCP server to Visual Studio</a>.
cs: Další možnosti, například aktualizace <code>mcp.json</code>, najdete v tématu <a href="{0}" target="_blank">Přidání serveru MCP do Visual Studio</a>.
de: Weitere Optionen wie das Aktualisieren von <code>mcp.json</code> finden Sie unter <a href="{0}" target="_blank">Hinzufügen eines MCP-Servers zu Visual Studio</a>.
fr: Pour d’autres options, telles que la mise à jour de <code>mcp.json</code>, consultez <a href="{0}" target="_blank">Ajouter un serveur MCP à Visual Studio</a>.
it: Per altre opzioni, ad esempio l'aggiornamento di <code>mcp.json</code>, vedere <a href="{0}" target="_blank">Aggiungere un server MCP a Visual Studio</a>.
ja: <code>mcp.json</code> の更新など、その他のオプションについては、「<a href="{0}" target="_blank">Visual Studio に MCP サーバーを追加する</a>」をご覧ください。
pl: Aby uzyskać inne opcje, takie jak aktualizowanie <code>mcp.json</code>, zobacz <a href="{0}" target="_blank">Dodawanie serwera MCP do programu Visual Studio</a>.
pt_br: Para outras opções, como atualizar <code>mcp.json</code>, veja <a href="{0}" target="_blank">Adicionar um servidor MCP ao Visual Studio</a>.
ru: Сведения о других вариантах, таких как обновление <code>mcp.json</code>, см. в разделе <a href="{0}" target="_blank">Добавление сервера MCP в Visual Studio</a>.
tr: <code>mcp.json</code> dosyasını güncelleştirme gibi diğer seçenekler için, <a href="{0}" target="_blank">Visual Studio'ya MCP sunucusu ekleme</a> bölümüne bakın.
zh_hans: 有关其他选项，例如更新 <code>mcp.json</code>，请参阅<a href="{0}" target="_blank">向 Visual Studio 添加 MCP 服务器</a>。
zh_hant: 針對其他選項，例如更新 <code>mcp.json</code>，請參閱<a href="{0}" target="_blank">將 MCP 伺服器新增至 Visual Studio</a>。

# McpServerDialogOtherTab
source: Other
cs: Jiné
de: Sonstige
fr: Autre
it: Altro
ja: その他
pl: Inne
pt_br: Outro
ru: Другое
tr: Diğer
zh_hans: 其他
zh_hant: 其他

# McpServerDialogQuicklyAddVSCode
source: Quickly add Aspire MCP to VS Code using a browser install button:
cs: Rychle přidejte Aspire MCP do VS Code pomocí tlačítka pro instalaci v prohlížeči:
de: Fügen Sie Aspire MCP mithilfe einer Browserinstallationsschaltfläche schnell zu VS Code hinzu:
fr: Ajoutez rapidement Aspire MCP à VS Code à l’aide d’un bouton d’installation dans le navigateur :
it: Aggiungere rapidamente Aspire MCP a VS Code usando un pulsante di installazione del browser:
ja: ブラウザーのインストール ボタンを使用して、Aspire MCP を VS Code にすばやく追加します:
pl: Szybko dodaj Aspire MCP do VS Code za pomocą przycisku instalacji w przeglądarce:
pt_br: Adicione rapidamente o Aspire MCP ao VS Code usando um botão de instalação do navegador:
ru: Быстро добавьте Aspire MCP в VS Code с помощью кнопки установки в браузере:
tr: Tarayıcı yükleme düğmesini kullanarak Aspire MCP'yi VS Code'a hızlıca ekleyin:
zh_hans: 使用浏览器安装按钮快速将 Aspire MCP 添加到 VS Code:
zh_hant: 使用瀏覽器安裝按鈕，快速將 Aspire MCP 新增至 VS Code:

# McpServerDialogQuicklyAddVisualStudio
source: Quickly add Aspire MCP to Visual Studio using a browser install button:
cs: Rychle přidejte Aspire MCP do Visual Studio pomocí tlačítka pro instalaci v prohlížeči:
de: Fügen Sie mithilfe einer Browserinstallationsschaltfläche schnell Aspire MCP zu Visual Studio hinzu:
fr: Ajoutez rapidement Aspire MCP à Visual Studio à l’aide d’un bouton d’installation dans le navigateur :
it: Aggiungere rapidamente Aspire MCP a Visual Studio usando un pulsante di installazione del browser:
ja: ブラウザーのインストール ボタンを使用して、Aspire MCP を Visual Studio にすばやく追加します:
pl: Szybko dodaj Aspire MCP do programu Visual Studio za pomocą przycisku instalacji w przeglądarce:
pt_br: Adicione rapidamente o Aspire MCP ao Visual Studio usando um botão de instalação do navegador:
ru: Быстро добавьте Aspire MCP в Visual Studio с помощью кнопки установки в браузере:
tr: Tarayıcı yükleme düğmesini kullanarak Aspire MCP'yi Visual Studio'ya hızlıca ekleyin:
zh_hans: 使用浏览器安装按钮快速将 Aspire MCP 添加到 Visual Studio:
zh_hant: 使用瀏覽器安裝按鈕，快速將 Aspire MCP 新增至 Visual Studio:

# McpServerDialogVSCodeApiKeyInstructions
source: The first time Aspire MCP starts, you'll be prompted by VS Code for the API key. Enter the API key below in the VS Code input text box.
cs: Při prvním spuštění Aspire MCP vás VS Code vyzve k zadání klíče rozhraní API. Do vstupního textového pole ve VS Code zadejte níže klíč rozhraní API.
de: Wenn Aspire MCP zum ersten Mal gestartet wird, werden Sie von VS Code zur Eingabe des API-Schlüssels aufgefordert. Geben Sie unten den API-Schlüssel in das Eingabetextfeld von VS Code ein.
it: Al primo avvio di Aspire MCP, VS Code ti chiederà la chiave API. Immetti la chiave API qui sotto nella casella di immissione testo di VS Code.
ja: Aspire MCP の初回起動時に、VS Code から API キーの入力を求められます。VS Code 入力テキスト ボックスに以下の API キーを入力します。
pl: Przy pierwszym uruchomieniu serwera Aspire MCP w programie Vs Code zostanie wyświetlony monit z prośbą o podanie klucza interfejsu API. Wprowadź poniżej klucz interfejsu API w polu tekstowym danych wejściowych programu VS Code.
pt_br: Na primeira vez que o Aspire MCP for iniciado, o VS Code vai pedir a chave de API. Insira a chave de API abaixo na caixa VS Code de texto de entrada.
ru: При первом запуске Aspire MCP в VS Code будет запрошен ключ API. Введите указанный ниже ключ API в текстовое поле ввода VS Code.
tr: Aspire MCP ilk kez başlatıldığında, VS Code sizden API anahtarını girmenizi ister. Aşağıdaki API anahtarını VS Code metin girişi kutusuna girin.
zh_hans: 首次启动 Aspire MCP 时，VS Code 会提示你输入 API 密钥。在下面的 VS Code 输入文本框中输入 API 密钥。
zh_hant: Aspire MCP 第一次啟動時，VS Code 會提示您輸入 API 金鑰。請在下方 VS Code 的輸入文字方塊中輸入 API 金鑰。

# McpServerDialogVSCodeWarningInstructions
source: To use VS Code with Aspire MCP, configure the MCP endpoint to use HTTP instead of HTTPS. Note that this will remove transport security from Aspire MCP communication and could allow data to be read by a third party.
cs: Pokud chcete používat VS Code s Aspire MCP, nakonfigurujte koncový bod MCP tak, aby používal HTTP místo HTTPS. Všimněte si, že se tím odebere zabezpečení přenosu z komunikace Aspire MCP a může umožnit čtení dat třetí stranou.
de: Konfigurieren Sie den MCP-Endpunkt für die Verwendung von HTTP anstelle von HTTPS, um VS Code mit Aspire MCP zu verwenden. Beachten Sie, dass dadurch die Transportsicherheit aus der Aspire MCP-Kommunikation entfernt wird und das Lesen von Daten durch einen Drittanbieter ermöglicht werden kann.
fr: Pour utiliser VS Code avec Aspire MCP, configurez le point de terminaison MCP pour qu’il utilise HTTP au lieu de HTTPS. Notez que cela supprimera la sécurité de transport des communications Aspire MCP et pourrait permettre à un tiers de lire les données.
it: Per usare VS Code con Aspire MCP, configurare l'endpoint MCP per l'uso di HTTP anziché HTTPS. Si noti che la sicurezza del trasporto verrà rimossa dalle comunicazioni di Aspire MCP e potrebbe consentire la lettura dei dati da parte di terze parti.
ja: Aspire MCP でVS Codeを使用するには、HTTPS ではなく HTTP を使用するように MCP エンドポイントを構成します。これにより、Aspire MCP 通信からトランスポート セキュリティが削除され、第三者にデータを読み取られる可能性があることに注意してください。
pl: Aby używać VS Code z Aspire MCP, skonfiguruj punkt końcowy MCP tak, aby korzystał z protokołu HTTP zamiast HTTPS. Pamiętaj, że spowoduje to usunięcie zabezpieczeń transportu w komunikacji Aspire MCP i może pozwolić osobom trzecim na odczytanie danych.
pt_br: Para usar o VS Code com o Aspire MCP, configure o ponto de extremidade do MCP para usar HTTP em vez de HTTPS. Lembre-se de que isso remove a segurança de transporte na comunicação do Aspire MCP e pode permitir que os dados sejam lidos por terceiros.
ru: Чтобы использовать VS Code с Aspire MCP, настройте конечную точку MCP на использование HTTP вместо HTTPS. Обратите внимание, что это удалит защиту транспорта в коммуникации Aspire MCP и может позволить третьим лицам читать данные.
tr: VS Code'u Aspire MCP ile kullanmak için MCP uç noktasını HTTPS yerine HTTP kullanacak şekilde yapılandırın. Bu işlem, Aspire MCP iletişiminden taşıma güvenliğini kaldıracak ve verilerin üçüncü taraflarca okunmasına olanak sağlayabilecektir.
zh_hans: 若要将 VS Code 与 Aspire MCP 一起使用，请将 MCP 终结点配置为使用 HTTP 而非 HTTPS。请注意，这会取消 Aspire MCP 通信的传输安全性，并可能导致数据被第三方读取。
zh_hant: 若要使用 VS Code 搭配 Aspire MCP，請將 MCP 端點設定為使用 HTTP，而不是 HTTPS。請注意，這將會從 Aspire MCP 通訊移除傳輸安全性，並允許第三方讀取資料。

# McpServerDialogVSCodeWarningMessage
source: As of October 2025, VS Code does not support using Aspire MCP over HTTPS.
cs: Od října 2025 VS Code nepodporuje použití Aspire MCP přes HTTPS.
de: Ab Oktober 2025 unterstützt VS Code die Verwendung von Aspire MCP über HTTPS nicht.
fr: Depuis octobre 2025, VS Code ne prend pas en charge l’utilisation d’Aspire MCP via HTTPS.
it: A partire da ottobre 2025, VS Code non supporta l'uso di Aspire MCP su HTTPS.
ja: 2025 年 10 月現在、VS Code では HTTPS 経由の Aspire MCP の使用はサポートされていません。
pl: Od października 2025 r. VS Code nie obsługuje korzystania z Aspire MCP przez HTTPS.
pt_br: A partir de outubro de 2025, o VS Code não dará suporte ao uso do Aspire MCP via HTTPS.
ru: По состоянию на октябрь 2025 года VS Code не поддерживает использование Aspire MCP через HTTPS.
tr: Ekim 2025 itibarıyla VS Code, HTTPS üzerinden Aspire MCP kullanımını desteklememektedir.
zh_hans: 自 2025 年 10 月起，VS Code 不支持通过 HTTPS 使用 Aspire MCP。
zh_hant: 截至 2025 年 10 月，VS Code 不支援透過 HTTPS 使用 Aspire MCP。

# McpServerDialogVSCodeWarningMoreInfo
source: More information
cs: Další informace
de: Weitere Informationen
fr: Autres informations
it: Altre informazioni
ja: 詳細情報
pl: Więcej informacji
pt_br: Mais informações
ru: Подробнее
tr: Daha fazla bilgi
zh_hans: 详细信息
zh_hant: 詳細資訊

# McpServerDialogVSCodeWarningTitle
source: VS Code limitation
cs: Omezení VS Code
de: VS Code Einschränkung
fr: Limitation de VS Code
it: Limitazione di VS Code
ja: VS Code の制限
pl: Ograniczenie programu VS Code
pt_br: Limitação do VS Code
ru: Ограничения VS Code
tr: VS Code sınırlaması
zh_hans: VS Code 限制
zh_hant: VS Code 限制

# McpServerDialogVisualStudioApiKeyInstructions
source: You need to add the API key to Aspire MCP before you can use it. In GitHub Copilot Chat, select the Tools button, then the Aspire MCP server. Enter the API key below in the text box.
cs: Abyste mohli používat Aspire MCP, musíte do něj přidat klíč rozhraní API. V GitHub Copilot Chatu vyberte tlačítko Nástroje a pak server Aspire MCP. Do textového pole níže zadejte klíč rozhraní API.
de: Sie müssen den API-Schlüssel zu Aspire MCP hinzufügen, bevor Sie ihn verwenden können. Wählen Sie im GitHub Copilot-Chat die Schaltfläche „Tools“ und dann den Aspire MCP-Server aus. Geben Sie unten den API-Schlüssel in das Textfeld ein.
it: Devi aggiungere la chiave API ad Aspire MCP prima di poterla usare. In GitHub Copilot Chat, seleziona il pulsante Strumenti, quindi il server Aspire MCP. Inserisci la chiave API qui sotto nella casella di testo.
ja: Aspire MCP を使用するには、API キーを Aspire MCP に追加する必要があります。GitHub Copilot Chat で、[ツール] ボタン、Aspire MCP サーバーの順に選択します。テキスト ボックスに以下の API キーを入力します。
pl: Przed użyciem klucza interfejsu API musisz dodać go do serwera MCP. W środowisku GitHub Copilot Chat wybierz przycisk Narzędzia, a następnie serwer Aspire MCP. Wprowadź klucz interfejsu API poniżej w polu tekstowym.
pt_br: Você precisa adicionar a chave de API ao MCP antes de poder usá-la. No GitHub Copilot Chat, selecione o botão Ferramentas e depois o servidor Aspire MCP. Insira a chave de API abaixo na caixa de texto.
ru: Необходимо добавить ключ API в Aspire MCP перед его использованием. В GitHub Copilot Chat нажмите кнопку "Инструменты" и выберите сервер Aspire MCP. Введите указанный ниже ключ API в текстовое поле.
tr: API anahtarını kullanabilmek için API anahtarını Aspire MCP’ye eklemeniz gerekir. GitHub Copilot Chat’te Araçlar düğmesini seçin, ardından Aspire MCP sunucusunu seçin. Aşağıdaki API anahtarını metin kutusuna girin.
zh_hans: 你需要先将 API 密钥添加到 Aspire MCP，然后才能使用它。在 GitHub Copilot 对话助手中，依次选择“工具”按钮和 Aspire MCP 服务器。在下面的文本框中输入 API 密钥。
zh_hant: 您需要先將 API 金鑰加入 Aspire MCP，才能使用它。在 GitHub Copilot Chat 中，請選取 [工具] 按鈕，然後選取 [Aspire MCP 伺服器]。請在下方文字方塊中輸入 API 金鑰。

source: Open in text visualizer
cs: Otevřít ve vizualizéru textu
de: In Textschnellansicht öffnen
fr: Ouvrir dans le visualiseur de texte
it: Apri nel visualizzatore di testo
ja: テキスト ビジュアライザーで開く
pl: Otwórz w wizualizatorze tekstu
pt_br: Abrir no visualizador de texto
ru: Открыть в визуализаторе текста
tr: Metin görselleştiricide aç
zh_hans: 在文本可视化工具中打开
zh_hant: 在文字視覺化工具中開啟

# OpenSpanDialogCancelButtonText
source: Cancel
cs: Zrušit
de: Abbrechen
fr: Annuler
it: Annulla
ja: キャンセル
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
zh_hans: 取消
zh_hant: 取消

# OpenSpanDialogMessage
source: Waiting for span {0} to load...
cs: Čeká se na načtení rozsahu {0}...
de: Es wird auf das Laden des Spans {0} gewartet ...
fr: En attente du chargement de l’étendue {0}...
it: In attesa del caricamento della durata {0}...
ja: スパン {0} の読み込みを待機しています...
pl: Trwa oczekiwanie na załadowanie zakresu {0}...
pt_br: Aguardando o carregamento do intervalo {0}...
ru: Ожидание загрузки диапазона {0}...
tr: Span {0} yükleniyor...
zh_hans: 正在等待加载跨度 {0}...
zh_hant: 正在等候跨度 {0} 載入...

# SettingsDialogDarkTheme
source: Dark
cs: Tmavý
de: Dunkel
fr: Sombre
it: Scuro
ja: ダーク
pl: Ciemny
pt_br: Escuro
ru: Темная
tr: Koyu
zh_hans: 深色
zh_hant: 深色
