Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Dialogs.*.xlf
Languages: cs, de, fr, it, ja, pl, pt_br, ru, tr, zh_hans, zh_hant

# SettingsDialogDashboardLogsAndTelemetry
source: Resource logs and telemetry
cs: Protokoly prostředků a telemetrie
de: Ressourcenprotokolle und Telemetrie
fr: Journaux d’activité de ressources et télémétrie
it: Log delle risorse e telemetria
ja: リソース ログとテレメトリ
pl: Dzienniki zasobów i dane telemetryczne
pt_br: Logs e telemetria do recurso
ru: Журналы ресурсов и телеметрия
tr: Kaynak günlükleri ve telemetri
zh_hans: 资源日志和遥测
zh_hant: 資源記錄與遙測

# SettingsDialogDotNetRuntimeVersion
source: Runtime: {0}
cs: Modul runtime: {0}
de: Laufzeit: {0}
ja: ランタイム: {0}
pl: Środowisko uruchomieniowe: {0}
pt_br: Tempo de execução: {0}
ru: Среда выполнения: {0}
tr: Çalışma Zamanı: {0}
zh_hans: 运行时: {0}
zh_hant: 執行階段: {0}

# SettingsDialogLanguage
source: Language
cs: Jazyk
de: Sprache
fr: Langue
it: Lingua
ja: 言語
pl: Język
pt_br: Idioma
ru: Язык
tr: Dil
zh_hans: 语言
zh_hant: 語言

# SettingsDialogLanguagePageReloads
source: The page will reload on language change.
cs: Stránka se znovu načte při změně jazyka.
de: Die Seite wird bei einer Sprachänderung neu geladen.
fr: La page se rechargera en cas de changement de langue.
it: La pagina verrà ricaricata in base alla modifica della lingua.
ja: 言語の変更時にページが再読み込みされます。
pl: Strona zostanie ponownie załadowana po zmianie języka.
pt_br: A página será recarregado com a alteração de idioma.
ru: Страница будет перезагружена при изменении языка.
tr: Dil değişikliğinde sayfa yeniden yüklenemedi.
zh_hans: 页面将在语言更改时重新加载。
zh_hant: 頁面將在語言變更時重載。

# SettingsDialogLightTheme
source: Light
cs: Světlý
de: Hell
fr: Clair
it: Chiaro
ja: ライト
pl: Jasny
pt_br: Claro
ru: Светлая
tr: Açık
zh_hans: 浅色
zh_hant: 淺色

# SettingsDialogSystemTheme
source: System
cs: Systém
fr: Système
it: Sistema
ja: システム
pt_br: Sistema
ru: Система
tr: Sistem
zh_hans: 系统
zh_hant: 系統

# SettingsDialogTelemetryEnabledInfo
source: Dashboard telemetry is enabled. Aspire will collect usage data and send it to Microsoft.
cs: Telemetrie řídicího panelu je povolená. Aspire bude shromažďovat údaje o využití a odesílat je společnosti Microsoft.
de: Dashboardtelemetrie ist aktiviert. Aspire sammelt Nutzungsdaten und sendet sie an Microsoft.
fr: La télémétrie du tableau de bord est activée. Aspire collectera les données d’utilisation et les enverra à Microsoft.
it: La telemetria del dashboard è abilitata. Aspire raccoglierà i dati di utilizzo e li invierà a Microsoft.
ja: ダッシュボード テレメトリが有効になっています。Aspire は使用データを収集し、Microsoft に送信します。
pl: Telemetria pulpitu nawigacyjnego jest włączona. Firma Aspire będzie zbierać dane dotyczące użycia i wysyłać je do firmy Microsoft.
pt_br: A telemetria do painel está habilitada. O Aspire recolherá dados de uso e os enviará à Microsoft.
ru: Телеметрия панели мониторинга включена. Aspire будет собирать данные об использовании и отправлять их в Майкрософт.
tr: Pano telemetrisi etkin. Aspire, kullanım verilerini toplar ve bu verileri Microsoft’a gönderir.
zh_hans: 已启用仪表板遥测。Aspire 将收集使用情况数据并将其发送到 Microsoft。
zh_hant: 儀表板遙測已啟用。Aspire 將收集使用量資料並將其傳送至 Microsoft。

# SettingsDialogTelemetryInfoLinkText
source: Why?
cs: Proč?
de: Warum?
fr: Pourquoi ?
it: Perché?
ja: 理由
pl: Dlaczego?
pt_br: Por quê?
ru: Почему?
tr: Neden?
zh_hans: 为什么?
zh_hant: 為什麼?

# SettingsDialogTelemetryInfoLinkTooltip
source: Go to usage telemetry documentation
cs: Přejít na dokumentaci k telemetrii využití
de: Weitere Informationen zur Nutzungstelemetrie
fr: Accéder à la documentation sur la télémétrie d’utilisation
it: Vai alla documentazione sull'utilizzo della telemetria
ja: 使用状況テレメトリのドキュメントに移動する
pl: Przejdź do dokumentacji telemetrii użycia
pt_br: Ir para a documentação de telemetria de uso
ru: Перейти к документации по телеметрии использования
tr: Kullanım telemetri belgelerine erişin
zh_hans: 转到使用情况遥测文档
zh_hant: 移至使用量遙測文件

# SettingsDialogTheme
source: Theme
cs: Motiv
de: Design
fr: Thème
it: Tema
ja: テーマ
pl: Motyw
pt_br: Tema
ru: Тема
tr: Tema
zh_hans: 主题
zh_hant: 佈景主題

# SettingsDialogVersion
source: Version: {0}
cs: Verze: {0}
it: Versione: {0}
ja: バージョン: {0}
pl: Wersja: {0}
pt_br: Versão: {0}
ru: Версия: {0}
tr: Sürüm: {0}
zh_hans: 版本: {0}
zh_hant: 版本: {0}

# SettingsRemoveAllButtonText
source: Remove all
cs: Odebrat vše
de: Alle entfernen
fr: Supprimer tout
it: Rimuovi tutto
ja: すべて削除
pl: Usuń wszystko
pt_br: Remover tudo
ru: Удалить все
tr: Tümünü kaldır
zh_hans: 全部移除
zh_hant: 全部移除

# TextVisualizerDialogJsonFormat
source: Format JSON
cs: Formátovat JSON
de: JSON formatieren
it: Formato JSON
ja: JSON の書式設定
pl: Formatuj kod JSON
pt_br: Formatar JSON
ru: Формат JSON
tr: JSON dosyasını biçimlendir
zh_hans: 格式化 JSON
zh_hant: 格式化 JSON

# TextVisualizerDialogPlaintextFormat
source: Unformatted
cs: Neformátováno
de: Unformatiert
fr: Non formaté
it: Non formattato
ja: 書式設定なし
pl: Niesformatowano
pt_br: Não formatado
ru: Без форматирования
tr: Biçimlendirilmemiş
zh_hans: 未设置格式
zh_hant: 未格式化

# TextVisualizerDialogXmlFormat
source: Format XML
cs: Formátovat XML
de: XML formatieren
it: Formatta XML
ja: XML の書式設定
pl: Formatuj kod XML
pt_br: Formatar XML
ru: Формат XML
tr: XML dosyasını biçimlendir
zh_hans: 格式化 XML
zh_hant: 格式化 XML

# TextVisualizerSecretWarningAcknowledge
source: Show value
cs: Zobrazit hodnotu
de: Wert anzeigen
fr: Afficher une valeur
it: Mostra valore
ja: 値の表示
pl: Pokaż wartość
pt_br: Mostrar valor
ru: Показать значение
tr: Değeri göster
zh_hans: 显示值
zh_hant: 顯示值

# TextVisualizerSecretWarningDescription
source: Confirm you want to show the value. In the future, opening the text visualizer will automatically display all values
cs: Potvrďte, že chcete zobrazit hodnotu. V budoucnu se při otevření vizualizéru textu automaticky zobrazí všechny hodnoty.
de: Bestätigen Sie, dass Sie den Wert anzeigen möchten. In Zukunft wird beim Öffnen des Textvisualisierers automatisch der gesamte Wert angezeigt.
fr: Confirmez que vous souhaitez afficher la valeur. À l’avenir, l’ouverture du visualiseur de texte affichera automatiquement toutes les valeurs
it: Confermare di voler visualizzare il valore. In futuro, quando si apre il visualizzatore di testo, verranno mostrati automaticamente tutti i valori
ja: 値を表示してもよいかご確認ください。今後、テキスト ビジュアライザーを開くと、すべての値が自動的に表示されます
pl: Potwierdź, że chcesz wyświetlić wartość. W przyszłości otwarcie wizualizatora tekstu spowoduje automatyczne wyświetlenie wszystkich wartości
pt_br: Confirme se você deseja mostrar o valor. No futuro, a abertura do visualizador de texto exibirá automaticamente todos os valores
ru: Подтвердите, что хотите отобразить значение. В будущем при открытии визуализатора текста все значения будут отображаться автоматически
tr: Değeri göstermek istediğinizi onaylayın. Gelecekte, metin görselleştiricisinin açılması tüm değerleri otomatik olarak gösterilmesini sağlayacaktır
zh_hans: 确认要显示该值。将来，打开文本可视化工具将自动显示所有值
zh_hant: 確認您是否要顯示該值。未來，開啟文字視覺特效播放器時將自動顯示所有值

# TextVisualizerSecretWarningTitle
source: Sensitive value hidden
cs: Citlivá hodnota je skrytá
de: Vertraulicher Wert ausgeblendet
fr: Valeur sensible cachée
it: Valore sensibile nascosto
ja: 機密値が非表示です
pl: Ukryta wartość poufna
pt_br: Valor confidencial oculto
ru: Конфиденциальное значение скрыто
tr: Hassas değer gizlendi
zh_hans: 已隐藏敏感值
zh_hant: 隱藏敏感值

# TextVisualizerSelectFormatType
source: Select format
cs: Vybrat formát
de: Format auswählen
fr: Sélectionner un format
it: Selezionare formato
ja: 形式の選択
pl: Wybierz format
pt_br: Selecione o formato
ru: Выберите формат
tr: Biçimi seç
zh_hans: 选择格式
zh_hant: 選取格式
