Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Login.*.xlf
Languages: cs, es, fr, it, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

source: Authorized User
cs: Autorizovaný uživatel
fr: Utilisateur autorisé
it: Utente autorizzato
ko: 권한 있는 사용자
pt_br: Usuário autorizado
ru: Авторизованный пользователь
tr: Yetkili Kullanıcı
zh_hans: 授权用户
zh_hant: 授權使用者

# Header
source: {0} dashboard
cs: Řídicí panel aplikace {0}
es: Panel de {0}
fr: Tableau de bord {0}
it: Dashboard {0}
ja: {0} ダッシュボード
ko: {0} 대시보드
pt_br: Painel {0}
ru: Панель мониторинга {0}
tr: {0} panosu
zh_hans: {0} 仪表板
zh_hant: {0} 儀表板

# HelpScreenshotAltText
source: Screenshot of example console output showing where to find the dashboard frontend token. A red box highlights the token at the end of a url. The token is the value of a query parameter named 't'.
cs: Snímek obrazovky s příkladem výstupu konzoly, který ukazuje, kde najdete token frontendu řídicího panelu Červený rámeček zvýrazňuje token na konci adresy URL. Token je hodnota parametru dotazu s názvem „t“.
es: Captura de pantalla de ejemplo de salida de la consola que muestra dónde encontrar el token de front-end del panel. Un cuadro rojo resalta el token al final de una dirección URL. El token es el valor de un parámetro de consulta denominado "t".
fr: Capture d’écran de l’exemple de sortie de console montrant où trouver le jeton frontend du tableau de bord. Une zone rouge met en surbrillance le jeton à la fin d’une URL. Le jeton est la valeur d’un paramètre de requête nommé « t ».
it: Screenshot dell'output della console di esempio che mostra dove trovare il token front-end della dashboard. Una casella rossa evidenzia il token alla fine di un URL. Il token è il valore di un parametro di query denominato 't'.
ja: ダッシュボードのフロントエンド トークンを検索する場所を示すコンソール出力の例のスクリーンショット。赤いボックスが URL の末尾にあるトークンを強調表示しています。このトークンは、't' という名前のクエリ パラメーターの値です。
ko: 대시보드 프런트 엔드 토큰을 찾을 위치를 표시하는 예제 콘솔 출력의 스크린샷. 빨간 상자가 URL 끝에 있는 토큰을 강조 표시합니다. 토큰은 't'라는 이름의 쿼리 매개 변수의 값입니다.
pt_br: Captura de tela da saída do console de exemplo mostrando onde encontrar o token de front-end do painel. Uma caixa vermelha destaca o token no final de uma URL. O token é o valor de um parâmetro de consulta chamado 't'.
ru: Снимок экрана с примером выходных данных консоли с изображением того, где найти интерфейсный токен панели мониторинга. Красное поле выделяет токен в конце URL-адреса. Токен — это значение параметра запроса с именем "t".
tr: Pano ön uç belirtecinin nerede bulunacağını gösteren örnek konsol çıkışının ekran görüntüsü. URL’nin sonundaki belirteç bir kırmızı kutuyla vurgulanır. Belirteç, ‘t’ adlı sorgu parametresinin değeridir.
zh_hans: 示例控制台输出的屏幕截图，其中显示在哪里查找仪表板前端令牌一个红色框突出显示了 URL 末尾的令牌。令牌是名为 "t" 的查询参数的值。
zh_hant: 範例主控台輸出的螢幕擷取畫面，顯示儀表板前端權杖的位置。紅色方塊會醒目提示 URL 結尾的權杖。權杖是名為「t」的查詢參數值。

# InvalidTokenErrorMessage
source: Invalid token. Please try again
cs: Neplatný token. Zkuste to prosím znovu.
es: Token no válido. Vuelva a intentarlo
fr: Le jeton n’est pas valide. Veuillez réessayer
it: Token non valido. Riprova
ja: トークンが無効です。もう一度お試しください
ko: 토큰이 잘못되었습니다. 다시 시도하세요.
pt_br: Token inválido. Tente novamente
ru: Недействительный токен. Повторите попытку
tr: Geçersiz belirteç. Lütfen yeniden deneyin
zh_hans: 令牌无效。请重试
zh_hant: 無效的權杖。請再試一次

# LogInButtonText
source: Log in
cs: Přihlásit se
es: Iniciar sesión
fr: Connexion
it: Accedi
ja: ログイン
ko: 로그인
pt_br: Fazer logon
ru: Войти
tr: Oturum aç
zh_hans: 登录
zh_hant: 登入

source: Logged in as:
cs: Přihlášen(a) jako:
fr: Connecté en tant que :
it: Profilo utente:
ko: 다음으로 로그인:
pt_br: Conectado como:
ru: Выполнен вход от имени:
tr: Oturum açılan hesap:
zh_hans: 登录身份:
zh_hant: 登入身分:

# MoreInfoLinkText
source: More information
cs: Další informace
es: Más información
fr: Informations supplémentaires
it: Altre informazioni
ja: その他の情報
ko: 자세한 정보
pt_br: Mais informações
ru: Дополнительные сведения
tr: Daha fazla bilgi
zh_hans: 更多信息
zh_hant: 更多資訊

# PageTitle
source: {0} login
cs: Přihlášení k aplikaci {0}
es: Iniciar sesión en {0}
fr: Connexion {0}
it: Accesso a {0}
ja: {0} ログイン
ko: {0} 로그인
pt_br: Login {0}
ru: Вход {0}
tr: {0} uygulamasında oturum açma
zh_hans: {0} 登录名
zh_hant: {0} 登入

# TextFieldPlaceholder
source: Enter token to log in...
cs: Zadejte token pro přihlášení...
es: Escriba el token para iniciar sesión...
fr: Entrez un jeton pour vous connecter...
it: Immettere il token per l'accesso...
ja: ログインするトークンを入力してください...
ko: 로그인할 토큰 입력...
pt_br: Insira o token para fazer logon...
ru: Введите токен для входа...
tr: Oturum açmak için belirteci girin...
zh_hans: 输入要登录的令牌...
zh_hant: 輸入權杖以登入...

# TokenHelpTextLine1
source: Copy the highlighted token from the console to the login page and log in.
cs: Zkopírujte zvýrazněný token z konzoly na přihlašovací stránku a přihlaste se.
es: Copie el token resaltado de la consola en la página de inicio de sesión e inicie sesión.
fr: Copiez le jeton en surbrillance de la console dans la page de connexion et connectez-vous.
it: Copiare il token evidenziato dalla console alla pagina di accesso e accedere.
ja: 強調表示されたトークンをコンソールからログイン ページにコピーしてログインします。
ko: 콘솔에서 강조 표시된 토큰을 로그인 페이지로 복사하고 로그인합니다.
pt_br: Copie o token realçado do console para a página de logon e faça o logon.
ru: Скопируйте выделенный токен из консоли на страницу входа и войдите в систему.
tr: Konsoldaki vurgulanan belirteci oturum açma sayfasına kopyalayın ve oturum açın.
zh_hans: 将突出显示的令牌从控制台复制到登录页并登录。
zh_hant: 將醒目提示的權杖從主控台複製到登入頁面並登入。

# TokenHelpTextLine2
source: Alternatively, click on the console link to automatically log in. The address might not be correct when the dashboard is running in a container and the external port is mapped to a different value.
cs: Můžete se také přihlásit automaticky kliknutím na odkaz na konzolu. Adresa nemusí být správná, pokud řídicí panel běží v kontejneru a externí port je namapován na jinou hodnotu.
es: También puede hacer clic en el vínculo de la consola para iniciar sesión automáticamente. Es posible que la dirección no sea correcta cuando el panel se ejecuta en un contenedor y el puerto externo está asignado a un valor diferente.
fr: Vous pouvez également cliquer sur le lien de la console pour vous connecter automatiquement. L’adresse peut ne pas être correcte lorsque le tableau de bord s’exécute dans un conteneur et que le port externe est mappé à une valeur différente.
it: In alternativa, fare clic sul collegamento della console per accedere automaticamente. L'indirizzo potrebbe non essere corretto quando la dashboard è in esecuzione in un contenitore e viene eseguito il mapping della porta esterna a un valore diverso.
ja: または、コンソール リンクをクリックして自動的にログインします。ダッシュボードがコンテナーで実行されていて、外部ポートが別の値にマップされている場合、アドレスが正しくない可能性があります。
ko: 또는 콘솔 링크를 클릭하여 자동으로 로그인합니다. 대시보드가 컨테이너에서 실행되고 외부 포트가 다른 값에 매핑되는 경우 주소가 올바르지 않을 수 있습니다.
pt_br: Como alternativa, clique no link do console para fazer logon automaticamente. O endereço pode não estar correto quando o painel estiver sendo executado em um contêiner e a porta externa estiver mapeada para um valor diferente.
ru: В противном случае, нажмите на ссылку консоли, чтобы автоматически войти в систему. Адрес может быть неправильным, если панель мониторинга работает в контейнере, а внешний порт сопоставлен с другим значением.
tr: Alternatif olarak, otomatik olarak oturum açmak için konsol bağlantısına tıklayın. Pano bir kapsayıcıda çalıştırıldığında ve dış bağlantı noktası farklı bir değerle eşlendiğinde adres doğru olmayabilir.
zh_hans: 或者，单击控制台链接以自动登录。当仪表板在容器中运行，并且外部端口映射到其他值时，地址可能不正确。
zh_hant: 或者，按下主控台連結以自動登入。當儀錶板在容器中執行，而外部連接埠對應到不同的值時，位址可能不正確。

# TokenRequiredErrorMessage
source: Token is required
cs: Vyžaduje se token.
es: El token es obligatorio
fr: Le jeton est obligatoire
it: Token necessario.
ja: トークンが必要です
ko: 토큰이 필요합니다.
pt_br: O token é necessário
ru: Требуется токен
tr: Belirteç gerekiyor
zh_hans: 令牌是必需项
zh_hant: 需要權杖

# UnexpectedValidationError
source: Unexpected error when validating the token
cs: Neočekávaná chyba při ověřování tokenu
es: Error inesperado al validar el token
fr: Erreur inattendue lors de la validation du jeton
it: Errore imprevisto durante la convalida del token
ja: トークンの検証中に予期しないエラーが発生しました
ko: 토큰의 유효성을 검사하는 동안 예기치 않은 오류가 발생했습니다.
pt_br: Erro inesperado ao validar o token
ru: Непредвиденная ошибка при проверке токена
tr: Belirteç doğrulanırken beklenmeyen hata oluştu
zh_hans: 验证令牌时出现意外错误
zh_hant: 驗證權杖時發生未預期的錯誤

# WhereIsMyTokenLinkText
source: Where do I find the token?
cs: Kde najdu token?
es: ¿Dónde puedo encontrar el token?
fr: Où trouver le jeton ?
it: Dove si trova il token?
ja: トークンはどこにありますか?
ko: 토큰은 어디에서 찾을 수 있나요?
pt_br: Onde posso encontrar o token?
ru: Где найти токен?
tr: Belirteci nerede bulabilirim?
zh_hans: 在哪里可以找到令牌?
zh_hant: 我可以在哪裡可以找到權杖？
