Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Resources.*.xlf
Languages: cs, es, fr, ja, pl, ru, tr

# ResourceActionConsoleLogsText
source: Console logs
cs: Protokoly konzoly
es: Registros de consola
fr: Journaux de console
ja: コンソール ログ
pl: Dzienniki konsoli
ru: Журналы консоли
tr: Konsol günlükleri

# ResourceActionMetricsText
source: Metrics
cs: Metriky
es: Métricas
fr: Métriques
ja: メトリック
pl: Metryki
ru: Метрики
tr: Ölçümler

# ResourceActionStructuredLogsText
source: Structured logs
cs: Strukturované protokoly
es: Registros estructurados
fr: Journaux structurés
ja: 構造化ログ
pl: Dzienniki strukturalne
ru: Структурированные журналы
tr: Yapılandırılmış günlükler

# ResourceActionTelemetryTooltip
source: No telemetry found for this resource.
es: No se encontró ninguna telemetría para este recurso.
fr: Aucune télémétrie n’a été trouvée pour cette ressource.
ja: このリソースのテレメトリが見つかりません。

# ResourceActionTracesText
source: Traces
cs: Trasování
es: Seguimientos
ja: トレース
pl: Ślady
ru: Трассировки
tr: İzlemeler

# ResourceCollapseAllChildren
source: Collapse child resources
cs: Sbalit podřízené prostředky
es: Contraer recursos secundarios
fr: Réduire les ressources enfants
ja: 子リソースを折りたたむ
pl: Zwiń zasoby podrzędne
ru: Свернуть дочерние ресурсы
tr: Alt kaynakları daralt

# ResourceCommandFailed
source: {0} "{1}" failed
cs: Selhalo: {0} ({1})
es: {0} "{1}" erróneo
fr: {0} « {1} » a échoué
ja: {0} "{1}" が失敗しました
pl: Niepowodzenie {0} „{1}”
ru: Сбой {0} "{1}"
tr: {0} "{1}" başarısız

# ResourceCommandStarting
source: {0} "{1}" starting
cs: Spouští se {0} ({1})
es: {0} "{1}" iniciando
fr: Démarrage de {0} « {1} »
ja: {0} "{1}" を開始しています
pl: Uruchamianie {0} „{1}”
ru: Запуск {0} "{1}"
tr: {0} "{1}" başlatılıyor

# ResourceCommandSuccess
source: {0} "{1}" succeeded
cs: Úspěšné: {0} ({1})
es: {0} "{1}" correcto
fr: {0} « {1} » a réussi
ja: {0} "{1}" が成功しました
pl: Powodzenie {0} „{1}”
ru: {0} "{1}" успешно выполнено
tr: {0} "{1}" başarılı

# ResourceCommandToastViewLogs
source: View console logs
cs: Zobrazit protokoly konzoly
es: Ver registros de consola
fr: Afficher les journaux de console
ja: コンソール ログの表示
pl: Wyświetl dzienniki konsoli
ru: Просмотр журналов консоли
tr: Konsol günlüklerini görüntüle

# ResourceDetailsEndpointUrl
source: Endpoint URL
es: Dirección URL del punto de conexión
fr: URL de point de terminaison
ja: エンドポイント URL

# ResourceDetailsProxyUrl
source: Proxy URL
es: URL del proxy
fr: URL du proxy
ja: プロキシ URL

# ResourceDetailsViewConsoleLogs
source: View console logs
cs: Zobrazit protokoly konzoly
es: Ver registros de consola
fr: Afficher les journaux de console
ja: コンソール ログの表示
pl: Wyświetl dzienniki konsoli
ru: Просмотр журналов консоли
tr: Konsol günlüklerini görüntüle

# ResourceExpandAllChildren
source: Expand child resources
cs: Rozbalit podřízené prostředky
es: Expandir recursos secundarios
fr: Développer les ressources enfants
ja: 子リソースの展開
pl: Rozwiń zasoby podrzędne
ru: Развернуть дочерние ресурсы
tr: Alt kaynakları genişlet

# ResourceFilterOptionEmpty
source: (Unset)
cs: (nenastaveno)
es: (Anular)
fr: (Annuler)
ja: (設定解除)
pl: (Cofnij ustawienie)
ru: (Удалить)
tr: (Ayarı Kaldır)

# ResourcesActionsColumnHeader
source: Actions
cs: Akce
es: Acciones
ja: アクション
pl: Akcje
ru: Действия
tr: Eylemler

# ResourcesChangeViewOptions
source: View options
cs: Zobrazit možnosti
es: Ver opciones
fr: Afficher les options
ja: 表示オプション
pl: Wyświetl opcje
ru: Просмотреть параметры
tr: Seçenekleri görüntüle

# ResourcesDetailsContainerArgumentsProperty
source: Container arguments
cs: Argumenty kontejneru
es: Argumentos de contenedor
fr: Arguments de conteneur
ja: コンテナー引数
pl: Argumenty kontenera
ru: Аргументы контейнера
tr: Kapsayıcı bağımsız değişkenleri

# ResourcesDetailsContainerCommandProperty
source: Container command
cs: Příkaz kontejneru
es: Comando de contenedor
fr: Commande de conteneur
ja: コンテナー コマンド
pl: Polecenie kontenera
ru: Команда контейнера
tr: Kapsayıcı komutu

# ResourcesDetailsContainerIdProperty
source: Container ID
cs: ID kontejneru
es: Id. de contenedor
fr: ID de conteneur
ja: コンテナー ID
pl: Identyfikator kontenera
ru: ИД контейнера
tr: Kapsayıcı Kimliği

# ResourcesDetailsContainerImageProperty
source: Container image
cs: Image kontejneru
es: Imagen de contenedor
fr: Image conteneur
ja: コンテナー イメージ
pl: Obraz kontenera
ru: Образ контейнера
tr: Kapsayıcı görüntüsü

# ResourcesDetailsContainerLifetimeProperty
source: Container lifetime
cs: Životnost kontejneru
es: Duración del contenedor
fr: Durée de vie du conteneur
ja: コンテナーの有効期間
pl: Okres istnienia kontenera
ru: Время существования контейнера
tr: Kapsayıcı ömrü

# ResourcesDetailsContainerPortsProperty
source: Container ports
cs: Porty kontejneru
es: Puertos de contenedor
fr: Ports de conteneur
ja: コンテナー ポート
pl: Porty kontenerów
ru: Порты контейнера
tr: Kapsayıcı bağlantı noktaları

# ResourcesDetailsDisplayNameProperty
source: Display name
cs: Zobrazovaný název
es: Nombre para mostrar
fr: Nom d’affichage
ja: 表示名
pl: Nazwa wyświetlana
ru: Видимое имя
tr: Görünen ad

# ResourcesDetailsExecutableArgumentsProperty
source: Executable arguments
cs: Argumenty spustitelného souboru
es: Argumentos ejecutables
fr: Arguments exécutables
ja: 実行可能な引数
pl: Argumenty pliku wykonywalnego
ru: Аргументы исполняемого файла
tr: Yürütülebilir bağımsız değişkenler

# ResourcesDetailsExecutablePathProperty
source: Executable path
cs: Cesta ke spustitelnému souboru
es: Ruta de acceso ejecutable
fr: Chemin d’accès de l’exécutable
ja: 実行可能ファイルのパス
pl: Ścieżka pliku wykonywalnego
ru: Путь исполняемого файла
tr: Yürütülebilir yol

# ResourcesDetailsExecutableProcessIdProperty
source: Process ID
cs: ID procesu
es: Id. del proceso
fr: ID de processus
ja: プロセス ID
pl: Identyfikator procesu
ru: Идентификатор процесса
tr: İşlem Kimliği

# ResourcesDetailsExecutableWorkingDirectoryProperty
source: Working directory
cs: Pracovní adresář
es: Directorio de trabajo
fr: Répertoire de travail
ja: 作業ディレクトリ
pl: Katalog roboczy
ru: Рабочий каталог
tr: Çalışma dizini

# ResourcesDetailsExitCodeProperty
source: Exit code
cs: Ukončovací kód
es: Código de salida
fr: Code de sortie
ja: 終了コード
pl: Kod zakończenia
ru: Код завершения
tr: Çıkış kodu

# ResourcesDetailsHealthStateProperty
source: Health state
cs: Stav
es: Estado de mantenimiento
fr: État d’intégrité
ja: 正常性状態
pl: Stan kondycji
ru: Состояние работоспособности
tr: İşlevsel durum

# ResourcesDetailsProjectPathProperty
source: Project path
cs: Cesta k projektu
es: Ruta de acceso del proyecto
fr: Chemin de projet
ja: プロジェクト パス
pl: Ścieżka projektu
ru: Путь к проекту
tr: Proje yolu

# ResourcesDetailsStartTimeProperty
source: Start time
cs: Čas zahájení
es: Hora de inicio
fr: Heure de début
ja: 開始時刻
pl: Godzina rozpoczęcia
ru: Время начала
tr: Başlangıç zamanı

# ResourcesDetailsStateProperty
source: State
cs: Stav
es: Estado
fr: État
ja: 状態
pl: Stan
ru: Состояние
tr: Durum

# ResourcesDetailsStopTimeProperty
source: Stop time
cs: Čas zastavení
es: Hora de detención
fr: Heure d’arrêt
ja: 停止時刻
pl: Czas zatrzymania
ru: Время остановки
tr: Durdurma zamanı

# ResourcesEnvironmentColumnHeader
source: Environment
es: Entorno
fr: Environnement
ja: 環境

# ResourcesFiltered
source: Has filters
cs: Obsahuje filtry
es: Tiene filtros
fr: A des filtres
ja: フィルターあり
pl: Ma filtry
ru: Содержит фильтры
tr: Filtreleri var

# ResourcesGraphResetButton
source: Reset
cs: Resetovat
es: Restablecer
fr: Réinitialiser
ja: リセット
pl: Resetuj
ru: Сбросить
tr: Sıfırla

# ResourcesGraphZoomInButton
source: Zoom in
cs: Přiblížit
es: Acercar
fr: Zoom avant
ja: 拡大
pl: Powiększ
ru: Увеличить
tr: Yakınlaştır

# ResourcesGraphZoomOutButton
source: Zoom out
cs: Oddálit
es: Alejar
fr: Zoom arrière
ja: 縮小
pl: Pomniejsz
ru: Уменьшить
tr: Uzaklaştır

# ResourcesHideTypes
source: Hide resource types
cs: Skrýt typy prostředků
es: Ocultar tipos de recursos
fr: Masquer les types de ressources
ja: リソースの種類を非表示にする
pl: Ukryj typy zasobów
ru: Скрыть типы ресурсов
tr: Kaynak türlerini gizle

# ResourcesNotFiltered
source: No filters
cs: Žádné filtry
es: No hay ningún filtro
fr: Aucun filtre
ja: フィルターなし
pl: Brak filtrów
ru: Нет фильтров
tr: Filtre mevcut değil

# ResourcesResourceStatesHeader
source: State
cs: Stav
es: Estado
fr: État
ja: 状態
pl: Stan
ru: Состояние
tr: Durum

# ResourcesShowTypes
source: Show resource types
cs: Zobrazit typy prostředků
es: Mostrar tipos de recursos
fr: Afficher les types de ressources
ja: リソースの種類を表示する
pl: Pokaż typy zasobów
ru: Показать типы ресурсов
tr: Kaynak türlerini göster

# ResourcesSourceColumnHeader
source: Source
cs: Zdroj
es: Origen
ja: ソース
pl: Źródło
ru: Источник
tr: Kaynak

# ResourcesStartTimeColumnHeader
source: Start time
cs: Čas zahájení
es: Hora de inicio
fr: Heure de début
ja: 開始時刻
pl: Godzina rozpoczęcia
ru: Время начала
tr: Başlangıç zamanı

# ResourcesStateColumnHeader
source: State
cs: Stav
es: Estado
fr: État
ja: 状態
pl: Stan
ru: Состояние
tr: Durum

# ResourcesEnvironmentVariablesHeader
source: Environment variables for {0}
es: Variables de entorno para {0}
fr: Variables d’environnement pour {0}
ja: {0} の環境変数

# ResourcesHeader
source: Resources
cs: Prostředky
es: Recursos
fr: Ressources
ja: リソース
pl: Zasoby
ru: Ресурсы
tr: Kaynaklar

# ResourcesNoEnvironmentVariables
source: No environment variables
es: No hay variables de entorno.
fr: Aucune variable d’environnement
ja: 環境変数はありません

# ResourcesNoResources
source: No resources found
cs: Nenašly se žádné prostředky.
es: No se encontraron recursos
fr: Aucune ressource trouvée
ja: リソースが見つかりません
pl: Nie znaleziono żadnych zasobów
ru: Ресурсы не найдены
tr: Kaynak bulunamadı

# ResourcesPageTitle
source: {0} resources
cs: Počet prostředků: {0}
es: {0} recursos
fr: Ressources {0}
ja: {0} のリソース
pl: Liczba zasobów: {0}
ru: Ресурсов: {0}
tr: {0} kaynak

# ResourcesResourceTypesHeader
source: Resource types
cs: Typy prostředků
es: Tipos de recursos
fr: Types de ressource
ja: リソースの種類
pl: Typy zasobów
ru: Типы ресурсов
tr: Kaynak türleri

# ResourcesTypeColumnHeader
source: Type
cs: Typ
es: Tipo
ja: 種類
pl: Typ
ru: Тип
tr: Tür

# ResourcesUrlsColumnHeader
source: URLs
cs: Adresy URL
es: Direcciones URL
fr: URL
ja: URL
pl: Adresy URL
ru: URL-адреса
tr: URL’ler

# WaitingForHealthDataMessage
source: Waiting for health data...
cs: Čeká se na data o stavu...
es: Esperando datos de estado...
fr: En attente des données d’intégrité... Merci de patienter.
ja: 正常性データを待機しています...
pl: Trwa oczekiwanie na dane kondycji...
ru: Ожидание данных о работоспособности...
tr: Sistem durumu verileri bekleniyor...

# WaitingHealthDataStatusMessage
source: Waiting...
cs: Čekání…
es: Esperando...
fr: En attente...
ja: 待機中...
pl: Trwa oczekiwanie...
ru: Ожидание...
tr: Bekleniyor...

# ResourcesDetailsConnectionStringProperty
source: Connection string
pl: Parametry połączenia

# ResourcesDetailsParameterValueProperty
source: Value
pl: Wartość
