Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/StructuredLogs.*.xlf
Languages: fr, pl, zh_hans

# ActionLogMessageText
source: Log message
fr: Message du journal
pl: Komunikat dziennika
zh_hans: 日志消息

# MessageExceededLimitBody
source: A maximum of {0} structured logs are stored. Old structured logs are automatically removed.
fr: Un maximum de {0} journaux structurés est stocké. Les anciens journaux structurés sont automatiquement supprimés.
pl: Maksymalna liczba przechowywanych dzienników strukturalnych to {0}. Stare dzienniki strukturalne są automatycznie usuwane.
zh_hans: 最多存储 {0} 个结构化日志。将自动删除旧的结构化日志。

# MessageExceededLimitTitle
source: Exceeded structured log limit
fr: Limite de journaux structurés dépassée
pl: Przekroczono limit dzienników strukturalnych
zh_hans: 已超出结构化日志限制

# PauseInProgressText
source: Structured logs capture paused at {0}
fr: La capture des journaux structurés a été suspendue à {0}
pl: Przechwytywanie dzienników strukturalnych zostało wstrzymane w {0}
zh_hans: 结构化日志捕获已在 {0} 暂停

# StructuredLogsEntryDetails
source: Log entry details
fr: Détails de l’entrée de journal
pl: Szczegóły wpisu dziennika
zh_hans: 日志条目详细信息

# StructuredLogsHeader
source: Structured logs
fr: Journaux structurés
pl: Dzienniki strukturalne
zh_hans: 结构化日志

# StructuredLogsLevelColumnHeader
source: Level
fr: Niveau
pl: Poziom
zh_hans: 级别

# StructuredLogsLevels
source: Level
fr: Niveau
pl: Poziom
zh_hans: 级别

# StructuredLogsMessageColumnHeader
source: Message
pl: Komunikat
zh_hans: 消息

# StructuredLogsMessageFilter
source: Message filter
fr: Filtre de messages
pl: Filtr wiadomości
zh_hans: 消息筛选器

# StructuredLogsMinimumLogFilter
source: Minimum log level filter
fr: Filtre de niveau de journalisation minimal
pl: Filtr minimalnego poziomu dziennika
zh_hans: 最低日志级别筛选器

# StructuredLogsNoLogsFound
source: No structured logs found
fr: Journaux structurés introuvables
pl: Nie znaleziono dzienników strukturalnych
zh_hans: 找不到结构化日志

# StructuredLogsPageTitle
source: {0} structured logs
fr: Journaux structurés {0}
pl: {0} dzienników strukturalnych
zh_hans: {0} 结构化日志

# StructuredLogsResourceColumnHeader
source: Resource
fr: Ressource
pl: Zasób
zh_hans: 资源

# StructuredLogsSelectMinimumLogLevel
source: Select a minimum log level
fr: Sélectionner un niveau de journalisation minimal
pl: Wybierz minimalny poziom dziennika
zh_hans: 选择最低日志级别

# StructuredLogsTimestampColumnHeader
source: Timestamp
pl: Znacznik czasu
zh_hans: 时间戳

# StructuredLogsTraceColumnHeader
source: Trace
pl: Ślad
zh_hans: 跟踪
