Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Token.*.xlf
Languages: pl

# Header
source: {0} dashboard
pl: Pulpit nawigacyjny aplikacji {0}

# HelpPopupText
source: Look for the token in the console output:
pl: Poszukaj tokenu w danych wyjściowych konsoli:

# HelpScreenshotAltText
source: Screenshot of console output showing where to find the dashboard frontend token
pl: Zrzut ekranu danych wyjściowych konsoli pokazujący, gdzie znaleźć token frontonu pulpitu nawigacyjnego

# InvalidTokenErrorMessage
source: Invalid token. Please try again
pl: Nieprawidłowy token. Spróbuj ponownie

# LogInButtonText
source: Log in
pl: Zaloguj się

# MoreInfoLinkText
source: More info
pl: Więcej informacji

# PageTitle
source: {0} login
pl: Logowanie do aplikacji {0}

# TextFieldPlaceholder
source: Enter token to log in...
pl: Wprowadź token, aby się zalogować...

# TokenRequiredErrorMessage
source: Token is required
pl: Token jest wymagany

# UnexpectedValidationError
source: Unexpected error when validating the token
pl: Nieoczekiwany błąd podczas weryfikowania tokenu

# WhereIsMyTokenLinkText
source: Where do I find the token?
pl: Gdzie mogę znaleźć token?
