Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/TraceDetail.*.xlf
Languages: es, it, pl, ru, tr, zh_hant

# TraceDetailDepthHeader
source: Depth
es: Profundidad
it: Profondità
pl: Głębokość
ru: Глубина
tr: Derinlik
zh_hant: 深度

# TraceDetailDurationHeader
source: Duration
es: Duración
it: Durata
pl: Czas trwania
ru: Длительность
tr: Süre
zh_hant: 期間

# TraceDetailMobileToolbarButtonText
source: Trace details
es: Detalles de seguimiento
it: Dettagli traccia
pl: Szczegóły śledzenia
ru: Сведения трассировки
tr: İzleme ayrıntıları
zh_hant: 追蹤詳細資料

# TraceDetailNameHeader
source: Name
es: Nombre
it: Nome
pl: Nazwa
ru: Имя
tr: Ad
zh_hant: 名稱

# TraceDetailNoSpans
source: No spans found
es: No se encontraron intervalos
it: Nessuna durata trovata
pl: Nie znaleziono zakresów
ru: Диапазоны не найдены
tr: Aralık bulunamadı
zh_hant: 找不到任何範圍

# TraceDetailPageTitle
source: {0} trace
es: Seguimiento de {0}
it: Traccia {0}
pl: Ślad {0}
ru: Трассировка {0}
tr: {0} izleme
zh_hant: {0} 追蹤

# TraceDetailResourceHeader
source: Resource
es: Recurso
it: Risorsa
pl: Zasób
ru: Ресурс
tr: Kaynak
zh_hant: 資源

# TraceDetailResourcesHeader
source: Resources
es: Recursos
it: Risorse
pl: Zasoby
ru: Ресурсы
tr: Kaynaklar
zh_hant: 資源

# TraceDetailTotalSpansHeader
source: Total spans
es: Intervalos totales
it: Intervalli totali
pl: Łączna liczba zakresów
ru: Всего диапазонов
tr: Toplam yayılma sayısı
zh_hant: 總範圍

# TraceDetailTraceNotFound
source: Trace "{0}" not found
es: Seguimiento "{0}" no encontrado
it: Traccia "{0}" non trovata
pl: Nie znaleziono śladu „{0}”
ru: Трассировка "{0}" не найдена
tr: "{0}" izi bulunamadı
zh_hant: 找不到追蹤 "{0}"

# TraceDetailTraceStartHeader
source: Trace detail
es: Detalle del seguimiento
it: Dettagli traccia
pl: Szczegóły śledzenia
ru: Детали трассировки
tr: İzleme ayrıntıları
zh_hant: 追蹤詳細資料
