Repository: dotnet/aspire
Catalog: src/Aspire.Dashboard/Resources/xlf/Traces.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MessageExceededLimitBody
source: A maximum of {0} traces are stored. Old traces are automatically removed.
cs: Ukládá se maximálně tento počet trasování: {0}. Stará trasování se automaticky odeberou.
de: Es werden maximal {0} Ablaufverfolgungen gespeichert. Alte Ablaufverfolgungen werden automatisch entfernt.
es: Se almacena un máximo de {0} seguimientos. Los seguimientos antiguos se quitan automáticamente.
fr: Un maximum de {0} traces sont stockées. Les anciennes traces sont automatiquement supprimées.
it: Sono archiviate al massimo {0} tracce. Le tracce precedenti vengono rimosse automaticamente.
ko: 최대 {0} 추적이 저장됩니다. 이전 추적은 자동으로 제거됩니다.
pl: Maksymalnie przechowuje się następującą liczbę śladów: {0} Stare ślady są automatycznie usuwane.
pt_br: Um máximo de {0} rastreamentos são armazenados. Rastreamentos antigos são removidos automaticamente.
zh_hans: 最多存储 {0} 个跟踪。旧跟踪将被自动删除。
zh_hant: 最多會儲存 {0} 個追蹤。會自動移除舊的追蹤。

# MessageExceededLimitTitle
source: Exceeded trace limit
cs: Překročil se limit trasování
de: Ablaufverfolgungslimit überschritten
es: Se superó el límite de seguimiento
fr: Limite de trace dépassée
it: È stato superato il limite di tracce
ko: 추적 제한을 초과했습니다.
pl: Przekroczono limit śladów
pt_br: Limite de rastreamento excedido
zh_hans: 已超出跟踪限制
zh_hant: 超過追蹤限制

# PauseInProgressText
source: Traces capture paused at {0}
cs: Zachytávání trasování bylo pozastaveno v {0}.
de: Ablaufverfolgungserfassung angehalten um {0}
es: Captura de seguimientos pausada a las {0}
fr: Capture des traces suspendue à {0}
it: Acquisizione delle tracce messa in pausa alle {0}
ko: 추적 캡처가 {0}에 일시 중지됨
pl: Przechwytywanie śladów zostało wstrzymane w {0}
pt_br: Captura de rastreamentos em pausa às {0}
zh_hans: 跟踪捕获已在 {0} 暂停
zh_hant: 追蹤擷取已在 {0} 暫停

# SpanTypeLabel
source: Type
de: Typ

# SpanTypeSelectSpanType
source: Select span type
de: Bereichstyp auswählen

# TotalItemsFooterPluralText
source: Showing <strong>{0} traces</strong>
de: <strong>{0} Ablaufverfolgungen</strong> werden angezeigt

# TotalItemsFooterSingularText
source: Showing <strong>{0} trace</strong>
de: <strong>{0} Ablaufverfolgung</strong> wird angezeigt

# TracesHeader
source: Traces
cs: Trasování
de: Überwachungen
es: Seguimientos
it: Tracce
ko: 추적
pl: Ślady
pt_br: Rastreamentos
ru: Трассировки
tr: İzlemeler
zh_hans: 跟踪
zh_hant: 追蹤

# TracesNameFilter
source: Name filter
cs: Filtr názvů
de: Namensfilter
es: Filtro de nombres
fr: Nom du filtre
it: Nome del filtro
ko: 이름 필터
pl: Filtr nazw
pt_br: Filtro de nome
ru: Фильтр имен
tr: Ad filtresi
zh_hans: 名称筛选器
zh_hant: 名稱篩選

# TracesNoTraces
source: No traces found
cs: Nenašla se žádná trasování.
de: Keine Ablaufverfolgungen gefunden.
es: No se encontraron seguimientos
fr: Aucune trace trouvée
it: Nessuna traccia trovata
ko: 추적을 찾을 수 없음
pl: Nie znaleziono śladów
pt_br: Nenhum rastreamento encontrado
ru: Трассировки не найдены
tr: İzleme bulunamadı
zh_hans: 未找到任何跟踪
zh_hant: 找不到任何追蹤

# TracesPageTitle
source: {0} traces
cs: Trasování aplikace {0}
de: {0} Ablaufverfolgungen
es: Seguimientos de {0}
fr: Traces {0}
it: {0} tracce
ko: {0} 추적
pl: Ślady {0}
pt_br: {0} rastreamentos
ru: Трассировок: {0}
tr: {0} izlemeleri
zh_hans: {0} 跟踪
zh_hant: {0} 追蹤

# TracesResourceSpans
source: {0} spans
cs: Rozsahy prostředku {0}
de: {0} Bereiche
es: Intervalos de {0}
fr: Étendues {0}
it: {0} intervalli
ko: {0} 범위
pl: {0} zakresy
pt_br: {0} intervalos
ru: Диапазонов: {0}
tr: {0} yayılmaları
zh_hans: {0} 范围
zh_hant: {0} 範圍

# TracesSpansColumnHeader
source: Spans
cs: Rozsahy
de: Bereiche
es: Intervalos
fr: Étendues
it: Intervalli
ko: 범위
pl: Zakresy
pt_br: Intervalos
ru: Охватывает
tr: Yayılmalar
zh_hans: 范围
zh_hant: 範圍

# TracesTotalErroredTraces
source: Errored: {0}
cs: S chybami: {0}
de: Mit Fehler: {0}
es: Con errores: {0}
fr: En erreur : {0}
it: In errore: {0}
ko: 오류 발생: {0}
pl: Błąd: {0}
pt_br: Erro: {0}
ru: С ошибками: {0}
tr: Hata oluştu: {0}
zh_hans: 出错: {0} 个

# TracesTotalTraces
source: Total: {0}
cs: Celkem: {0}
de: Gesamt: {0}
it: Totale: {0}
ko: 합계: {0}
pl: Suma: {0}
ru: Итого: {0}
tr: Toplam: {0}
zh_hans: 总计: {0} 个
zh_hant: 總計: {0}

# TracesTraceId
source: Trace Id: {0}
cs: ID trasování: {0}
de: Ablaufverfolgungs-ID: {0}
es: Id. de seguimiento: {0}
fr: ID de trace : {0}
it: ID traccia: {0}
ko: 추적 ID: {0}
pl: Identyfikator śledzenia: {0}
pt_br: ID de rastreamento: {0}
ru: Идентификатор трассировки: {0}
tr: İzleme Kimliği: {0}
zh_hans: 跟踪 ID: {0}
zh_hant: 追蹤識別碼 {0}

# TracesFullName
source: Name: {0}
cs: Název: {0}
es: Nombre: {0}
fr: Nom : {0}
it: Nome: {0}
ko: 이름: {0}
pl: Nazwa: {0}
pt_br: Nome: {0}
ru: Имя: {0}
tr: Ad: {0}
zh_hans: 名称: {0}
zh_hant: 名稱: {0}
