Repository: dotnet/aspire
Catalog: src/Aspire.Hosting.Azure/Resources/xlf/AzureProvisioningStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InputsMessage
source: The model contains Azure resources that require an Azure Subscription. To learn more, see the [Azure provisioning docs](https://aka.ms/dotnet/aspire/azure/provisioning).
cs: Model obsahuje prostředky Azure, které vyžadují předplatné Azure. Zjistěte více v [dokumentaci k nasazení Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
de: Das Modell enthält Azure-Ressourcen, für die ein Azure-Abonnement erforderlich ist. Weitere Informationen finden Sie in der [Azure-Bereitstellungsdokumentation](https://aka.ms/dotnet/aspire/azure/provisioning).
es: El modelo contiene recursos de Azure que requieren una suscripción de Azure. Para más información, consulte la [documentación de aprovisionamiento de Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
fr: Le modèle contient des ressources Azure qui nécessitent un abonnement Azure. Pour en savoir plus, consultez la [documentation d’approvisionnement Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
it: Il modello contiene risorse di Azure che richiedono una sottoscrizione di Azure. Per altre informazioni, vedere la [documentazione sul provisioning di Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
ja: モデルには、Azure サブスクリプションを必要とする Azure リソースが含まれています。 詳細については、[Azure のプロビジョニング に関するドキュメント](https://aka.ms/dotnet/aspire/azure/provisioning) を参照してください。
ko: 모델에는 Azure 구독이 필요한 Azure 리소스가 포함되어 있습니다. 자세한 내용은 [Azure provisioning docs](https://aka.ms/dotnet/aspire/azure/provisioning)를 참조하세요.
pt_br: O modelo contém recursos do Azure que exigem uma Assinatura do Azure. Para saber mais, veja a [documentação de provisionamento do Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
ru: Модель содержит ресурсы Azure, для которых требуется подписка Azure. Подробнее см. в [документации по подготовке Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
tr: Modelde Azure aboneliği gerektiren Azure kaynakları bulunuyor. Daha fazla bilgi için [Azure sağlama belgelerine](https://aka.ms/dotnet/aspire/azure/provisioning) bakın.
zh_hans: 该模型包含需要 Azure 订阅的 Azure 资源。 要了解详细信息，请参阅 [Azure 预配文档](https://aka.ms/dotnet/aspire/azure/provisioning)。
zh_hant: 該模型包含需要 Azure 訂用帳戶的 Azure 資源。 若要深入了解，請參閱 [Azure 訂用帳戶文件](https://aka.ms/dotnet/aspire/azure/provisioning)。

# InputsTitle
source: Azure provisioning
cs: Zřizování Azure
de: Azure-Bereitstellung
es: Aprovisionamiento de Azure
fr: Approvisionnement Azure
it: Provisioning Azure
ja: Azure のプロビジョニング
ko: Azure 프로비전
pl: Aprowizowanie platformy Azure
pt_br: Provisionamento do Azure
ru: Подготовка Azure
tr: Azure sağlama
zh_hans: Azure 预配
zh_hant: Azure 佈建

# LocationDialogTitle
source: Azure location and resource group
cs: Umístění a skupina prostředků Azure
de: Azure-Standort und -Ressourcengruppe
es: Ubicación y grupo de recursos de Azure
fr: Emplacement et groupe de ressources Azure
it: Posizione e gruppo di risorse di Azure
ja: Azure の場所およびリソース グループ
ko: Azure 위치 및 리소스 그룹
pl: Lokalizacja i grupa zasobów platformy Azure
pt_br: Localização do Azure e grupo de recursos
ru: Расположение Azure и группа ресурсов
tr: Azure konumu ve kaynak grubu
zh_hans: Azure 位置和资源组
zh_hant: Azure 位置和資源群組

# LocationLabel
source: Location
cs: Umístění
de: Standort
es: Ubicación
fr: Emplacement
it: Posizione
ja: 場所
ko: 위치
pl: Lokalizacja
pt_br: Localização
ru: Расположение
tr: Konum
zh_hans: 位置
zh_hant: 位置

# LocationPlaceholder
source: Select location
cs: Vybrat umístění
de: Standort auswählen
es: Seleccionar ubicación
fr: Sélectionner un emplacement
it: Seleziona posizione
ja: 場所を選択
ko: 위치 선택
pl: Wybierz lokalizację
pt_br: Selecionar o local
ru: Выберите расположение
tr: Konum seçin
zh_hans: 选择位置
zh_hant: 選取位置

# LocationSelectionMessage
source: Select your Azure location and specify resource group:
cs: Vyberte umístění Azure a zadejte skupinu prostředků:
de: Wählen Sie Ihren Azure-Standort aus und geben Sie die Ressourcengruppe an:
es: Seleccione la ubicación de Azure y especifique el grupo de recursos:
fr: Sélectionnez votre emplacement Azure et spécifiez le groupe de ressources :
it: Selezionare la posizione di Azure e specificare il gruppo di risorse:
ja: Azure のリージョンを選択し、リソース グループを選択してください:
ko: Azure 위치를 선택하고 리소스 그룹을 지정합니다.
pl: Wybierz lokalizację platformy Azure i określ grupę zasobów:
pt_br: Selecione sua localização do Azure e especifique o grupo de recursos:
ru: Выберите свое расположение Azure и укажите группу ресурсов:
tr: Azure konumunuzu seçin ve kaynak grubunu belirtin:
zh_hans: 选择 Azure 位置并指定资源组:
zh_hant: 選取您的 Azure 位置並指定資源群組:

# NotificationMessage
source: The model contains Azure resources that require an Azure Subscription.
cs: Model obsahuje prostředky Azure, které vyžadují předplatné Azure.
de: Das Modell enthält Azure-Ressourcen, für die ein Azure-Abonnement erforderlich ist.
es: El modelo contiene recursos de Azure que requieren una suscripción de Azure.
fr: Le modèle contient des ressources Azure qui nécessitent un abonnement Azure.
it: Il modello contiene risorse di Azure che richiedono una sottoscrizione di Azure.
ja: モデルには、Azure サブスクリプションを必要とする Azure リソースが含まれています。
ko: 모델에는 Azure 구독이 필요한 Azure 리소스가 포함되어 있습니다.
pl: Model zawiera zasoby platformy Azure, które wymagają subskrypcji platformy Azure.
pt_br: O modelo contém recursos do Azure que exigem uma Assinatura do Azure.
ru: Модель содержит ресурсы Azure, для которых требуется подписка Azure.
tr: Modelde Azure aboneliği gerektiren Azure kaynakları bulunuyor.
zh_hans: 该模型包含需要 Azure 订阅的 Azure 资源。
zh_hant: 該模型包含需要 Azure 訂用帳戶的 Azure 資源。

# NotificationPrimaryButtonText
source: Enter values
cs: Zadat hodnoty
de: Werte eingeben
es: Especifique los valores
fr: Entrer des valeurs
it: Immetti i valori
ja: 値の入力
ko: 값 입력
pl: Wprowadź wartości
pt_br: Inserir valores
ru: Ввести значения
tr: Değer girin
zh_hans: 输入值
zh_hant: 輸入值

# NotificationTitle
source: Azure provisioning
cs: Zřizování Azure
de: Azure-Bereitstellung
es: Aprovisionamiento de Azure
fr: Approvisionnement Azure
it: Provisioning Azure
ja: Azure のプロビジョニング
ko: Azure 프로비전
pl: Aprowizowanie platformy Azure
pt_br: Provisionamento do Azure
ru: Подготовка Azure
tr: Azure sağlama
zh_hans: Azure 预配
zh_hant: Azure 佈建

# ResourceGroupDialogTitle
source: Azure resource group
cs: Skupina prostředků Azure
de: Azure-Ressourcengruppe
it: Gruppo di risorse di Azure
ja: Azure リソース グループ
ko: Azure 리소스 그룹
pl: Grupa zasobów platformy Azure
pt_br: grupo de recursos do Azure
ru: Группа ресурсов Azure
tr: Azure kaynak grubu

# ResourceGroupLabel
source: Resource group
cs: Skupina prostředků
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pl: Grupa zasobów
pt_br: Grupo de recursos
ru: Группа ресурсов
tr: Kaynak grubu
zh_hans: 资源组
zh_hant: 資源群組

# ResourceGroupPlaceholder
source: Select or enter resource group
cs: Vyberte nebo zadejte skupinu prostředků
de: Wählen Sie eine Ressourcengruppe aus, oder geben Sie eine Ressourcengruppe ein.
it: Selezionare o immettere un gruppo di risorse
ja: リソース グループを選択または入力します
ko: 리소스 그룹 선택 또는 입력
pl: Wybierz lub wprowadź grupę zasobów
pt_br: Selecionar ou inserir grupo de recursos
ru: Выберите или введите группу ресурсов
tr: Kaynak grubunu seçin veya girin

# ResourceGroupSelectionMessage
source: Select your Azure resource group or enter a new name:
cs: Vyberte skupinu prostředků Azure nebo zadejte nový název:
de: Wählen Sie Ihre Azure-Ressourcengruppe aus oder geben Sie einen neuen Namen ein:
it: Selezionare il gruppo di risorse di Azure o immettere un nuovo nome:
ja: Azure リソース グループを選択するか、新しい名前を入力してください:
ko: Azure 리소스 그룹을 선택하거나 새 이름을 입력합니다.
pl: Wybierz grupę zasobów platformy Azure lub wprowadź nową nazwę:
pt_br: Selecione o grupo de recursos do Azure ou insira um novo nome:
ru: Выберите группу ресурсов Azure или введите новое имя:
tr: Azure kaynak grubunuzu seçin veya yeni bir ad girin:

# SubscriptionDialogTitle
source: Azure subscription
cs: Předplatné Azure
de: Azure-Abonnement
es: Suscripción de Azure
fr: Abonnement Azure
it: Sottoscrizione di Azure
ja: Azure サブスクリプション
ko: Azure 구독
pl: Subskrypcja platformy Azure
pt_br: Assinatura do Azure
ru: Подписка Azure
tr: Azure aboneliği
zh_hans: Azure 订阅
zh_hant: Azure 訂用帳戶

# SubscriptionIdLabel
source: Subscription ID
cs: ID předplatného
de: Abonnement-ID
es: Id. de suscripción
fr: ID de l'abonnement
it: ID sottoscrizione
ja: サブスクリプション ID
ko: 구독 ID
pl: Identyfikator subskrypcji
pt_br: ID da Assinatura
ru: ИД подписки
tr: Abonelik Kimliği
zh_hans: 订阅 ID
zh_hant: 訂用帳戶識別碼

# SubscriptionIdPlaceholder
source: Select subscription ID
cs: Vybrat ID předplatného
de: Abonnement-ID auswählen
es: Seleccionar id. de suscripción
fr: Sélectionner l’ID d’abonnement
it: Selezionare l'ID sottoscrizione
ja: サブスクリプション ID を選択
ko: 구독 ID 선택
pl: Wybierz identyfikator subskrypcji
pt_br: Selecionar a ID da assinatura
ru: Выберите ИД подписки
tr: Abonelik kimliği seçin
zh_hans: 选择订阅 ID
zh_hant: 選取訂用帳戶識別碼

# SubscriptionManualEntryMessage
source: Enter your Azure subscription ID:
cs: Zadejte ID vašeho předplatného Azure:
de: Geben Sie die ID Ihres Azure-Abonnements ein:
es: Escriba su id. de suscripción de Azure:
fr: Entrez votre ID d’abonnement Azure :
it: Immettere l'ID sottoscrizione di Azure:
ja: Azure サブスクリプション ID を入力してください:
ko: Azure 구독 ID 입력:
pl: Wprowadź identyfikator subskrypcji platformy Azure:
pt_br: Insira sua ID de assinatura do Azure:
ru: Введите идентификатор подписки Azure:
tr: Azure abonelik kimliğinizi girin:
zh_hans: 输入 Azure 订阅 ID:
zh_hant: 輸入您的 Azure 訂用帳戶識別碼:

# SubscriptionSelectionMessage
source: Select your Azure subscription:
cs: Vyberte předplatné Azure:
de: Wählen Sie Ihr Azure-Abonnement aus:
es: Seleccione su suscripción de Azure:
fr: Sélectionnez votre abonnement Azure :
it: Selezionare la sottoscrizione di Azure:
ja: Azure サブスクリプションを選択してください:
ko: Azure 구독 선택:
pl: Wybierz subskrypcję platformy Azure:
pt_br: Selecione sua assinatura do Azure:
ru: Выберите свою подписку Azure:
tr: Azure aboneliğinizi seçin:
zh_hans: 选择 Azure 订阅:
zh_hant: 選取您的 Azure 訂用帳戶:

# TenantDialogTitle
source: Azure tenant
cs: Tenant Azure
de: Azure-Mandant
fr: Locataire Azure
it: Tenant di Azure
ja: Azure テナント
ko: Azure 테넌트
pl: Dzierżawa platformy Azure
pt_br: Locatário do Azure
ru: Клиент Azure
tr: Azure kiracısı

# TenantLabel
source: Tenant ID
cs: ID tenanta
de: Mandanten-ID
fr: ID du locataire
it: ID tenant
ja: テナント ID
ko: 테넌트 ID
pl: Identyfikator dzierżawy
pt_br: ID do locatário
ru: ИД клиента
tr: Kiracı Kimliği

# TenantManualEntryMessage
source: Enter your Azure tenant ID:
cs: Zadejte ID tenanta Azure:
de: Geben Sie Ihre Azure-Mandanten-ID ein:
fr: Saisissez votre ID de locataire Azure :
it: Immettere l'ID tenant di Azure:
ja: Azure テナント ID を入力してください:
ko: Azure 테넌트 ID 입력:
pl: Wprowadź identyfikator dzierżawy platformy Azure:
pt_br: Insira a sua ID de locatário do Azure:
ru: Введите свой ИД клиента Azure:
tr: Azure kiracı kimliğinizi girin:

# TenantPlaceholder
source: Select tenant ID
cs: Vybrat ID tenanta
de: Mandanten-ID auswählen
fr: Sélectionner l'ID du locataire
it: Seleziona ID tenant
ja: テナント ID の選択
ko: 테넌트 ID 선택
pl: Wybierz identyfikator dzierżawy
pt_br: Selecionar a ID do locatário
ru: Выберите ИД клиента
tr: Kiracı kimliği seçin

# TenantSelectionMessage
source: Select your Azure tenant:
cs: Vyberte tenanta Azure:
de: Wählen Sie Ihren Azure-Mandanten aus:
fr: Sélectionnez votre locataire Azure :
it: Selezionare il tenant di Azure:
ja: Azure テナントを選択してください:
ko: Azure 테넌트 선택:
pl: Wybierz dzierżawę platformy Azure:
pt_br: Selecione o seu locatário do Azure:
ru: Выберите клиент Azure:
tr: Azure kiracınızı seçin:

# ValidationResourceGroupNameInvalid
source: Resource group name must be a valid Azure resource group name.
cs: Název skupiny prostředků musí být platný název skupiny prostředků Azure.
de: Der Ressourcengruppenname muss ein gültiger Azure-Ressourcengruppenname sein.
es: El nombre del grupo de recursos debe ser un nombre de grupo de recursos de Azure válido.
fr: Le nom du groupe de ressources doit être un nom de groupe de ressources Azure valide.
it: Il nome del gruppo di risorse deve essere un nome valido per un gruppo di risorse di Azure.
ja: リソース グループ名は、有効な Azure リソース グループ名である必要があります。
ko: 리소스 그룹 이름은 유효한 Azure 리소스 그룹 이름이어야 합니다.
pl: Nazwa grupy zasobów musi być prawidłową nazwą grupy zasobów platformy Azure.
pt_br: O nome do grupo de recursos deve ser um nome válido de grupo de recursos do Azure.
ru: Имя группы ресурсов должно быть допустимым именем группы ресурсов Azure.
tr: Kaynak grubu adı, geçerli bir Azure kaynak grubu adı olmalıdır.
zh_hans: 资源组名称必须是有效的 Azure 资源组名称。
zh_hant: 資源群組名稱必須是有效的 Azure 資源群組名稱。

# ValidationSubscriptionIdInvalid
source: Subscription ID must be a valid GUID.
cs: ID předplatného musí být platným identifikátorem GUID.
de: Die Abonnement-ID muss eine gültige GUID sein.
es: El identificador de suscripción debe ser un GUID válido.
fr: L’ID d’abonnement doit être un GUID valide.
it: L'ID sottoscrizione deve essere un GUID valido.
ja: サブスクリプション ID は有効な GUID である必要があります。
ko: 구독 ID는 유효한 GUID여야 합니다.
pl: Identyfikator subskrypcji musi być prawidłowym identyfikatorem GUID.
pt_br: A ID da assinatura deve ser um GUID válido.
ru: Идентификатор подписки должен быть допустимым GUID.
tr: Abonelik kimliği geçerli bir GUID olmalıdır.
zh_hans: 订阅 ID 必须是有效的 GUID。
zh_hant: 訂閱識別碼必須是有效的 GUID。

# ValidationTenantIdInvalid
source: Tenant ID must be a valid GUID.
cs: ID tenanta musí být platný identifikátor GUID.
de: Die Mandanten-ID muss eine gültige GUID sein.
fr: L'ID du locataire doit être un GUID valide.
it: L'ID tenant deve essere un GUID valido.
ja: テナント ID は有効な GUID である必要があります。
ko: 테넌트 ID는 유효한 GUID여야 합니다.
pl: Identyfikator dzierżawcy musi być prawidłowym identyfikatorem GUID.
pt_br: A ID do locatário deve ser um GUID válido.
ru: ИД клиента должен быть допустимым GUID.
tr: Kiracı kimliği geçerli bir GUID olmalıdır.

# InputsMessage
source: The model contains Azure resources that require an Azure Subscription. To learn more, see the [Azure provisioning docs](https://learn.microsoft.com/dotnet/aspire/azure/local-provisioning).
pl: Model zawiera zasoby platformy Azure, które wymagają subskrypcji platformy Azure. Aby dowiedzieć się więcej, zobacz [dokumentację aprowizacji platformy Azure](https://aka.ms/dotnet/aspire/azure/provisioning).
