Repository: dotnet/aspire
Catalog: src/Aspire.Hosting/Resources/xlf/InteractionStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ContainerRuntimeDockerAdvice
source: Ensure that Docker is running and that the Docker daemon is accessible. If Resource Saver mode is enabled, containers may not run.
cs: Ujistěte se, že je spuštěný Docker a že je dostupný démon Dockeru. Pokud je povolen režim spořiče prostředků, kontejnery se nemusí spustit.
de: Stellen Sie sicher, dass Docker ausgeführt wird und dass auf den Docker-Daemon zugegriffen werden kann. Wenn der Ressourcenschonermodus aktiviert ist, werden Container möglicherweise nicht ausgeführt.
es: Asegúrese de que Docker se está ejecutando y de que el demonio de Docker es accesible. Si el modo de ahorro de recursos está habilitado, es posible que los contenedores no se ejecuten.
fr: Vérifiez que Docker est en cours d’exécution et que le démon Docker est accessible. Si le mode d’économiseur de ressources est activé, les conteneurs peuvent ne pas s’exécuter.
it: Assicurati che Docker sia in esecuzione e che il demone Docker sia accessibile. Se la modalità Risparmio risorse è abilitata, i contenitori potrebbero non funzionare.
ja: Docker が実行されていること、および Docker デーモンにアクセスできることを確認してください。リソース セーバー モードが有効になっている場合、コンテナーが実行されない可能性があります。
ko: Docker가 실행 중이고 Docker 디먼에 액세스할 수 있는지 확인합니다. 리소스 절약 모드가 활성화되면 컨테이너가 실행되지 않을 수 있습니다.
pl: Upewnij się, że platforma Docker jest uruchomiona i że demon platformy Docker jest dostępny. Jeśli tryb oszczędzania zasobów jest włączony, kontenery mogą nie działać.
pt_br: Verifique se o Docker está em execução e se o daemon do Docker está acessível. Se o modo de Economia de Recursos estiver habilitado, os contêineres poderão não ser executados.
ru: Убедитесь, что Docker запущен и управляющая программа Docker доступна. Если включен режим экономии ресурсов, контейнеры могут не запускаться.
tr: Docker'ın çalıştığından ve Docker daemon'a erişilebildiğinden emin olun. Kaynak Tasarrufu modu etkinleştirilirse, kapsayıcılar çalışmayabilir.
zh_hans: 确保 Docker 正在运行且 Docker 守护程序可访问。如果启用了资源保护模式，则容器可能无法运行。
zh_hant: 確定 Docker 正在執行，且 Docker Daemon 可供存取。如果啟用資源節省模式，容器可能無法執行。

# ContainerRuntimeGenericAdvice
source: Ensure that the container runtime is running.
cs: Ujistěte se, že je spuštěný modul runtime kontejneru.
de: Stellen Sie sicher, dass die Containerruntime ausgeführt wird.
es: Asegúrese de que el runtime del contenedor se está ejecutando.
fr: Vérifiez que le runtime de conteneur est en cours d’exécution.
it: Assicurati che il runtime del contenitore sia in esecuzione.
ja: コンテナー ランタイムが実行されていることを確認してください。
ko: 컨테이너 런타임이 실행 중인지 확인합니다.
pl: Upewnij się, że środowisko uruchomieniowe kontenera jest uruchomione.
pt_br: Verifique se o runtime do contêiner está em execução.
ru: Убедитесь, что среда выполнения контейнера запущена.
tr: Kapsayıcı çalışma zamanının çalıştığından emin olun.
zh_hans: 确保容器运行时正在运行。
zh_hant: 請確保容器執行階段正在執行。

# ContainerRuntimeLinkText
source: Learn more
cs: Další informace
de: Weitere Informationen
es: Más información
fr: Découvrir plus d’informations
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pl: Dowiedz się więcej
pt_br: Saiba mais
ru: Подробнее
tr: Daha fazla bilgi edinin
zh_hans: 了解详细信息
zh_hant: 深入了解

# ContainerRuntimeNotInstalledMessage
source: Container runtime could not be found. See https://aka.ms/dotnet/aspire/containers for more details on supported container runtimes.
cs: Nepovedlo se najít modul runtime kontejneru. Další podrobnosti o podporovaných modulech runtime kontejnerů najdete na https://aka.ms/dotnet/aspire/containers.
de: Die Containerruntime wurde nicht gefunden. Weitere Informationen zu unterstützten Containerruntimes finden Sie unter „https://aka.ms/dotnet/aspire/containers“.
es: No se encontró el runtime del contenedor. Consulte https://aka.ms/dotnet/aspire/containers para más información sobre los runtimes de contenedor admitidos.
fr: Le runtime du conteneur est introuvable. Pour plus de détails sur les systèmes d’exécution de conteneurs pris en charge, consultez https://aka.ms/dotnet/aspire/containers.
it: Non è possibile trovare il runtime del contenitore. Vedi https://aka.ms/dotnet/aspire/containers per altri dettagli sui runtime del contenitore supportati.
ja: コンテナー ランタイムが見つかりませんでした。サポートされているコンテナー ランタイムの詳細については、https://aka.ms/dotnet/aspire/containers を参照してください。
ko: 컨테이너 런타임을 찾을 수 없습니다. 지원되는 컨테이너 런타임에 관한 자세한 내용은 https://aka.ms/dotnet/aspire/containers를 참조하세요.
pl: Nie można odnaleźć środowiska uruchomieniowego kontenera. Aby uzyskać więcej informacji o obsługiwanych środowiskach uruchomieniowych kontenerów, zobacz https://aka.ms/dotnet/aspire/containers.
pt_br: Não foi possível encontrar o runtime do contêiner. Consulte https://aka.ms/dotnet/aspire/containers para obter mais detalhes sobre runtimes de contêiner com suporte.
ru: Не удалось найти среду выполнения контейнера. Дополнительные сведения о поддерживаемых средах выполнения контейнеров см. на странице https://aka.ms/dotnet/aspire/containers.
tr: Kapsayıcı çalışma zamanı bulunamadı. Desteklenen konteyner çalışma zamanları hakkında daha fazla ayrıntı için https://aka.ms/dotnet/aspire/containers adresine bakın.
zh_hans: 找不到容器运行时。有关支持的容器运行时的更多详细信息，请参阅 https://aka.ms/dotnet/aspire/containers。
zh_hant: 找不到容器執行階段。如需支援之容器執行階段的詳細資訊，請參閱 https://aka.ms/dotnet/aspire/containers。

# ContainerRuntimeNotInstalledTitle
source: Container runtime not installed
cs: Modul runtime kontejneru není nainstalovaný
de: Containerruntime nicht installiert
es: Tiempo de ejecución de contenedor no instalado
fr: Runtime de conteneur non installé
it: Runtime del contenitore non installato
ja: コンテナー ランタイムがインストールされていません
ko: 컨테이너 런타임이 설치되지 않음
pl: Nie zainstalowano środowiska uruchomieniowego kontenera
pt_br: Tempo de execução do contêiner não instalado
ru: Среда выполнения контейнера не установлена
tr: Kapsayıcı çalışma zamanı yüklenmedi
zh_hans: 未安装容器运行时
zh_hant: 未安裝容器執行階段

# ContainerRuntimePodmanAdvice
source: Ensure that Podman is running.
cs: Ověřuje se, jestli je spuštěný Podman...
de: Stellen Sie sicher, dass Podman ausgeführt wird.
es: Asegúrese de que Podman se está ejecutando.
fr: Assurez-vous que Podman est en cours d’exécution.
it: Assicurati che Podman sia in esecuzione...
ja: Podman が実行されていることを確認してください。
ko: Podman이 실행 중인지 확인합니다.
pl: Upewnij się, że narzędzie Podman jest uruchomione.
pt_br: Verifique se o Podman está em execução.
ru: Убедитесь, что Podman запущен.
tr: Podman'ın çalıştığından emin olun.
zh_hans: 确保 Podman 正在运行。
zh_hant: 確認 Podman 正在執行。

# ContainerRuntimeUnhealthyMessage
source: Container runtime '{0}' was found but appears to be unhealthy.
cs: Modul runtime kontejneru {0} byl nalezen, ale zdá se, že není v pořádku.
de: Die Containerruntime „{0}“ wurde gefunden, scheint aber fehlerhaft zu sein.
es: Se encontró el runtime de contenedor ''{0}'', pero parece que está en un estado incorrecto.
fr: Le runtime de conteneur « {0} » a été trouvé, mais il semble qu’il ne soit pas sain.
it: Il runtime del contenitore '{0}' è stato trovato ma non è integro.
ja: コンテナー ランタイム '{0}' が見つかりましたが、異常な可能性があります。
ko: 컨테이너 런타임 '{0}'(을)를 찾았지만 비정상인 것 같습니다.
pl: Znaleziono środowisko uruchomieniowe kontenera „{0}”, ale wygląda na to, że jest w złej kondycji.
pt_br: O runtime do contêiner "{0}" foi encontrado, mas parece não estar íntegro.
ru: Обнаружена среда выполнения контейнера "{0}", но, судя по всему, неработоспособная.
tr: Kapsayıcı çalışma zamanı '{0}' bulundu, ancak iyi durumda değil.
zh_hans: 找到容器运行时 ‘{0}’，但它似乎运行不正常。
zh_hant: 找到了容器執行階段 '{0}'，但似乎狀況不良。

# ContainerRuntimeUnhealthyTitle
source: Container runtime unhealthy
cs: Modul runtime kontejneru není v pořádku
de: Containerruntime fehlerhaft
es: El entorno de ejecución del contenedor está en mal estado
fr: Runtime de conteneur défectueux
it: Runtime del contenitore non integro
ja: 異常なコンテナー ランタイム
ko: 컨테이너 런타임 비정상
pl: Nieprawidłowa kondycja środowiska uruchomieniowego kontenera
pt_br: Tempo de execução do contêiner não íntegro
ru: Неработоспособная среда выполнения контейнера
tr: Kapsayıcı çalışma zamanı iyi durumda değil
zh_hans: 容器运行时不正常
zh_hant: 容器執行階段狀況不良

# DeleteParameterMessage
source: Are you sure you want to delete the value for parameter `{0}`?
cs: Opravdu chcete odstranit hodnotu parametru {0}?
fr: Voulez-vous vraiment supprimer la valeur du paramètre « {0} » ?
it: Eliminare il valore del parametro '{0}'?
ko: `{0}` 매개 변수의 값을 삭제하시겠습니까?
pt_br: Tem certeza de que deseja excluir o valor do parâmetro `{0}`?
zh_hans: 确定要删除参数 `{0}` 的值吗?
zh_hant: 確定要刪除參數 `{0}` 的值?

# DeleteParameterMessageWithUserSecrets
source: Are you sure you want to delete the value for parameter `{0}`? The value is currently saved in [user secrets](https://learn.microsoft.com/aspnet/core/security/app-secrets). You can choose to also delete it from there.
cs: Opravdu chcete odstranit hodnotu parametru {0}? Hodnota je aktuálně uložena v [tajných klíčích uživatele](https://learn.microsoft.com/aspnet/core/security/app-secrets). Můžete se také rozhodnout ji odtud odstranit.
fr: Voulez-vous vraiment supprimer la valeur du paramètre «{0} » ? La valeur est actuellement enregistrée dans [secrets utilisateur](https://learn.microsoft.com/aspnet/core/security/app-secrets). Vous pouvez également choisir de le supprimer à partir de là.
it: Eliminare il valore del parametro '{0}'? Il valore è attualmente salvato nei [segreti utente](https://learn.microsoft.com/aspnet/core/security/app-secrets). È possibile scegliere di eliminarlo anche da lì.
ko: `{0}` 매개 변수의 값을 삭제하시겠습니까? 이 값은 현재 [사용자 비밀](https://learn.microsoft.com/aspnet/core/security/app-secrets)에 저장되어 있습니다. 여기에서 삭제하도록 선택할 수도 있습니다.
pt_br: Tem certeza de que deseja excluir o valor do parâmetro `{0}`? O valor está atualmente salvo em [segredos do usuário](https://learn.microsoft.com/aspnet/core/security/app-secrets). Você pode optar por excluí-lo também de lá.
zh_hans: 确定要删除参数 `{0}` 的值吗? 该值当前保存在[用户机密](https://learn.microsoft.com/aspnet/core/security/app-secrets)中。你可以选择也从其中将它删除。
zh_hant: 確定要刪除參數 `{0}` 的值? 值目前儲存於 [使用者祕密](https://learn.microsoft.com/aspnet/core/security/app-secrets)。您可以選擇也從該處刪除它。

# DeleteParameterPrimaryButtonText
source: Delete
cs: Odstranit
fr: Supprimer
it: Elimina
ko: 삭제
pt_br: Excluir
zh_hans: 删除
zh_hant: 刪除

# DeleteParameterTitle
source: Delete parameter value
cs: Odstranit hodnotu parametru
fr: Supprimer la valeur du paramètre
it: Elimina valore parametro
ko: 매개 변수 값 삭제
pt_br: Excluir valor do parâmetro
zh_hans: 删除参数值
zh_hant: 刪除參數值

# ParametersBarMessage
source: There are unresolved parameters that need to be set. Please provide values for them.
cs: Existují nevyřešené parametry, které je třeba nastavit. Zadejte pro ně hodnoty.
de: Es gibt nicht aufgelöste Parameter, die festgelegt werden müssen. Geben Sie Werte für diese an.
es: Hay parámetros sin resolver que deben configurarse. Proporcione valores para ellos.
fr: Vous devez définir des paramètres non résolus. Veuillez leur fournir des valeurs.
it: Sono presenti parametri non risolti che devono essere impostati. Specifica i valori per questi parametri.
ja: 設定する必要のある未解決のパラメーターがあります。それらの値を指定してください。
ko: 설정해야 하는 해결되지 않은 매개 변수가 있습니다. 값을 입력하세요.
pl: Istnieją nierozpoznane parametry, które należy ustawić. Podaj dla nich wartości.
pt_br: Há parâmetros não resolvidos que precisam ser definidos. Insira valores para eles.
ru: Существуют неразрешенные параметры, которые необходимо настроить. Укажите значения для них.
tr: Ayarlanması gereken çözülmemiş parametreler var. Lütfen bunlara değerler girin.
zh_hans: 有未解析的参数需要设置。请为这些参数提供值。
zh_hant: 有些未解析的參數需要設定。請提供它們的值。

# ParametersBarPrimaryButtonText
source: Enter values
cs: Zadat hodnoty
de: Werte eingeben
es: Especifique los valores
fr: Entrer des valeurs
it: Immetti i valori
ja: 値の入力
ko: 값 입력
pl: Wprowadź wartości
pt_br: Inserir valores
ru: Ввести значения
tr: Değerleri girin
zh_hans: 输入值
zh_hant: 輸入值

# ParametersBarTitle
source: Unresolved parameters
cs: Nerozpoznané parametry
de: Nicht aufgelöste Parameter
es: Parámetros sin resolver
fr: Paramètres non résolus
it: Parametri non risolti
ja: 未解決のパラメーター
ko: 해결되지 않은 매개 변수
pl: Nierozpoznane parametry
pt_br: Parâmetros não resolvidos
ru: Неразрешенные параметры
tr: Çözülmemiş parametreler
zh_hans: 未解析的参数
zh_hant: 未解析的參數

# ParametersInputsDeleteLabel
source: Delete from user secrets
cs: Odstranit z tajných kódů uživatele
fr: Supprimer des secrets utilisateur
it: Elimina dai segreti utente
ko: 사용자 비밀에서 삭제
pt_br: Excluir dos segredos do usuário
zh_hans: 从用户机密中删除
zh_hant: 從使用者祕密刪除

# ParametersInputsMessage
source: Please provide values for the unresolved parameters. Parameters can be saved to [user secrets](https://aka.ms/aspire/user-secrets) for future use.
cs: Zadejte prosím hodnoty pro nevyřešené parametry. Parametry lze uložit do [tajných kódů uživatele](https://aka.ms/aspire/user-secrets) pro budoucí použití.
fr: Veuillez fournir des valeurs pour les paramètres non résolus. Les paramètres peuvent être enregistrés dans [secrets utilisateur](https://aka.ms/aspire/user-secrets) pour une utilisation ultérieure.
it: Specificare i valori per i parametri non risolti. I parametri possono essere salvati nei [segreti utente](https://aka.ms/aspire/user-secrets) per usi futuri.
ko: 해결되지 않은 매개 변수에 대한 값을 제공하세요. 나중에 사용할 수 있도록 [사용자 비밀](https://aka.ms/aspire/user-secrets)에 매개 변수를 저장할 수 있습니다.
pt_br: Forneça valores para os parâmetros não resolvidos. Os parâmetros podem ser salvos em [segredos do usuário](https://aka.ms/aspire/user-secrets) para uso futuro.
zh_hans: 请为未解析的参数提供值。参数可保存到[用户机密](https://aka.ms/aspire/user-secrets)以供将来使用。
zh_hant: 請提供未解析參數的值。參數可以儲存到 [使用者祕密](https://aka.ms/aspire/user-secrets) 供未來使用。

# ParametersInputsMessagePublishMode
source: Please provide values for the unresolved parameters.
cs: Zadejte prosím hodnoty pro nevyřešené parametry.
de: Geben Sie Werte für die nicht aufgelösten Parameter an.
es: Proporcione valores para los parámetros sin resolver.
fr: Veuillez fournir des valeurs pour les paramètres non résolus.
it: Specifica i valori per i parametri non risolti.
ja: 未解決のパラメーターの値を指定してください。
ko: 해결되지 않은 매개 변수에 대한 값을 제공하세요.
pl: Podaj wartości dla nierozpoznanych parametrów.
pt_br: Insira valores para os parâmetros não resolvidos.
ru: Укажите значения для неразрешенных параметров.
zh_hans: 请为未解析的参数提供值。
zh_hant: 請提供未解析參數的值。

# ParametersInputsParameterPlaceholder
source: Enter value for {0}
cs: Zadejte hodnotu pro {0}
de: Wert für {0} eingeben
es: Escriba el valor de {0}
fr: Entrez une valeur pour {0}
it: Immetti un valore per {0}
ja: {0} の値を入力してください
ko: {0}에 대한 값 입력
pl: Wprowadź wartość dla {0}
pt_br: Inserir valor para {0}
ru: Введите значение для {0}
tr: {0} için değer girin
zh_hans: 输入 {0} 的值
zh_hant: 輸入 {0} 的值

# ParametersInputsPrimaryButtonText
source: Save
cs: Uložit
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: 保存
ko: 저장
pl: Zapisz
pt_br: Salvar
ru: Сохранить
tr: Kaydet
zh_hans: 保存
zh_hant: 儲存

# ParametersInputsRememberDescriptionNotConfigured
source: Requires a `UserSecretsId` to be configured in the AppHost project file. Run `dotnet user-secrets init` in the AppHost directory to configure.
cs: Vyžaduje konfiguraci UserSecretsId v souboru projektu AppHost. Konfiguraci provedete spuštěním příkazu dotnet user-secrets init v adresáři AppHost.
fr: Nécessite la configuration d’un UserSecretsId dans le fichier projet AppHost. Exécutez « dotnet user-secrets init » dans le répertoire AppHost à configurer.
it: È necessario configurare un 'UserSecretsId' nel file di progetto AppHost. Eseguire 'dotnet user-secrets init' nella directory AppHost per configurarlo.
ko: AppHost 프로젝트 파일에서 `UserSecretsId`를 구성해야 합니다. AppHost 디렉터리에서 `dotnet user-secrets init`을 실행하여 구성합니다.
pt_br: É necessário que um `UserSecretsId` seja configurado no arquivo de projeto AppHost. Execute `dotnet user-secrets init` no diretório AppHost para configurar.
zh_hans: 要求在 AppHost 项目文件中配置 `UserSecretsId`。在 AppHost 目录中运行 `dotnet user-secrets init` 进行配置。
zh_hant: 需要在 AppHost 專案檔中設定 `UserSecretsId`。在 AppHost 目錄中執行 `dotnet user-secrets init` 以設定。

# ParametersInputsRememberLabel
source: Save to user secrets
cs: Uložit do tajných kódů uživatelů
de: In Benutzergeheimnissen speichern
es: Guardar en secretos de usuario
fr: Enregistrer dans les secrets utilisateur
it: Salva nei segreti utente
ja: ユーザー シークレットに保存
ko: 사용자 비밀에 저장
pl: Zapisz we wpisach tajnych użytkownika
pt_br: Salvar nos segredos do usuário
ru: Сохранить в пользовательских секретах
tr: Kullanıcı gizli bilgilerine kaydet
zh_hans: 保存到用户机密
zh_hant: 儲存至使用者祕密

# ParametersInputsTitle
source: Set unresolved parameters
cs: Nastavit nerozpoznané parametry
de: Nicht aufgelöste Parameter festlegen
es: Establecer parámetros sin resolver
fr: Définissez les paramètres non résolus
it: Imposta i parametri non risolti
ja: 未解決のパラメーターを設定する
ko: 해결되지 않은 매개 변수 설정
pl: Ustaw nierozpoznane parametry
pt_br: Definir parâmetros não resolvidos
ru: Настроить неразрешенные параметры
tr: Çözülmemiş parametreleri ayarlayın
zh_hans: 设置未解析的参数
zh_hant: 設定未解析的參數

# VersionCheckLinkText
source: Upgrade instructions
cs: Pokyny k upgradu
de: Upgradeanweisungen
es: Instrucciones de actualización
fr: Instructions de mise à niveau
it: Istruzioni per l'aggiornamento
ja: 手順のアップグレード
ko: 업그레이드 지침
pl: Instrukcje uaktualniania
pt_br: Instruções de atualização
ru: Инструкции по обновлению
tr: Yükseltme talimatları
zh_hans: 升级说明
zh_hant: 升級指示

# VersionCheckMessage
source: Aspire {0} is available.
cs: Aspire {0} je k dispozici.
de: Aspire {0} ist verfügbar.
es: Aspire {0} está disponible.
fr: Aspire {0} est disponible.
it: Aspire {0} è disponibile.
ja: Aspire {0} を利用できます。
ko: Aspire {0}을(를) 사용할 수 있습니다.
pl: Usługa Aspire {0} jest dostępna.
pt_br: O Aspire {0} está disponível.
ru: Aspire {0} доступно.
tr: Aspire {0} kullanılabilir.
zh_hans: Aspire {0} 可用。
zh_hant: Aspire {0} 可供使用。

# VersionCheckPrimaryButtonText
source: Ignore
cs: Ignorovat
de: Ignorieren
es: Ignorar
fr: Ignorer
it: Ignora
ja: 無視
ko: 무시
pl: Ignoruj
pt_br: Ignorar
ru: Игнорировать
tr: Yoksay
zh_hans: 忽略
zh_hant: 略過

# VersionCheckTitle
source: Update now
cs: Aktualizovat teď
de: Jetzt aktualisieren
es: Actualizar ahora
fr: Mettez à jour maintenant
it: Aggiorna adesso
ja: 今すぐ更新
ko: 지금 업데이트
pl: Zaktualizuj teraz
pt_br: Atualize agora
ru: Обновить сейчас
tr: Şimdi güncelleştirin
zh_hans: 立即更新
zh_hant: 立即更新

# SetParameterMessage
source: Please provide a value for the parameter. The parameter can be saved to [user secrets](https://learn.microsoft.com/aspnet/core/security/app-secrets) for future use. New parameter values may not be used until dependent resources are restarted.
cs: Zadejte prosím hodnotu parametru. Parametr lze uložit do [tajných kódů uživatele](https://learn.microsoft.com/aspnet/core/security/app-secrets) pro budoucí použití. Nové hodnoty parametrů se nedají použít, dokud se nerestartují závislé prostředky.
fr: Veuillez fournir une valeur pour le paramètre. Le paramètre peut être enregistré dans [secrets utilisateur](https://learn.microsoft.com/aspnet/core/security/app-secrets) pour une utilisation ultérieure. Les nouvelles valeurs de paramètre ne peuvent pas être utilisées tant que les ressources dépendantes ne sont pas redémarrées.
it: Specificare un valore per il parametro. I parametri possono essere salvati nei [segreti utente](https://learn.microsoft.com/aspnet/core/security/app-secrets) per usi futuri. I nuovi valori del parametro potrebbero non essere usati finché le risorse dipendenti non vengono riavviate.
ko: 매개 변수에 대한 값을 제공하세요. 나중에 사용할 수 있도록 매개 변수를 [사용자 비밀](https://learn.microsoft.com/aspnet/core/security/app-secrets)에 저장할 수 있습니다. 종속 리소스를 다시 시작할 때까지 새 매개 변수 값을 사용할 수 없습니다.
pt_br: Forneça um valor para o parâmetro. O parâmetro pode ser salvo em [segredos do usuário](https://learn.microsoft.com/aspnet/core/security/app-secrets) para uso futuro. Novos valores de parâmetro não podem ser usados após a reinicialização dos recursos dependentes.
zh_hans: 请为参数提供值。此参数可以保存到[用户机密](https://learn.microsoft.com/aspnet/core/security/app-secrets)以供将来使用。 在重启从属资源之前，不能使用新的参数值。
zh_hant: 請提供參數的值。參數可以儲存到 [使用者祕密](https://learn.microsoft.com/aspnet/core/security/app-secrets) 供未來使用。 除非重新啟動相依資源，否則無法使用新的參數值。

# SetParameterTitle
source: Set parameter
cs: Nastavit parametr
fr: Définir le paramètre
it: Imposta parametro
ko: 매개 변수 설정
pt_br: Definir parâmetro
zh_hans: 设置参数
zh_hant: 設定參數

# ParametersInputsMessage
source: Please provide values for the unresolved parameters. Parameters can be saved to [user secrets](https://learn.microsoft.com/aspnet/core/security/app-secrets) for future use.
de: Geben Sie Werte für die nicht aufgelösten Parameter an. Parameter können zur zukünftigen Verwendung in [Benutzergeheimnisse](https://learn.microsoft.com/aspnet/core/security/app-secrets) gespeichert werden.
es: Proporcione valores para los parámetros sin resolver. Los parámetros se pueden guardar en [secretos de usuario](https://learn.microsoft.com/aspnet/core/security/app-secrets) para su uso futuro.
ja: 未解決のパラメーターの値を指定してください。パラメーターは、将来使用のために [ユーザー シークレット](https://learn.microsoft.com/aspnet/core/security/app-secrets) に保存できます。
pl: Podaj wartości dla nierozpoznanych parametrów. Parametry można zapisać we [wpisach tajnych użytkownika](https://learn.microsoft.com/aspnet/core/security/app-secrets) do przyszłego użytku.
ru: Укажите значения для неразрешенных параметров. Параметры можно сохранить в [пользовательских секретах](https://learn.microsoft.com/aspnet/core/security/app-secrets) для дальнейшего использования.
tr: Çözülmemiş parametreler için değerleri girin. Parametreler, ileride kullanılmak üzere [kullanıcı gizli bilgileri](https://learn.microsoft.com/aspnet/core/security/app-secrets) bölümüne kaydedilebilir.
