Repository: dotnet/aspire
Catalog: src/Aspire.Hosting/Resources/xlf/MessageStrings.*.xlf
Languages: cs, fr, ja, ko, zh_hans, zh_hant

# ContainerMountAnonymousVolumesReadOnlyExceptionMessage
source: Anonymous volumes cannot be read-only.
cs: Anonymní svazky nemůžou být jen pro čtení.
fr: Les volumes anonymes ne peuvent pas être en lecture seule.
ja: 匿名ボリュームを読み取り専用にすることはできません。
ko: 익명 볼륨은 읽기 전용일 수 없습니다.
zh_hans: 匿名卷不能为只读。
zh_hant: 匿名磁碟區不可為唯讀。

# ContainerMountBindMountsRequireRootedPaths
source: Bind mounts must specify an absolute path.
cs: Připojení vazby musí určovat absolutní cestu.
fr: Les montages de liaison doivent spécifier un chemin d’accès absolu.
ja: バインド マウントでは絶対パスを指定する必要があります。
ko: 바인딩 탑재는 절대 경로를 지정해야 합니다.
zh_hans: 绑定装载必须指定绝对路径。
zh_hant: 繫結裝載必須指定絕對路徑。

# ContainerMountBindMountsRequireSourceExceptionMessage
source: Bind mounts must specify a source path.
cs: Připojení vazeb musí určovat zdrojovou cestu.
fr: Les montages de liaison doivent spécifier un chemin d’accès source.
ja: バインド マウントでは、ソース パスを指定する必要があります。
ko: 바인딩 탑재는 원본 경로를 지정해야 합니다.
zh_hans: 绑定装载必须指定源路径。
zh_hant: 繫結裝載必須指定來源路徑。

# DcpDependencyCheckFailedMessage
source: Application orchestrator dependency check returned an error: {0}
cs: Kontrola závislosti orchestrátoru aplikace vrátila chybu: {0}
fr: La vérification des dépendances de l’orchestrateur d’application a renvoyé une erreur : {0}
ja: アプリケーション オーケストレーターの依存関係チェックでエラー {0} が返されました。
ko: 애플리케이션 오케스트레이터 종속성 검사에서 오류를 반환했습니다. {0}
zh_hans: 应用程序业务流程协调程序依赖项检查返回了错误: {0}
zh_hant: 應用程式協調器相依性檢查已傳回錯誤: {0}

# DcpVersionCheckTooLowMessage
source: Newer version of the Aspire.Hosting.AppHost package is required to run the application. Ensure you are referencing at least version '{0}'.
cs: Ke spuštění aplikace se vyžaduje novější verze balíčku Aspire.Hosting.AppHost. Ujistěte se, že odkazujete alespoň na verzi {0}.
fr: Une version plus récente du package Aspire.Hosting.AppHost est nécessaire pour exécuter l’application. Vérifiez que vous référencez au moins la version « {0} ».
ja: アプリケーションを実行するには、Aspire.Hosting.AppHost パッケージの新しいバージョンが必要です。少なくともバージョン '{0}' を参照していることを確認してください。
ko: 애플리케이션을 실행하려면 최신 버전의 Aspire.Hosting.AppHost 패키지가 필요합니다. 최소한 '{0}' 이상의 버전을 참조하고 있는지 확인하세요.
zh_hans: 运行应用程序需要更新版本的 Aspire.Hosting.AppHost 包。请确保至少引用版本“{0}”。
zh_hant: 執行應用程式需要較新版本的 Aspire.Hosting.AppHost 套件。請確保您參考的版本至少為 '{0}'。

source: Installation instructions
cs: Pokyny k instalaci
fr: Instructions d’installation
ja: インストール手順
ko: 설치 지침
zh_hans: 安装说明
zh_hant: 安裝指示

# MissingCommandNotificationTitle
source: Missing command
cs: Chybějící příkaz
fr: Commande manquante
ja: コマンドがありません
ko: 명령이 없음
zh_hans: 缺少命令
zh_hant: 遺漏命令

# RequiredCommandNotFound
source: Required command '{0}' was not found on PATH or at the specified location.
cs: Požadovaný příkaz {0} nebyl nalezen v cestě PATH nebo v zadaném umístění.
fr: La commande requise « {0} » est introuvable dans le CHEMIN ou à l’emplacement spécifié.
ja: 必要なコマンド '{0}' が PATH または指定された場所に見つかりませんでした。
ko: PATH 또는 지정된 위치에서 필수 명령 '{0}'을(를) 찾을 수 없습니다.
zh_hans: 在 PATH 或指定位置找不到所需命令 "{0}"。
zh_hant: 在 PATH 或指定的位置找不到必要的命令 '{0}'。

# RequiredCommandNotFoundWithLink
source: Required command '{0}' was not found on PATH or at the specified location. For installation instructions, see: {1}
cs: Požadovaný příkaz {0} nebyl nalezen v cestě PATH nebo v zadaném umístění. Pokyny k instalaci najdete tady: {1}
fr: La commande requise « {0} » est introuvable dans le CHEMIN ou à l’emplacement spécifié. Pour les instructions d’installation manuelle, voir : {1}
ja: 必要なコマンド '{0}' が PATH または指定された場所に見つかりませんでした。インストール手順については、次を参照: {1}
ko: PATH 또는 지정된 위치에서 필수 명령 '{0}'을(를) 찾을 수 없습니다. 설치 지침은 다음을 참조하세요. {1}
zh_hans: 在 PATH 或指定位置找不到所需命令 "{0}"。有关安装说明，请参阅: {1}
zh_hant: 在 PATH 或指定的位置找不到必要的命令 '{0}'。如需安裝指示，請參閱: {1}

# RequiredCommandValidationFailed
source: Command '{0}' validation failed: {1}
cs: Ověření příkazu {0} se nezdařilo: {1}
fr: Désolé, échec de la validation de la commande « {0} » : {1}
ja: コマンド '{0}' 検証に失敗しました: {1}
ko: 명령 '{0}' 유효성 검사가 실패함: {1}.
zh_hans: 命令 "{0}" 验证失败: {1}
zh_hant: 命令 '{0}' 驗證失敗: {1}

# RequiredCommandValidationFailedWithLink
source: Command '{0}' validation failed: {1}. For installation instructions, see: {2}
cs: Ověření příkazu {0} se nezdařilo: {1}. Pokyny k instalaci najdete tady: {2}
fr: Échec de la validation de la commande « {0} » : {1}. Pour les instructions d’installation manuelle, voir : {2}
ja: コマンド '{0}' 検証に失敗しました: {1}。インストール手順については、次を参照: {2}
ko: 명령 '{0}' 유효성 검사가 실패했습니다. {1}. 설치 지침은 다음을 참조하세요. {2}
zh_hans: 命令 "{0}" 验证失败: {1}。有关安装说明，请参阅: {2}
zh_hant: 命令 '{0}' 驗證失敗: {1}。如需安裝指示，請參閱: {2}

# ResourceMayFailToStart
source: Resource '{0}' may fail to start: {1}
cs: Spuštění prostředku {0} se nemusí podařit: {1}
fr: Le démarrage de la ressource « {0} » peut échouer : {1}
ja: リソース '{0}' の開始に失敗する可能性があります: {1}
ko: 리소스 '{0}'을(를) 시작하지 못할 수 있음: {1}
zh_hans: 资源 "{0}" 可能无法启动: {1}
zh_hant: 資源 '{0}' 可能無法啟動: {1}
