Repository: dotnet/aspire
Catalog: src/Aspire.Hosting/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ContainerMountAnonymousVolumesReadOnlyExceptionMessage
source: Anonymous volumes cannot be read-only.
cs: Anonymní svazky nemůžou být jen pro čtení.
de: Anonyme Volumes können nicht schreibgeschützt sein.
es: Los volúmenes anónimos no pueden ser de solo lectura.
fr: Les volumes anonymes ne peuvent pas être en lecture seule.
it: I volumi anonimi non possono essere di sola lettura.
ja: 匿名ボリュームを読み取り専用にすることはできません。
ko: 익명 볼륨은 읽기 전용일 수 없습니다.
pl: Woluminy anonimowe nie mogą być tylko do odczytu.
pt_br: Volumes anônimos não podem ser somente leitura.
ru: Анонимные тома не могут быть доступны только для чтения.
tr: Anonim birimler salt okunur olamaz.
zh_hans: 匿名卷不能为只读。
zh_hant: 匿名磁碟區不可為唯讀。

# ContainerMountBindMountsRequireRootedPaths
source: Bind mounts must specify an absolute path.
fr: Les montages de liaison doivent spécifier un chemin d’accès absolu.
it: I montaggi di associazione devono specificare un percorso assoluto.
pt_br: As montagens associadas devem especificar um caminho absoluto.
tr: Bağlama işlemlerinde mutlak bir yol belirtilmelidir.
zh_hant: 繫結裝載必須指定絕對路徑。

# ContainerMountBindMountsRequireSourceExceptionMessage
source: Bind mounts must specify a source path.
cs: Připojení vazeb musí určovat zdrojovou cestu.
de: Für "Bereitstellungen einbinden" muss ein Quellpfad angegeben werden.
es: Los montajes de enlace deben especificar una ruta de acceso de origen.
fr: Les montages de liaison doivent spécifier un chemin d’accès source.
it: I montaggi di associazione devono specificare un percorso di origine.
ja: バインド マウントでは、ソース パスを指定する必要があります。
ko: 바인딩 탑재는 원본 경로를 지정해야 합니다.
pl: Instalacje wiązania muszą określać ścieżkę źródłową.
pt_br: As montagens de associação devem especificar um caminho de origem.
ru: Привязка подключений должна указывать исходный путь.
tr: Bağlama işlemlerinde bir kaynak yolu belirtilmelidir.
zh_hans: 绑定装载必须指定源路径。
zh_hant: 繫結裝載必須指定來源路徑。

# ContainerRuntimePrerequisiteMissingExceptionMessage
source: Container runtime '{0}' could not be found. The error from the container runtime check was: {1}. See https://aka.ms/dotnet/aspire/containers for more details on supported container runtimes.
cs: Nepovedlo se najít modul runtime {0} kontejneru. Chyba z kontroly modulu runtime kontejneru byla: {1}. Další podrobnosti o podporovaných modulech runtime kontejnerů najdete na https://aka.ms/dotnet/aspire/containers.
de: Die Containerruntime „{0}“ wurde nicht gefunden. Fehler bei der Überprüfung der Containerruntime: {1}. Weitere Informationen zu unterstützten Containerruntimes finden Sie unter „https://aka.ms/dotnet/aspire/containers“.
es: No se encontró el runtime del contenedor ''{0}''. El error de la comprobación del runtime del contenedor fue: {1}. Consulte https://aka.ms/dotnet/aspire/containers para obtener más información sobre los runtimes de contenedor admitidos.
fr: Le runtime du conteneur « {0} » est introuvable. L’erreur à partir de la vérification du runtime du conteneur était : {1}. . Pour plus d’informations sur les runtimes de conteneur pris en charge, consultez https://aka.ms/dotnet/aspire/containers.
it: Non è stato possibile trovare il runtime del contenitore "{0}". Errore del controllo del runtime del contenitore: {1}. Vedere https://aka.ms/dotnet/aspire/containers per altri dettagli sui runtime del contenitore supportati.
ja: コンテナー ランタイム '{0}' が見つかりませんでした。コンテナー ランタイム チェックのエラー: {1}. サポートされているコンテナー ランタイムの詳細については、https://aka.ms/dotnet/aspire/containers を参照してください。
ko: '{0}' 컨테이너 런타임을 찾을 수 없습니다. 컨테이너 런타임 검사의 오류는 {1}이었습니다. 지원되는 컨테이너 런타임에 관한 자세한 내용은 https://aka.ms/dotnet/aspire/containers를 참조하세요.
pl: Nie można odnaleźć środowiska uruchomieniowego kontenera „{0}”. Błąd podczas sprawdzania środowiska uruchomieniowego kontenera: {1}. Aby uzyskać więcej informacji o obsługiwanych środowiskach uruchomieniowych kontenerów, zobacz https://aka.ms/dotnet/aspire/containers.
pt_br: O runtime do contêiner "{0}" não pôde ser encontrado. O erro da verificação de runtime do contêiner foi : {1}. Consulte https://aka.ms/dotnet/aspire/containers para obter mais detalhes sobre runtimes de contêiner com suporte.
ru: Не удалось найти среду выполнения контейнера "{0}". Ошибка проверки среды выполнения контейнера: {1}. Дополнительные сведения о поддерживаемых средах выполнения контейнеров см. на странице https://aka.ms/dotnet/aspire/containers.
tr: '{0}' kapsayıcı çalışma zamanı bulunamadı. Kapsayıcı çalışma zamanı denetiminden gelen hata: {1}. . Desteklenen konteyner çalışma zamanları hakkında daha fazla ayrıntı için https://aka.ms/dotnet/aspire/containers adresine bakın.
zh_hans: 找不到容器运行时“{0}”。容器运行时检查中的错误为: {1}。 有关受支持的容器运行时的更多详细信息，请参阅 https://aka.ms/dotnet/aspire/containers。
zh_hant: 找不到容器執行階段 '{0}'。來自容器執行階段檢查的錯誤為: {1}。 如需支援的容器執行階段的詳細資訊，請參閱 https://aka.ms/dotnet/aspire/containers。

# ContainerRuntimeUnhealthyExceptionMessage
source: Container runtime '{0}' was found but appears to be unhealthy. The error from the container runtime check was {1}.
cs: Modul runtime kontejneru {0} byl nalezen, ale zdá se, že není v pořádku. Chyba z kontroly modulu runtime kontejneru byla: {1}.
de: Die Containerruntime "{0}" wurde gefunden, scheint aber fehlerhaft zu sein. Fehler bei der Überprüfung der Containerruntime: {1}.
es: Se encontró el runtime de contenedor ''{0}'', pero parece que está en un estado incorrecto. El error de la comprobación del runtime del contenedor fue {1}.
fr: Le runtime de conteneur « {0} » a été trouvé, mais il semble qu’il ne soit pas sain. L’erreur à partir de la vérification du runtime du conteneur était {1}.
it: È stato trovato il runtime del contenitore "{0}", ma non è integro. Errore del controllo del runtime del contenitore: {1}.
ja: コンテナー ランタイム '{0}' が見つかりましたが、異常な可能性があります。コンテナー ランタイム チェックのエラー: {1}。
ko: 컨테이너 런타임 '{0}'(을)를 찾았지만 비정상인 것 같습니다. 컨테이너 런타임 검사의 오류는 {1}이었습니다.
pl: Znaleziono środowisko uruchomieniowe kontenera „{0}”, ale wygląda na to, że jest w złej kondycji. Błąd podczas sprawdzania środowiska uruchomieniowego kontenera: {1}.
pt_br: O runtime do contêiner '{0}' foi encontrado, mas parece não estar íntegro. O erro da verificação de runtime do contêiner foi {1}.
ru: Обнаружена среда выполнения контейнера "{0}", но, судя по всему, неработоспособная. Ошибка, выданная при проверке среды выполнения контейнера: {1}.
tr: '{0}' kapsayıcı çalışma zamanı bulundu, ancak iyi durumda değil. Kapsayıcı çalışma zamanı denetiminden gelen hata: {1}.
zh_hans: 已找到容器运行时“{0}”，但似乎运行不正常。容器运行时检查中的错误为 {1}。
zh_hant: 找到了容器執行階段 '{0}'，但似乎狀況不良。容器執行階段檢查中的錯誤為 {1}。

# ContainerRuntimeUnresponsiveExceptionMessage
source: Container runtime '{0}' was found but appears to be unresponsive. The command '{0}' did not return after {1} seconds.
cs: Modul runtime kontejneru {0} byl nalezen, ale zdá se, že nereaguje. Příkaz {0} po {1} sekundách nevrátil žádný výsledek.
de: Die Containerruntime "{0}" wurde gefunden, scheint aber nicht zu reagieren. Der Befehl "{0}" wurde nach {1} Sekunden nicht zurückgegeben.
es: Se encontró el runtime de contenedor ''{0}'', pero parece que no responde. El comando ''{0}'' no se devolvió después de {1} segundos.
fr: Le runtime de conteneur « {0} » a été trouvé, mais il semble qu’il ne réponde pas. La commande « {0} » n’a pas été retournée après {1} secondes.
it: È stato trovato il runtime del contenitore "{0}", ma non risponde. Il comando "{0}" non ha risposto entro {1} secondi.
ja: コンテナー ランタイム '{0}' が見つかりましたが、応答していないようです。コマンド '{0}' が {1} 秒後に返されませんでした。
ko: 컨테이너 런타임 '{0}'(을)를 찾았지만 응답하지 않는 것 같습니다. '{0}' 명령이 {1}초 후에 반환되지 않았습니다.
pl: Znaleziono środowisko uruchomieniowe kontenera „{0}”, ale wygląda na to, że nie odpowiada. Polecenie „{0}” nie zwróciło wyniku po {1} sekundach.
pt_br: O runtime do contêiner '{0}' foi encontrado, mas parece não responder. O comando '{0}' não retornou após {1} segundos.
ru: Среда выполнения контейнера "{0}" обнаружена, но не реагирует. Команда "{0}" не вернула управление по истечении {1} секунд.
tr: '{0}' Kapsayıcı çalışma zamanı bulundu ancak yanıt vermiyor. '{0}' komutu {1} saniye sonra döndürülemedi.
zh_hans: 已找到容器运行时“{0}”，但似乎没有响应。命令“{0}”在 {1} 秒后未返回。
zh_hant: 已找到容器執行階段 '{0}'，但似乎無回應。命令 '{0}' 在 {1} 秒後未傳回。

# DcpDependencyCheckFailedMessage
source: Application orchestrator dependency check had an unexpected error {0}.
cs: Při kontrole závislosti orchestrátoru aplikace došlo k neočekávané chybě {0}.
de: Bei der Abhängigkeitsprüfung des Anwendungsorchestrators ist ein unerwarteter Fehler aufgetreten: {0}.
es: La comprobación de dependencia del orquestador de aplicación tuvo un error inesperado {0}.
fr: La vérification de dépendance de l’orchestrateur d’application a rencontré une erreur inattendue {0}.
it: Si è verificato un errore imprevisto durante il controllo delle dipendenze dell'agente di orchestrazione dell'applicazione: {0}.
ja: アプリケーション オーケストレーターの依存関係チェックで予期しないエラー {0} が発生しました。
ko: 응용 프로그램 오케스트레이터 종속성 검사에서 예기치 않은 오류 {0}(이)가 발생했습니다.
pl: Podczas sprawdzania zależności orkiestratora aplikacji wystąpił nieoczekiwany błąd {0}.
pt_br: A verificação de dependência do orquestrador de aplicativos teve um erro inesperado {0}.
ru: Проверка зависимости оркестратора приложений вернула непредвиденную ошибку {0}.
tr: Uygulama düzenleyicisi bağımlılık denetiminde beklenmeyen bir hata oluştu {0}.
zh_hans: 应用程序业务流程协调程序依赖项检查遇到意外错误 {0}。
zh_hant: 應用程式協調器相依性檢查出現未預期的錯誤 {0}。

# DcpVersionCheckFailedMessage
source: The application orchestrator version could not be determined. Continuing.
cs: Nebylo možné určit verzi orchestrátoru aplikace. Pokračuje se ve zpracování.
de: Die Version des Anwendungsorchestrators konnte nicht bestimmt werden. Vorgang wird fortgesetzt.
es: No se pudo determinar la versión del orquestador de aplicación. Continuando.
fr: Désolé... Nous n’avons pas pu déterminer la version de l’orchestrateur d’application. Toujours en cours.
it: Non è stato possibile determinare la versione dell'agente di orchestrazione dell'applicazione. Continua.
ja: アプリケーション オーケストレーターのバージョンを特定できませんでした。継続中。
ko: 애플리케이션 오케스트레이터 버전을 확인할 수 없습니다. 계속.
pl: Nie można określić wersji orkiestratora aplikacji. Trwa kontynuowanie.
pt_br: Não foi possível determinar a versão do orquestrador de aplicativos. Continuando.
ru: Не удалось определить версию оркестратора приложений. Продолжаем работу.
tr: Uygulama düzenleyicisi sürümü belirlenemedi. Devam ediyor.
zh_hans: 无法确定应用程序业务流程协调程序版本。正在继续。
zh_hant: 無法確定應用程式協調器版本。繼續。

# DcpVersionCheckTooHighMessage
source: Found incompatible version of .NET Aspire workload (need application orchestrator version {0} to run the application).
cs: Byla nalezena nekompatibilní verze úlohy .NET Aspire (ke spuštění aplikace je potřeba orchestrátor aplikace ve verzi {0}).
de: Es wurde eine inkompatible Version der Workload ".NET Aspire" gefunden (für die Ausführung der Anwendung ist die Orchestratorversion {0} erforderlich).
es: Se encontró una versión incompatible de la carga de trabajo de .NET Aspire (se necesita la versión {0} del orquestador de aplicación para ejecutar la aplicación).
fr: Version incompatible trouvée de la charge de travail .NET Aspire (vous devez avoir une version d’orchestrateur d’application {0} pour exécuter l’application).
it: È stata trovata una versione incompatibile del carico di lavoro di .NET Aspire (per eseguire l'applicazione, è necessaria la versione {0} dell'agente di orchestrazione corrispondente).
ja: 互換性のないバージョンの .NET Aspire ワークロードが見つかりました (アプリケーションを実行するには、アプリケーション オーケストレーターバージョン {0} が必要です)。
ko: 호환되지 않는 버전의 .NET Aspire 워크로드를 찾았습니다(애플리케이션을 실행하려면 애플리케이션 오케스트레이터 버전 {0}(이)가 필요).
pl: Znaleziono niezgodną wersję obciążenia programu .NET — Aspire (do uruchomienia aplikacji potrzebna jest wersja orkiestratora aplikacji {0}).
pt_br: Versão incompatível encontrada da carga de trabalho do .NET Aspire (é preciso a versão {0} do orquestrador de aplicativos para executar o aplicativo).
ru: Обнаружена несовместимая версия рабочей нагрузки .NET Aspire (для запуска приложения необходим оркестратор приложений версии {0}).
tr: .NET Aspire iş yükünün uyumsuz bir sürümü bulundu (uygulamayı çalıştırmak için {0} uygulama düzenleyicisi sürümü gereklidir).
zh_hans: 发现 .NET Aspire 工作负载的版本不兼容(需要应用程序业务流程协调程序版本 {0} 才能运行应用程序)。
zh_hant: 發現不相容的 .NET Aspire 工作負載的版本 (需要應用程式協調器版本 {0} 才能執行應用程式)。

# DcpVersionCheckTooLowMessage
source: Newer version of .NET Aspire workload is required to run the application. Run 'dotnet workload update' to get it.
cs: Ke spuštění aplikace se vyžaduje novější verze úlohy .NET Aspire. Pokud ji chcete získat, spusťte příkaz dotnet workload update.
de: Zum Ausführen der Anwendung ist eine neuere Version der Workload ".NET Aspire" erforderlich. Führen Sie "dotnet workload update" aus, um es abzurufen.
es: Se requiere una versión más reciente de la carga de trabajo de .NET Aspire para ejecutar la aplicación. Ejecute "dotnet workload update" para obtenerla.
fr: Une version plus récente de la charge de travail .NET Aspire est nécessaire pour exécuter l’application. Exécutez « dotnet workload update » pour l’obtenir.
it: Per eseguire l'applicazione, è necessaria una versione più recente del carico di lavoro di .NET Aspire. Per ottenerla, esegui "aggiornamento del carico di lavoro dotnet".
ja: アプリケーションを実行するには、新しいバージョンの .NET Aspire ワークロードが必要です。'dotnet workload update' を実行して取得します。
ko: 애플리케이션을 실행하려면 최신 버전의 .NET Aspire 워크로드가 필요합니다. 'dotnet 워크로드 업데이트'를 실행하여 가져옵니다.
pl: Do uruchomienia aplikacji jest wymagana nowsza wersja obciążenia programu .NET — Aspire. Uruchom polecenie „dotnet workload update”, aby ją pobrać.
pt_br: A versão mais recente da carga de trabalho .NET Aspire é necessária para executar o aplicativo. Execute 'dotnet workload update' para obtê-la.
ru: Для запуска приложения требуется более новая версия рабочей нагрузки .NET Aspire. Чтобы получить ее, используйте команду "dotnet workload update".
tr: Uygulamayı çalıştırmak için .NET Aspire iş yükünün daha yeni bir sürümü gereklidir. Almak için 'dotnet iş yükü güncelleştirmesini' çalıştırın.
zh_hans: 运行应用程序需要较新版本的 .NET Aspire 工作负载。运行“dotnet 工作负载更新”以获取它。
zh_hant: 執行應用程式需要較新版本的 .NET Aspire 工作負載。執行 'dotnet workload update' 以取得它。

# LaunchProfileIsSpecifiedButLaunchSettingsFileIsNotPresentExceptionMessage
source: Launch profile is specified but launch settings file is not present.
cs: Profil spuštění je zadán, ale soubor nastavení pro spuštění není k dispozici.
de: Das Startprofil wurde angegeben, aber die Starteinstellungsdatei ist nicht vorhanden.
es: Se especificó el perfil de inicio, pero el archivo de configuración de inicio no está presente.
fr: Le profil de lancement est spécifié, mais le fichier des paramètres de lancement n’est pas présent.
it: Il profilo di avvio è specificato, ma il file delle impostazioni di avvio non è presente.
ja: 起動プロファイルが指定されていますが、起動設定ファイルが存在しません。
ko: 시작 프로필이 지정되었지만 시작 설정 파일이 없습니다.
pl: Określono profil uruchamiania, ale plik ustawień uruchamiania nie istnieje.
pt_br: O perfil de inicialização foi especificado, mas o arquivo de configurações de inicialização não está presente.
ru: Профиль запуска указан, но файл параметров запуска отсутствует.
tr: Başlatma profili belirtildi, ancak başlatma ayarları dosyası yok.
zh_hans: 已指定启动配置文件，但启动设置文件不存在。
zh_hant: 已指定啟動設定檔，但啟動設定檔案不存在。

# LaunchSettingsFileDoesNotContainProfileExceptionMessage
source: Launch settings file does not contain '{0}' profile.
cs: Soubor nastavení pro spuštění neobsahuje profil {0}.
de: Die Starteinstellungsdatei enthält nicht das Profil "{0}".
es: El archivo de configuración de inicio no contiene el perfil ''{0}''.
fr: Le fichier de paramètres de lancement ne contient pas le profil « {0} ».
it: Il file delle impostazioni di avvio non contiene il profilo "{0}".
ja: 起動設定ファイルに '{0}' プロファイルが含まれていません。
ko: 시작 설정 파일에 '{0}' 프로필이 없습니다.
pl: Plik ustawień uruchamiania nie zawiera profilu „{0}”.
pt_br: O arquivo de configurações de inicialização não contém o perfil '{0}'.
ru: Файл параметров запуска не содержит профиля "{0}".
tr: Başlatma ayarları dosyası '{0}' profilini içermiyor.
zh_hans: 启动设置文件不包含“{0}”配置文件。
zh_hant: 啟動設定檔案不包含 '{0}' 設定檔。

# ProjectDoesNotContainMetadataExceptionMessage
source: Project does not contain project metadata.
cs: Projekt neobsahuje metadata projektu.
de: Das Projekt enthält keine Projektmetadaten.
es: El proyecto no contiene metadatos de proyecto.
fr: Le projet ne contient aucune métadonnée de projet.
it: Il progetto non contiene metadati del progetto.
ja: プロジェクトにプロジェクト メタデータが含まれていません。
ko: 프로젝트에 프로젝트 메타데이터가 없습니다.
pl: Projekt nie zawiera metadanych projektu.
pt_br: O projeto não contém metadados do projeto.
ru: Проект не содержит метаданных проекта.
tr: Proje, proje meta verilerini içermiyor.
zh_hans: 项目不包含项目元数据。
zh_hant: 專案不包含專案中繼資料。

# ProjectFileNotFoundExceptionMessage
source: Project file '{0}' was not found.
cs: Soubor projektu {0} nebyl nalezen.
de: Die Projektdatei "{0}" wurde nicht gefunden.
es: No se encontró el archivo de proyecto "{0}".
fr: Le fichier du projet « {0} » est introuvable.
it: File di progetto "{0}" non trovato.
ja: プロジェクト ファイル '{0}' が見つかりませんでした。
ko: 프로젝트 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie znaleziono pliku projektu „{0}”.
pt_br: O arquivo de projeto '{0}' não foi encontrado.
ru: Файл проекта "{0}" не найден.
tr: '{0}' proje dosyası bulunamadı.
zh_hans: 找不到项目文件“{0}”。
zh_hant: 找不到專案檔 '{0}'。
