Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/AddCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# AddingAspireIntegration
source: Adding Aspire hosting integration...
cs: Přidává se integrace hostování Aspire...
zh_hant: 正在新增 Aspire 主機整合...

# Description
source: Add a hosting integration to the apphost.
cs: Přidejte hostující integraci do hostitele aplikace.
zh_hant: 將主機整合新增到 AppHost。

# ErrorOccurredWhileAddingPackage
source: An error occurred while adding the package: {0}
cs: Při přidávání balíčku došlo k chybě: {0}
de: Fehler beim Hinzufügen des Pakets: {0}
es: Se produjo un error al agregar el paquete: {0}
fr: Une erreur s’est produite durant l’ajout du package : {0}
it: Errore durante l'aggiunta del pacchetto: {0}
ja: パッケージの追加中にエラーが発生しました: {0}
ko: 패키지를 추가하는 동안 오류가 발생했습니다({0}).
pl: Wystąpił błąd podczas dodawania pakietu: {0}
pt_br: Ocorreu um erro ao adicionar o pacote: {0}
tr: {0} paketi eklenirken bir hata oluştu
zh_hans: 添加包时出错: {0}
zh_hant: 新增套件時發生錯誤: {0}

# IntegrationArgumentDescription
source: The name of the integration to add (e.g. redis, postgres).
cs: Název integrace, která se má přidat (např. redis, postgres).
de: Der Name der Integration, die Sie hinzufügen möchten (z. B. redis, postgres).
es: El nombre de la integración que se va a agregar (por ejemplo, redis, postgres).
fr: Nom de l’intégration à ajouter (par exemple, redis, postgres).
it: Nome dell'integrazione da aggiungere, (ad esempio redis, postgres).
ja: 追加する統合の名前 (例: redis、postgres)。
ko: 추가할 통합의 이름(예: redis, postgres)입니다.
pl: Nazwa integracji do dodania (np. redis, postgres).
pt_br: O nome da integração a ser adicionada (por exemplo, redis, postgres).
tr: Eklenecek tümleştirmenin adı (ör. redis, postgres).
zh_hans: 要添加的集成的名称(例如 redis、postgres)。
zh_hant: 要新增的整合名稱 (例如 redis、postgres)。

# NoIntegrationPackagesFound
source: No integration packages were found. Please check your internet connection or NuGet source configuration.
cs: Nenašly se žádné integrační balíčky. Zkontrolujte prosím připojení k internetu nebo zdrojovou konfiguraci NuGet.
de: Es wurden keine Integrationspakete gefunden. Überprüfen Sie Ihre Internetverbindung oder NuGet-Quellkonfiguration.
es: No se encontraron paquetes de integración. Compruebe la conexión a Internet o la configuración de origen de NuGet.
fr: Aucun package d’intégration n’a été trouvé. Veuillez vérifier votre connexion Internet ou la configuration de la source NuGet.
it: Non sono stati trovati pacchetti di integrazione. Controlla la connessione Internet o la configurazione dell'origine NuGet.
ja: 統合パッケージが見つかりませんでした。インターネット接続または NuGet ソース構成を確認してください。
ko: 통합 패키지를 찾을 수 없습니다. 인터넷 연결 또는 NuGet 원본 구성을 확인하세요.
pl: Nie znaleziono pakietów integracji. Sprawdź połączenie internetowe lub konfigurację źródła NuGet.
pt_br: Nenhum pacote de integração foi encontrado. Verifique sua conexão com a internet ou a configuração da fonte NuGet.
tr: Hiçbir tümleştirme paketi bulunamadı. Lütfen internet bağlantınızı veya NuGet kaynak yapılandırmanızı kontrol edin.
zh_hans: 找不到集成包。请检查 Internet 连接或 NuGet 源配置。
zh_hant: 找不到整合套件。請檢查您的網際網路連線或 NuGet 來源設定。

source: No packages found.
cs: Nenašly se žádné balíčky.
de: Keine Pakete gefunden.
es: No se encontraron paquetes.
fr: Packages introuvables.
it: Nessun pacchetto trovato.
ja: パッケージが見つかりませんでした。
ko: 패키지를 찾을 수 없습니다.
pl: Nie odnaleziono pakietów.
pt_br: Nenhum pacote encontrado.
tr: Paket bulunamadı.
zh_hans: 找不到包。
zh_hant: 找不到任何套件。

# NoPackagesMatchedSearchTerm
source: No packages matched your search term '{0}'. Showing all available packages.
cs: Vašemu hledaného termínu {0} neodpovídají žádné balíčky. Zobrazují se všechny dostupné balíčky.
de: Es stimmten keine Pakete mit Ihrem Suchbegriff „{0}“ überein. Alle verfügbaren Pakete werden angezeigt.
es: No se encontraron paquetes que coincidan con el término de búsqueda "{0}". Mostrando todos los paquetes disponibles.
fr: Aucun package ne correspond à votre terme de recherche « {0} ». Affichage de tous les packages disponibles.
it: Nessun pacchetto corrisponde al termine di ricerca '{0}'. Visualizzazione di tutti i pacchetti disponibili.
pl: Żadne pakiety nie pasują do wyszukiwanego terminu „{0}”. Wyświetlanie wszystkich dostępnych pakietów.
tr: '{0}' arama teriminizle eşleşen herhangi bir paket bulunamadı. Kullanılabilir tüm paketler gösteriliyor.
zh_hant: 沒有任何套件符合您搜尋的字詞 '{0}'。顯示所有可用的套件。

# PackageAddedSuccessfully
source: The package {0}::{1} was added successfully.
cs: Balíček {0}::{1} byl úspěšně přidán.
de: Das Paket {0}::{1} wurde erfolgreich hinzugefügt.
es: El paquete {0}::{1} se agregó correctamente.
fr: Le package {0}::{1} a été ajouté avec succès.
it: Caricamento del pacchetto {0}::{1} completato.
ja: パッケージ {0}::{1} が正常に追加されました。
ko: 패키지 {0}::{1}을(를) 추가했습니다.
pl: Pakiet {0}::{1} został pomyślnie dodany.
pt_br: O pacote {0}::{1} foi adicionado com êxito.
tr: {0}::{1} paketi başarıyla eklendi.
zh_hans: 已成功添加包 {0}::{1}。
zh_hant: 已成功新增套件 {0}::{1}。

# PackageInstallationFailed
source: The package installation failed with exit code {0}. See logs at {1}
cs: Instalace balíčku se nezdařila s ukončovacím kódem {0}. Protokoly najdete na {1}
zh_hant: 套件安裝失敗，結束代碼為 {0}。請參閱 {1} 中的記錄

# ProjectArgumentDescription
source: The path to the Aspire AppHost project file to add the integration to.
cs: Cesta k souboru projektu Aspire AppHost, do které se má integrace přidat
zh_hant: 要新增整合的 Aspire AppHost 專案檔路徑。

# SearchingForAspirePackages
source: Searching for Aspire integrations...
cs: Hledají se integrace Aspire...
zh_hant: 正在搜尋 Aspire 整合...

# SelectAVersionOfPackage
source: Select a version of {0}:
cs: Vyberte verzi balíčku {0}:
de: Wählen Sie eine Version von {0} aus:
es: Seleccione una versión de {0}:
fr: Sélectionner une version de {0} :
it: Seleziona una versione di {0}:
ja: {0} のバージョンを選択します:
ko: {0}의 버전 선택:
pl: Wybierz wersję pakietu {0}:
pt_br: Selecione uma versão do {0}:
tr: Bir {0} sürümü seçin:
zh_hans: 选择 {0} 的版本:
zh_hant: 選取 {0} 的版本:

source: Select an integration to add:
cs: Vyberte integraci, která se má přidat:
de: Wählen Sie eine Integration aus, die Sie hinzufügen möchten:
es: Seleccione una integración para agregar:
fr: Sélectionnez une intégration à ajouter :
it: Seleziona un'integrazione da aggiungere:
ja: 追加する統合を選択します:
ko: 추가할 통합 선택:
pl: Wybierz integrację do dodania:
pt_br: Selecione uma integração para adicionar:
tr: Eklemek için bir tümleştirme seçin:
zh_hans: 选择要添加的集成:
zh_hant: 請選取要新增的整合:

# SourceArgumentDescription
source: The NuGet source to use for the integration.
cs: Zdroj NuGet, který se má použít pro integraci
de: Die NuGet-Quelle, die für die Integration verwendet werden soll.
es: El origen de NuGet que se utilizará para la integración.
fr: Source NuGet à utiliser pour l’intégration.
it: Origine NuGet da usare per l'integrazione.
ja: 統合に使用する NuGet ソース。
ko: 통합에 사용할 NuGet 원본입니다.
pl: Źródło NuGet do użycia na potrzeby integracji.
pt_br: A fonte do NuGet a ser usada para a integração.
tr: Tümleştirme için kullanılacak NuGet kaynağı.
zh_hans: 用于集成的 NuGet 源。
zh_hant: 用於整合的 NuGet 來源。

# StoppedRunningInstance
source: Stopped a running Aspire AppHost instance to allow package modification.
cs: Zastavila se spuštěná instance Aspire AppHost, aby se povolila úprava balíčku.
zh_hant: 已停止執行中的 Aspire AppHost 執行個體，以便修改套件。

# UnableToStopRunningInstances
source: Unable to stop one or more running Aspire AppHost instances. Please stop the application and try again.
cs: Nepodařilo se zastavit jednu nebo více spuštěných instancí Aspire AppHost. Zastavte prosím aplikaci a zkuste to znovu.
zh_hant: 無法停止一個或多個正在執行的 Aspire AppHost 執行個體。請先停止應用程式，然後再試一次。

source: Unexpected number of packages found.
cs: Byl nalezen neočekávaný počet balíčků.
de: Unerwartete Anzahl gefundener Pakete.
es: Se encontró un número inesperado de paquetes.
fr: Nombre inattendu de packages trouvés.
it: È stato trovato un numero imprevisto di pacchetti.
ja: 予期しない数のパッケージが見つかりました。
ko: 예기치 않은 수의 패키지를 발견했습니다.
pl: Znaleziono nieoczekiwaną liczbę pakietów.
pt_br: Número inesperado de pacotes encontrados.
tr: Beklenmeyen sayıda paket bulundu.
zh_hans: 找到意外数量的包。
zh_hant: 找到意外的套件數量。

source: Use pre-release packages
cs: Použít balíčky v předběžné verzi
tr: Ön sürüm paketlerini kullanın
zh_hant: 使用發行前版本的套件

# VersionArgumentDescription
source: The version of the integration to add.
cs: Verze integrace, která se má přidat
de: Die Version der Integration, die Sie hinzufügen möchten.
es: La versión de la integración que se va a agregar.
fr: Version de l’intégration à ajouter.
it: Versione dell'integrazione da aggiungere.
ja: 追加する統合のバージョン。
ko: 추가할 통합의 버전입니다.
pl: Wersja integracji do dodania.
pt_br: A versão da integração a ser adicionada.
tr: Eklenecek tümleştirmenin sürümü.
zh_hans: 要添加的集成的版本。
zh_hant: 要新增的整合版本。

source: Adding Aspire integration...
de: Aspire-Integration wird hinzugefügt...
es: Agregando integración de Aspire...
fr: Ajout de l’intégration Aspire...
it: Aggiunta dell'integrazione di Aspire in corso...
ja: Aspire 統合を追加しています...
ko: Aspire 통합을 추가하는 중...
pl: Trwa dodawanie integracji platformy Aspire...
pt_br: Adicionando integração Aspire...
tr: Aspire tümleştirmesi ekleniyor...
zh_hans: 正在添加 Aspire 集成...

# Description
source: Add an integration to the Aspire project.
de: Fügen Sie dem Aspire-Projekt eine Integration hinzu.
es: Agregue una integración al proyecto de Aspire.
fr: Ajoutez une intégration au projet Aspire.
it: Aggiungi un'integrazione al progetto Aspire.
ja: Aspire プロジェクトに統合を追加します。
ko: Aspire 프로젝트에 통합을 추가하세요.
pl: Dodaj integrację do projektu platformy Aspire.
pt_br: Adicionar uma integração ao projeto Aspire.
tr: Aspire projesine bir tümleştirme ekleyin.
zh_hans: 将集成添加到 Aspire 项目。

# PackageInstallationFailed
source: The package installation failed with exit code {0}. For more information run with --debug switch.
de: Fehler bei der Paketinstallation. Exitcode: {0}. Weitere Informationen erhalten Sie, wenn Sie mit dem Schalter „--debug“ ausführen.
es: La instalación del paquete falló con el código de salida {0}. Para obtener más información, ejecute con el modificador --debug.
fr: L’installation du package a échoué avec le code de sortie {0}. Pour plus d’informations, exécutez avec le commutateur --debug.
it: L'installazione del pacchetto non è riuscita con codice di uscita {0}. Per altre informazioni, eseguire con l'opzione --debug.
ja: パッケージのインストールが終了コード {0} で失敗しました。詳細情報については、--debug スイッチを使用し実行してください。
ko: 패키지 설치에 실패했습니다(종료 코드: {0}). 자세한 내용을 보려면 --debug 스위치를 이용하여 실행하세요.
pl: Instalacja pakietu nie powiodła się z kodem zakończenia {0}. Aby uzyskać więcej informacji, uruchom polecenie przełącznika --debug.
pt_br: A instalação do pacote falhou com o código de saída {0}. Para mais informações, execute com a opção --debug.
tr: Paket yüklemesi {0} çıkış koduyla başarısız oldu. Daha fazla bilgi için --debug anahtarıyla çalıştırın.
zh_hans: 包安装失败，退出代码为 {0}。有关详细信息，请使用 --debug 开关运行。

# ProjectArgumentDescription
source: The path to the project file to add the integration to.
de: Der Pfad zur Projektdatei, der die Integration hinzugefügt werden soll.
es: La ruta al archivo del proyecto al que se agregará la integración.
fr: Chemin du fichier projet auquel ajouter l’intégration.
it: Percorso del file di progetto a cui aggiungere l'integrazione.
ja: 統合を追加するプロジェクト ファイルへのパス。
ko: 통합을 추가할 프로젝트 파일의 경로입니다.
pl: Ścieżka do pliku projektu, do którego ma zostać dodana integracja.
pt_br: O caminho para o arquivo de projeto ao qual adicionar a integração.
tr: Tümleştirmenin ekleneceği proje dosyasının yolu.
zh_hans: 要将集成添加到的项目文件的路径。

source: Searching for Aspire packages...
de: Es wird nach Aspire-Paketen gesucht...
es: Buscando paquetes de Aspire...
fr: Recherche de packages Aspire...
it: Ricerca dei pacchetti Aspire in corso...
ja: Aspire パッケージを検索しています...
ko: Aspire 패키지를 검색하는 중...
pl: Trwa wyszukiwanie pakietów platformy Aspire...
pt_br: Procurando por pacotes Aspire...
tr: Aspire paketleri aranıyor...
zh_hans: 正在搜索 Aspire 包...
