Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/AgentCommandStrings.*.xlf
Languages: it, zh_hant

# ConfigUpdatesSelectPrompt
source: The following agent configurations use the deprecated 'mcp start' command. Update them?
it: Le configurazioni agente seguenti usano il comando 'mcp start' deprecato. Aggiornare ora?
zh_hant: 以下代理程式設定使用已棄用的 'mcp start' 命令。更新它們?

# DeprecatedConfigFix
source: Run 'aspire agent init' to update configuration
it: Eseguire 'aspire agent init' per aggiornare la configurazione
zh_hant: 執行 'aspire agent init' 以更新設定

# DeprecatedConfigUpdate_Description
source: Update {0} config to use new 'agent mcp' command
it: Aggiornare la configurazione {0} in modo che usi il nuovo comando 'agent mcp'
zh_hant: 更新 {0} 設定以使用新的 'agent mcp' 命令

# DeprecatedConfigWarning
source: {0} config uses deprecated 'mcp start' command
it: La configurazione {0} usa il comando 'mcp start' deprecato
zh_hant: {0} 設定使用已淘汰的 'mcp start' 命令

# Description
source: Manage AI agent specific setup.
it: Gestire la configurazione specifica dell'agente IA.
zh_hant: 管理 AI Agent 的特定設定。

# InitCommand_Description
source: Initialize agent environment configuration for detected agents.
it: Consente di inizializzare la configurazione dell'ambiente agente per gli agenti rilevati.
zh_hant: 為偵測到的代理程式初始化代理程式環境設定。

# MalformedConfigFileError
source: The configuration file '{0}' contains malformed JSON. Please fix the file manually and re-run the command.
it: Il file di configurazione "{0}" contiene un JSON non valido. Correggere il file manualmente ed eseguire di nuovo il comando.
zh_hant: 設定檔 '{0}' 包含格式錯誤的 JSON。請手動修正檔案，然後重新執行命令。

# McpCommand_Description
source: Start the MCP (Model Context Protocol) server.
it: Avviare il server MCP (Model Context Protocol).
zh_hant: 啟動 MCP (模型內容通訊協定) 伺服器。

# SkippedMalformedConfigFile
source: Skipping update of '{0}'.
it: Ignorato l'aggiornamento di "{0}".
zh_hant: 正在略過 '{0}' 的更新。

# ConfigurationCompletedWithErrors
source: Configuration completed with errors. Please fix the reported issues and re-run the command.
it: Configurazione completata con errori. Correggere i problemi segnalati ed eseguire di nuovo il comando.
zh_hant: 已完成設定，但發生錯誤。請修正報告的問題，然後重新執行命令。
