Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/ConfigCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AvailableFeaturesHeader
source: Available features
cs: Dostupné funkce
de: Verfügbare Features
es: Características disponibles
fr: Fonctionnalités disponibles
ko: 사용 가능한 기능
pl: Dostępne funkcje
ru: Доступные функции
zh_hans: 可用的功能
zh_hant: 可用功能

# ConfigurationKeyDeletedGlobally
source: Configuration '{0}' deleted globally.
cs: Konfigurace {0} byla odstraněna globálně.
de: Die Konfiguration „{0}“ wurde global gelöscht.
es: La configuración "{0}" se eliminó globalmente.
fr: La configuration « {0} » a été supprimée globalement.
it: La configurazione '{0}' è stata eliminata a livello globale.
ja: 構成 '{0}' がグローバルに削除されました。
ko: 구성 '{0}'을(를) 전역에서 삭제했습니다.
pl: Konfiguracja „{0}” została usunięta globalnie.
pt_br: A configuração "{0}" foi excluída globalmente.
ru: Конфигурация "{0}" удалена глобально.
tr: '{0}' yapılandırması her yerden silindi.
zh_hans: 已在全局范围内删除配置 ‘{0}’。
zh_hant: 已全域刪除設定 '{0}'。

# ConfigurationKeyDeletedLocally
source: Configuration '{0}' deleted locally.
cs: Konfigurace {0} byla odstraněna místně.
de: Die Konfiguration „{0}“ wurde lokal gelöscht.
es: La configuración "{0}" se eliminó localmente.
fr: La configuration « {0} » a été supprimée localement.
it: La configurazione '{0}' è stata eliminata a livello locale.
ja: 構成 '{0}' がローカルで削除されました。
ko: 구성 '{0}'을(를) 로컬에서 삭제했습니다.
pl: Konfiguracja „{0}” została usunięta lokalnie.
pt_br: A configuração "{0}" foi excluída localmente.
ru: Конфигурация "{0}" удалена локально.
tr: '{0}' yapılandırması yerel olarak silindi.
zh_hans: 已在本地删除配置 ‘{0}’。
zh_hant: 已本機刪除設定 '{0}'。

# ConfigurationKeySetGlobally
source: Configuration '{0}' set to '{1}' globally.
cs: Konfigurace {0} je globálně nastavená na {1}.
de: Die Konfiguration „{0}“ ist global auf „{1}“ festgelegt.
es: Configuración "{0}" establecida en "{1}" globalmente.
fr: Configuration « {0} » définie sur « {1} » globalement.
it: La configurazione '{0}' è impostata su '{1}' a livello globale.
ja: 構成 '{0}' がグローバルに '{1}' に設定されました。
ko: 구성 '{0}'을(를) 전역에서 '{1}'(으)로 설정했습니다.
pl: Konfiguracja „{0}” ustawiona globalnie jako „{1}”.
pt_br: A configuração "{0}" foi definida como "{1}" globalmente.
ru: Конфигурация "{0}" установлена в значение "{1}" глобально.
tr: '{0}' yapılandırması her yerde '{1}' olarak ayarlandı.
zh_hans: 已在全局范围内将配置 ‘{0}’ 设置为 ‘{1}’。
zh_hant: 設定 '{0}' 已在全域設定為 '{1}'。

# ConfigurationKeySetLocally
source: Configuration '{0}' set to '{1}' locally.
cs: Konfigurace {0} byla nastavená místně na {1}.
de: Die Konfiguration „{0}“ ist lokal auf „{1}“ festgelegt.
es: Configuración "{0}" establecida en "{1}" localmente.
fr: Configuration « {0} » définie sur « {1} » localement.
it: Configurazione '{0}' impostata su '{1}' a livello locale.
ja: 構成 '{0}' がローカルで '{1}' に設定されました。
ko: 구성 '{0}'을(를) 로컬에서 '{1}'(으)로 설정했습니다.
pl: Konfiguracja „{0}” jest ustawiona lokalnie jako „{1}”.
pt_br: A configuração "{0}" foi definida como "{1}" localmente.
ru: Конфигурация "{0}" установлена в значение "{1}" локально.
tr: '{0}' yapılandırması yerel olarak '{1}' olarak ayarlandı.
zh_hans: 已在本地将配置 ‘{0}’ 设置为 ‘{1}’。
zh_hant: 設定 '{0}' 已在本機設定為 '{1}'。

# DeleteCommand_Description
source: Delete a configuration value.
cs: Umožňuje odstranit hodnotu konfigurace.
de: Löschen Sie einen Konfigurationswert.
es: Elimina un valor de configuración.
fr: Supprimez une valeur de configuration.
it: Elimina un valore di configurazione.
ja: 構成値を削除します。
ko: 구성 값을 삭제합니다.
pl: Usuń wartość konfiguracji.
pt_br: Exclua um valor de configuração.
ru: Удаляет значение конфигурации.
tr: Bir yapılandırma değerini silin.
zh_hans: 删除配置值。
zh_hant: 刪除設定值。

# DeleteCommand_GlobalArgumentDescription
source: Delete the configuration value from the global $HOME/.aspire/settings.json instead of the local settings file.
cs: Odstraňte hodnotu konfigurace z globálního souboru $HOME/.aspire/settings.json místo z místního souboru nastavení.
de: Löschen Sie den Konfigurationswert aus der globalen „$HOME/.aspire/settings.json“ anstelle der lokalen Einstellungsdatei.
es: Elimina el valor de configuración del $HOME global/.pm/settings.json en lugar del archivo de configuración local.
fr: Définissez la valeur de la configuration à partir de $HOME/.aspire/settings.json global au lieu du fichier de paramètres régionaux.
it: Elimina il valore di configurazione dal file globale $HOME/.fqd/settings.json anziché dal file di impostazioni locali.
ja: ローカル設定ファイルではなく、グローバルの $HOME/.aspire/settings.json から構成値を削除します。
ko: 로컬 설정 파일 대신 전역 $HOME/.log/settings.json의 구성 값을 삭제합니다.
pl: Usuń wartość konfiguracji z globalnego pliku $HOME/.settings.json zamiast z pliku ustawień lokalnych.
pt_br: Exclua o valor de configuração do arquivo global $HOME/.aspire/settings.json em vez do arquivo de configurações local.
ru: Удаляет значение конфигурации из глобального файла $HOME/.aspire/settings.json вместо локального файла настроек.
tr: Yapılandırma değerini, yerel ayarlar dosyası yerine global $HOME/.aspire/settings.json dosyasından silin.
zh_hans: 从全局 $HOME/.aspire/settings.json 而不是本地设置文件中删除配置值。
zh_hant: 在 $HOME/.aspire/settings.json 中全域刪除設定值，而非使用本機設定檔案。

# DeleteCommand_KeyArgumentDescription
source: The configuration key to delete.
cs: Konfigurační klíč, který se má odstranit
de: Der zu löschende Konfigurationsschlüssel.
es: Clave de configuración que se va a eliminar.
fr: La clé de configuration à supprimer.
it: Chiave di configurazione da eliminare.
ja: 削除する構成キー。
ko: 삭제할 구성 키입니다.
pl: Klucz konfiguracji do usunięcia.
pt_br: A chave de configuração a ser excluída.
ru: Ключ конфигурации, который следует удалить.
tr: Silinecek yapılandırma anahtarı.
zh_hans: 要删除的配置键。
zh_hant: 要刪除的設定金鑰。

# DeleteCommand_PromptForGlobal
source: Delete the configuration value from the global $HOME/.aspire/settings.json instead of the local settings file?
cs: Chcete hodnotu konfigurace odstranit z globálního souboru $HOME/.aspire/settings.json místo z místního souboru nastavení?
de: Den Konfigurationswert aus der globalen „$HOME/.aspire/settings.json“ anstelle der lokalen Einstellungsdatei löschen?
es: ¿Eliminar el valor de configuración del archivo global $HOME/.aspire/settings.json en lugar del archivo de configuración local?
fr: Voulez-vous définir la valeur de la configuration à partir de $HOME/.aspire/settings.json global au lieu du fichier de paramètres régionaux ?
it: Vuoi eliminare il valore di configurazione dal file globale $HOME/.fqd/settings.json anziché dal file di impostazioni locali?
ja: ローカル設定ファイルではなく、グローバルの $HOME/.aspire/settings.json から構成値を削除しますか?
ko: 로컬 설정 파일 대신 전역 $HOME/.log/settings.json의 구성 값을 삭제하시겠습니까?
pl: Usunąć wartość konfiguracji z globalnego pliku $HOME/.aspire/settings.json zamiast z pliku ustawień lokalnych?
pt_br: Excluir o valor de configuração do arquivo global $HOME/.aspire/settings.json em vez do arquivo de configurações local?
ru: Удалить значение конфигурации из глобального файла $HOME/.aspire/settings.json вместо локального файла настроек?
zh_hans: 是否从全局 $HOME/.aspire/settings.json 而不是本地设置文件中删除配置值?
zh_hant: 是否要在 $HOME/.aspire/settings.json 中全域刪除設定值，而非使用本機設定檔案?

# DeleteCommand_PromptForKey
source: Which config value do you want to delete?
cs: Kterou konfigurační hodnotu chcete odstranit?
de: Welchen Konfigurationswert möchten Sie löschen?
es: ¿Qué valor de configuración quiere eliminar?
fr: Quelle valeur de configuration souhaitez-vous supprimer ?
it: Quale valore di configurazione vuoi eliminare?
ja: どの構成値を削除しますか?
ko: 어떤 구성 값을 삭제하시겠습니까?
pl: Którą wartość konfiguracji chcesz usunąć?
pt_br: Qual valor de configuração você quer excluir?
ru: Какое значение конфигурации нужно удалить?
zh_hans: 你想删除哪个配置值?
zh_hant: 您要刪除哪個設定值?

# Description
source: Manage CLI configuration including feature flags.
de: Verwalten Sie die CLI-Konfiguration einschließlich Featureflags.
es: Administrar las opciones de configuración.
ko: 기능 플래그를 포함한 CLI 구성을 관리합니다.
ru: Управление конфигурацией CLI, включая флаги функций.
zh_hant: 管理組態設定。

# ExtensionActionPrompt
source: What do you want to do?
cs: Co chcete udělat?
de: Wie möchten Sie vorgehen?
es: ¿Qué desea hacer?
fr: Que voulez-vous faire ?
it: Selezionare l'operazione da eseguire.
ja: 実行したい操作は何ですか?
ko: 원하는 작업을 선택하세요.
pl: Co chcesz zrobić?
pt_br: O que você deseja fazer?
ru: Выберите действие
zh_hans: 您希望做什么?
zh_hant: 請您指定選項。

# GetCommand_Description
source: Get a configuration value.
cs: Získá hodnotu konfigurace.
de: Rufen Sie einen Konfigurationswert ab.
es: Obtiene un valor de configuración.
fr: Obtenez une valeur de configuration.
it: Ottieni un valore di configurazione.
ja: 構成値を取得します。
ko: 구성 값을 가져옵니다.
pl: Pobierz wartość konfiguracji.
pt_br: Obtenha um valor de configuração.
ru: Получает значение конфигурации.
tr: Bir yapılandırma değeri getir.
zh_hans: 获取配置值。
zh_hant: 取得設定值。

# GetCommand_KeyArgumentDescription
source: The configuration key to retrieve.
cs: Konfigurační klíč, který se má načíst
de: Der abzurufende Konfigurationsschlüssel.
es: La clave de configuración que se va a recuperar.
fr: La clé de configuration à récupérer.
it: Chiave di configurazione da recuperare.
ja: 取得する構成キー。
ko: 검색할 구성 키입니다.
pl: Klucz konfiguracji do pobrania.
pt_br: A chave de configuração a ser recuperada.
ru: Ключ конфигурации, который следует получить.
tr: Getirilecek yapılandırma anahtarı.
zh_hans: 要检索的配置键。
zh_hant: 要擷取的設定金鑰。

# GetCommand_PromptForKey
source: Which configuration key do you want to retrieve?
cs: Jaký konfigurační klíč chcete načíst?
de: Welchen Konfigurationsschlüssel möchten Sie abrufen?
es: ¿Qué clave de configuración quiere recuperar?
fr: Quelle clé de configuration souhaitez-vous récupérer ?
it: Quale chiave di configurazione vuoi recuperare?
ja: どの構成キーを取得しますか?
ko: 어떤 구성 키를 검색하시겠습니까?
pl: Który klucz konfiguracji chcesz pobrać?
pt_br: Qual chave de configuração você quer recuperar?
ru: Какой ключ конфигурации нужно получить?
zh_hans: 你想检索哪个配置键?
zh_hant: 您要擷取哪個設定金鑰?

# GlobalConfigurationHeader
source: Global configuration
cs: Globální konfigurace
de: Globale Konfiguration
es: Configuración global
fr: Configuration globale
ko: 전역 구성
pl: Konfiguracja globalna
ru: Глобальная конфигурация
zh_hans: 全局配置
zh_hant: 全域設定

# InfoCommand_AvailableFeatures
source: Available features
cs: Dostupné funkce
de: Verfügbare Features
es: Características disponibles
fr: Fonctionnalités disponibles
ko: 사용 가능한 기능
pl: Dostępne funkcje
ru: Доступные функции
zh_hant: 可用功能

# InfoCommand_Description
source: Display configuration file paths and available features.
cs: Umožňuje zobrazit cesty ke konfiguračním souborům a dostupné funkce.
de: Konfigurationsdateipfade und verfügbare Funktionen anzeigen.
es: Muestra las rutas de acceso del archivo de configuración y las características disponibles.
fr: Afficher les chemins des fichiers de configuration et les fonctionnalités disponibles.
ko: 구성 파일 경로 및 사용 가능한 기능을 표시합니다.
pl: Pokaż ścieżki plików konfiguracyjnych i dostępne funkcje.
ru: Отобразить пути к файлам конфигурации и доступные функции.
zh_hant: 顯示設定檔路徑和可用功能。

# InfoCommand_GlobalSettingsPath
source: Global settings path
cs: Cesta ke globálnímu nastavení
de: Pfad für globale Einstellungen
es: Ruta de acceso de configuración global
fr: Chemin des paramètres globaux
ko: 전역 설정 경로
pl: Ścieżka ustawień globalnych
ru: Путь к глобальным параметрам
zh_hant: 全域設定路徑

# InfoCommand_JsonOptionDescription
source: Output information in JSON format.
cs: Výstup informací ve formátu JSON.
de: Informationen im JSON-Format ausgeben.
es: Información de salida en formato JSON.
fr: Afficher les informations au format JSON.
ko: JSON 형식으로 정보를 출력합니다.
pl: Wyświetl informacje w formacie JSON.
ru: Вывод информации в формате JSON.
zh_hant: 以 JSON 格式輸出資訊。

# InfoCommand_LocalSettingsPath
source: Local settings path
cs: Cestu k místnímu nastavení
de: Pfad für lokale Einstellungen
es: Ruta de acceso de configuración local
fr: Chemin d’accès aux paramètres locaux
ko: 로컬 설정 경로
pl: Ścieżka ustawień lokalnych
ru: Путь к локальным параметрам
zh_hant: 本機設定路徑

# InfoCommand_SettingsProperties
source: Settings file properties
cs: Vlastnosti souboru nastavení
de: Eigenschaften der Einstellungsdatei
es: Propiedades del archivo de configuración
fr: Propriétés du fichier de paramètres
ko: 설정 파일 속성
pl: Właściwości pliku ustawień
ru: Свойства файла параметров
zh_hant: 設定檔案屬性

# ListCommand_Description
source: List all configuration values.
cs: Umožňuje vypsat všechny hodnoty konfigurace.
de: Listen Sie alle Konfigurationswerte auf.
es: Enumera todos los valores de configuración.
fr: Répertoriez toutes les valeurs de configuration.
it: Elenca tutti i valori di configurazione.
ja: すべての構成値を一覧表示します。
ko: 모든 구성 값을 나열합니다.
pl: Wyświetl listę wszystkich wartości konfiguracji.
pt_br: Liste todos os valores de configuração.
ru: Перечислить все значения конфигурации.
tr: Tüm yapılandırma değerlerini listeleyin.
zh_hans: 列出所有配置值。
zh_hant: 列出所有設定值。

# LocalConfigurationHeader
source: Local configuration
cs: Místní konfigurace
de: Lokale Konfiguration
es: Configuración local
fr: Configuration locale
ko: 로컬 구성
pl: Konfiguracja lokalna
ru: Локальная конфигурация
zh_hans: 本地配置
zh_hant: 本機設定

source: No configuration values found.
cs: Nenašly se žádné hodnoty konfigurace.
de: Es wurden keine Konfigurationswerte gefunden.
es: No se encontraron valores de configuración.
fr: Aucune valeur de configuration trouvée.
it: Non sono stati trovati valori di configurazione.
ja: 構成値が見つかりません。
ko: 구성 값을 찾을 수 없습니다.
pl: Nie znaleziono wartości konfiguracji.
pt_br: Nenhum valor de configuração encontrado.
ru: Значения конфигурации не найдены.
tr: Yapılandırma değeri bulunamadı.
zh_hans: 找不到配置值。
zh_hant: 找不到設定值。

source: No global configuration found.
cs: Nenašla se žádná globální konfigurace.
de: Keine globale Konfiguration gefunden.
es: No se encontró ninguna configuración global.
fr: Aucune configuration globale trouvée.
ko: 전역 구성을 찾을 수 없습니다.
pl: Nie znaleziono konfiguracji globalnej.
ru: Глобальная конфигурация не найдена.
zh_hans: 未找到全局配置。
zh_hant: 找不到全域設定。

source: No local configuration found.
cs: Nenašla se žádná místní konfigurace.
de: Keine lokale Konfiguration gefunden.
es: No se encontró ninguna configuración local.
fr: Aucune configuration locale trouvée.
ko: 로컬 구성을 찾을 수 없습니다.
pl: Nie znaleziono konfiguracji lokalnej.
ru: Локальная конфигурация не найдена.
zh_hans: 未找到本地配置。
zh_hant: 找不到本機設定。

# SetCommand_Description
source: Set a configuration value.
cs: Nastavte hodnotu konfigurace.
de: Legen Sie einen Konfigurationswert fest.
es: Establece un valor de configuración.
fr: Définissez une valeur de configuration.
it: Imposta un valore di configurazione.
ja: 構成値を設定します。
ko: 구성 값을 설정합니다.
pl: Ustaw wartość konfiguracji.
pt_br: Defina um valor de configuração.
ru: Задает значение конфигурации.
tr: Bir yapılandırma değeri ayarla.
zh_hans: 设置配置值。
zh_hant: 設定設定值。

# SetCommand_GlobalArgumentDescription
source: Set the configuration value globally in $HOME/.aspire/settings.json instead of the local settings file.
cs: Nastavte hodnotu konfigurace globálně v souboru $HOME/.aspire/settings.json místo v místním souboru nastavení.
de: Legen Sie den Konfigurationswert global unter „$HOME/.aspire/settings.json“ anstelle der lokalen Einstellungsdatei fest.
es: Establezca el valor de configuración globalmente en $HOME/.aspire/settings.json en lugar del archivo de configuración local.
fr: Définissez la valeur de configuration globalement dans $HOME/.aspire/settings.json au lieu du fichier de paramètres régionaux.
it: Imposta il valore di configurazione a livello globale in $HOME/.fqd/settings.json anziché nel file di impostazioni locali.
ja: ローカル設定ファイルではなく、$HOME/.aspire/settings.json で構成値をグローバルに設定します。
ko: 로컬 설정 파일 대신 $HOME/.aspire/settings.json에서 전역적으로 구성 값을 설정합니다.
pl: Ustaw wartość konfiguracji globalnie w pliku $HOME/.settings.json zamiast w pliku ustawień lokalnych.
pt_br: Defina o valor de configuração globalmente em $HOME/.aspire/settings.json em vez do arquivo de configurações local.
ru: Устанавливает значение конфигурации глобально в файле $HOME/.aspire/settings.json вместо локального файла настроек.
tr: Yapılandırma değerini global olarak, yerel ayarlar dosyası yerine $HOME/.aspire/settings.json dosyasında ayarlayın.
zh_hans: 在 $HOME/.aspire/settings.json 而不是本地设置文件中全局设置配置值。
zh_hant: 在 $HOME/.aspire/settings.json 中全域設定設定值，而非使用本機設定檔案。

# SetCommand_KeyArgumentDescription
source: The configuration key to set.
cs: Konfigurační klíč, který se má nastavit
de: Der festzulegende Konfigurationsschlüssel.
es: Clave de configuración que se va a establecer.
fr: La clé de configuration à définir.
it: Chiave di configurazione da impostare.
ja: 設定する構成キー。
ko: 설정할 구성 키입니다.
pl: Klucz konfiguracji do ustawienia.
pt_br: A chave de configuração a ser definida.
ru: Ключ конфигурации, для которого следует задать значение.
tr: Ayarlanacak yapılandırma anahtarı.
zh_hans: 要设置的配置键。
zh_hant: 要設定的設定金鑰。

# SetCommand_PromptForGlobal
source: Where do you want to set the configuration value?
cs: Kde chcete nastavit hodnotu konfigurace?
de: Wo möchten Sie den Konfigurationswert festlegen?
es: ¿Dónde quiere establecer el valor de configuración?
fr: Où souhaitez-vous définir la valeur de configuration ?
it: Dove vuoi impostare il valore di configurazione?
ja: どこの構成値を設定しますか?
ko: 구성 값을 어디에 설정하시겠습니까?
pl: Gdzie chcesz ustawić wartość konfiguracji?
pt_br: Onde você quer definir o valor de configuração?
ru: Где нужно настроить значение конфигурации?
zh_hans: 你想在哪里设置配置值?
zh_hant: 您要在哪裡設定設定值？

# SetCommand_PromptForGlobal_GlobalOption
source: Globally ($HOME/.aspire/settings.json)
cs: Globální ($HOME/.aspire/settings.json)
es: Globalmente ($HOME/.aspire/settings.json)
fr: Globalement ($HOME/.aspire/settings.json)
it: A livello globale ($HOME/.aspire/settings.json)
ja: グローバル ($HOME/.aspire/settings.json)
ko: 전역($HOME/.log/settings.json)
pl: Globalnie ($HOME/.aspire/settings.json)
pt_br: Globalmente ($HOME/.aspire/settings.json)
ru: Глобально ($HOME/.aspire/settings.json)
zh_hans: 全局($HOME/.aspire/settings.json)
zh_hant: 全域 ($HOME/.aspire/settings.json)

# SetCommand_PromptForGlobal_LocalOption
source: Locally
cs: Místně
de: Lokal
es: Localmente
fr: Localement
it: A livello locale
ja: ローカル
ko: 로컬로
pl: Lokalnie
pt_br: Localmente
ru: Локально
zh_hans: 本地
zh_hant: 本機

# SetCommand_PromptForKey
source: Which configuration key do you want to set?
cs: Jaký konfigurační klíč chcete nastavit?
de: Welchen Konfigurationsschlüssel möchten Sie festlegen?
es: ¿Qué clave de configuración quiere establecer?
fr: Quelle clé de configuration souhaitez-vous définir ?
it: Quale chiave di configurazione vuoi impostare?
ja: どの構成キーを設定しますか?
ko: 어떤 구성 키를 설정하시겠습니까?
pl: Który klucz konfiguracji chcesz ustawić?
pt_br: Qual chave de configuração você quer definir?
ru: Какой ключ конфигурации нужно задать?
zh_hans: 你想设置哪个配置键?
zh_hant: 您要設定哪個設定金鑰?

# SetCommand_PromptForValue
source: What value do you want to set?
cs: Jakou hodnotu chcete nastavit?
de: Welchen Wert möchten Sie festlegen?
es: ¿Qué valor quiere establecer?
fr: Quelle valeur voulez-vous définir ?
it: Quale valore vuoi impostare?
ja: どの値を設定しますか?
ko: 어떤 값을 설정하시겠습니까?
pl: Którą wartość chcesz ustawić?
pt_br: Qual valor você quer definir?
ru: Какое значение нужно настроить?
zh_hans: 你想设置什么值?
zh_hant: 您想設定什麼值?

# SetCommand_ValueArgumentDescription
source: The configuration value to set.
cs: Hodnota konfigurace, která se má nastavit
de: Der festzulegende Konfigurationswert.
es: Valor de configuración que se va a establecer.
fr: La valeur de configuration à définir.
it: Valore di configurazione da impostare.
ja: 設定する構成値。
ko: 설정할 구성 값입니다.
pl: Wartość konfiguracji do ustawienia.
pt_br: O valor de configuração a ser definido.
ru: Значение конфигурации, которое следует задать.
tr: Ayarlanacak yapılandırma değeri.
zh_hans: 要设置的配置值。
zh_hant: 要設定的設定值。

# SetFeatureHint
source: Use 'aspire config set features.<name> true|false' to enable or disable a feature.
de: Verwenden Sie „aspire config set features.<name> true|false“, um ein Feature zu aktivieren oder zu deaktivieren.
ko: 기능을 활성화하거나 비활성화하려면 'aspire config set features.<name> true|false' 명령을 사용합니다.
ru: Используйте команду "aspire config set features.<name> true|false", чтобы включить или отключить функцию.

# Description
source: Manage configuration settings.
it: Gestisci le impostazioni di configurazione.
ja: 構成設定を管理します。
pt_br: Gerencie as definições de configuração.
tr: Yapılandırma ayarlarını yönetin.
zh_hans: 管理配置设置。
