Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/ConsoleServiceStrings.*.xlf
Languages: tr, zh_hans

# AppHostNotCompatibleConsiderUpgrading
source: The app host is not compatible. Consider upgrading the app host or Aspire CLI.
tr: Uygulama ana işlemi uyumlu değil. Uygulama ana işlemi veya Aspire CLI'yi yükseltmeyi değerlendirin.
zh_hans: 应用主机不兼容。请考虑升级应用主机或 Aspire CLI。

source: Aspire CLI Version
tr: Aspire CLI Sürümü
zh_hans: Aspire CLI 版本

# AspireHostingSDKVersion
source: Aspire.Hosting Version
tr: Aspire.Hosting Sürümü
zh_hans: Aspire.Hosting 版本

source: Building app host...
tr: Uygulama ana işlemi oluşturuluyor...
zh_hans: 正在生成应用主机...

source: Checking certificates...
tr: Sertifikalar denetleniyor...
zh_hans: 正在检查证书...

source: Checking project type...
tr: Proje türü denetleniyor...
zh_hans: 正在检查项目类型...

# CreatedSettingsFile
source: Created settings file at {0}.
tr: Ayarlar dosyası {0} konumunda oluşturuldu.
zh_hans: 已在 {0} 创建设置文件。

source: Dashboard
tr: Pano
zh_hans: 仪表板

# DirectLink
source: Direct
tr: Doğrudan
zh_hans: 直接

# ErrorConnectingToAppHost
source: An error occurred while connecting to the app host. The app host possibly crashed before it was available: {0}.
tr: Uygulama ana işlemiyle bağlantı kurulurken bir hata oluştu. Uygulama ana işlemi, kullanılabilir duruma gelmeden önce muhtemelen çöktü: {0}.
zh_hans: 连接到应用主机时出错。应用主机可能在可用之前发生故障: {0}。

source: Finding app hosts...
tr: Uygulama ana işlemleri bulunuyor...
zh_hans: 正在查找应用主机...

# NoItemsAvailableForSelection
source: No items available for selection: {0}
tr: Seçim için herhangi bir öğe mevcut değil: {0}
zh_hans: 没有可供选择的项目: {0}

# OperationCancelled
source: The operation was canceled.
tr: İşlem iptal edildi.
zh_hans: 该操作已取消。

# ProjectCouldNotBeBuilt
source: The project could not be built. For more information run with --debug switch.
tr: Proje oluşturulamadı. Daha fazla bilgi için --debug anahtarıyla çalıştırın.
zh_hans: 无法生成项目。有关详细信息，请使用 --debug 开关运行。

# ProjectOptionDoesntExist
source: The --project option specified a project that does not exist.
tr: --project seçeneği var olmayan bir projeyi belirtti.
zh_hans: --project 选项指定了不存在的项目。

# ProjectOptionNotSpecifiedMultipleAppHostsFound
source: The --project option was not specified and multiple app host project files were detected.
tr: --project seçeneği belirtilmedi ve birden fazla uygulama ana işlemi projesi dosyası algılandı.
zh_hans: 未指定 --project 选项，并且检测到多个应用主机项目文件。

# ProjectOptionNotSpecifiedNoCsprojFound
source: The project argument was not specified and no *.csproj files were detected.
tr: Proje bağımsız değişkeni belirtilmedi ve herhangi bir *.csproj dosyası algılanmadı.
zh_hans: 未指定项目参数，并且未检测到 *.csproj 文件。

source: Required Capability
tr: Gerekli Yetenek
zh_hans: 所需功能

# SearchingProjects
source: Searching...
tr: Aranıyor...
zh_hans: 正在搜索...

source: Select app host to run
tr: Çalıştırılacak uygulama ana işlemini belirtin
zh_hans: 选择要运行的应用主机

# SpecifiedProjectFileNotAppHostProject
source: The specified project file is not an Aspire app host project.
tr: Belirtilen proje dosyası bir Aspire uygulama ana işlemi projesi değil.
zh_hans: 指定的项目文件不是 Aspire 应用主机项目。

source: Stopping Aspire.
tr: Aspire durduruluyor.
zh_hans: 正在停止 Aspire。

source: Trusting certificates...
tr: Sertifikalara güveniliyor...
zh_hans: 正在信任证书...

# UnexpectedErrorOccurred
source: An unexpected error occurred: {0}
tr: Beklenmeyen bir hata oluştu: {0}
zh_hans: 发生意外错误: {0}

# WaitingForDebuggerToAttachToAppHost
source: Waiting for debugger to attach to app host process
tr: Hata ayıklayıcının uygulama ana işlemine eklenmesi bekleniyor
zh_hans: 正在等待调试程序附加到应用主机进程
