Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/DescribeCommandStrings.*.xlf
Languages: de, pl

# AppHostNotRunning
source: No running AppHost found. Use 'aspire run' to start one first.
de: Es wurde kein ausgeführter AppHost gefunden. Verwenden Sie zuerst „aspire run“, um einen zu starten.
pl: Nie znaleziono działającego hosta AppHost. Najpierw uruchom go poleceniem „aspire run”.

# Description
source: Describe resources in a running apphost.
de: Zeigen Sie Ressourcenmomentaufnahmen von einem laufenden Aspire-AppHost an.
pl: Wyświetl migawki zasobów z działającego hosta aplikacji Aspire.

# JsonOptionDescription
source: Output format (Table or Json).
de: Ausgabe im JSON-Format zur maschinellen Verarbeitung.
pl: Wynik w formacie JSON do przetwarzania przez maszynę.

# NoAppHostFound
source: No AppHost project found.
de: Kein AppHost-Projekt gefunden.
pl: Nie znaleziono projektu AppHost.

# NoInScopeAppHostsShowingAll
source: No AppHosts found in current directory. Showing all running AppHosts.
de: Im aktuellen Verzeichnis wurden keine AppHosts gefunden. Es werden alle aktiven AppHosts angezeigt.
pl: Nie znaleziono hostów aplikacji w bieżącym katalogu. Wyświetlanie wszystkich uruchomionych hostów aplikacji.

# ProjectOptionDescription
source: The path to the Aspire AppHost project file.
de: Der Pfad zur Aspire AppHost-Projektdatei.
pl: Ścieżka do pliku projektu hosta AppHost platformy Aspire.

# ResourceArgumentDescription
source: The name of the resource to display. If not specified, all resources are shown.
de: Der Name der anzuzeigenden Ressource. Wenn keine Angabe erfolgt, werden alle Ressourcen angezeigt.
pl: Nazwa zasobu do wyświetlenia. Jeśli nie zostanie określony, zostaną wyświetlone wszystkie zasoby.

# ResourceNotFound
source: Resource '{0}' not found.
de: Die Ressource "{0}" wurde nicht gefunden.
pl: Nie znaleziono „{0}” zasobu.

source: Scanning for running AppHosts...
de: Suche nach aktiven AppHosts …
pl: Skanowanie w poszukiwaniu uruchomionych hostów aplikacji...

# SelectAppHost
source: Select an AppHost:
de: AppHost auswählen:
pl: Wybierz hosta aplikacji:
