Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/DocsCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Description
source: Browse and search Aspire documentation from aspire.dev.
cs: Dokumentaci můžete procházet a vyhledávat na aspire.dev.
de: Aspire-Dokumentation auf aspire.dev browsen und suchen.
es: Examine y busque la documentación de Aspire en aspire.dev.
fr: Parcourir et rechercher la documentation Aspire sur aspire.dev.
it: Esplorare e cercare la documentazione di Aspire su aspire.dev.
ja: aspire.dev から Aspire ドキュメントを参照して検索します。
ko: aspire.dev에서 Aspire 설명서를 찾아보고 검색하세요.
pl: Przeglądaj i przeszukuj dokumentację Aspire z Aspire.dev.
pt_br: Navegue e pesquise na documentação do Aspire em aspire.dev.
ru: Просмотр документации Aspire и поиск в ней на aspire.dev.
tr: aspire.dev adresinden Aspire belgelerini tarayın ve arayın.
zh_hans: 从 aspire.dev 浏览和搜索 Aspire 文档。
zh_hant: 瀏覽並搜尋 aspire.dev 上的 Aspire 文件。

# DocumentNotFound
source: Documentation page '{0}' not found. Use 'aspire docs list' to see available pages.
cs: Stránka dokumentace {0} nebyla nalezena. Pokud chcete zobrazit dostupné stránky, použijte příkaz aspire docs list.
de: Die Dokumentationsseite „{0}“ wurde nicht gefunden. Verwenden Sie „aspire docs list“, um verfügbare Seiten anzuzeigen.
es: No se encontró la página de documentación '{0}'. Use 'aspire docs list' para ver las páginas disponibles.
fr: Page de documentation « {0} » introuvable. Utilisez « aspire docs list » pour afficher les pages disponibles.
it: Pagina della documentazione '{0}' non trovata. Usare 'aspire docs list' per vedere le pagine disponibili.
ja: ドキュメント ページ '{0}' が見つかりません。使用可能なページを表示するには、'aspire docs list' を使用します。
ko: 설명서 페이지 '{0}'을(를) 찾을 수 없습니다. 사용 가능한 페이지를 보려면 'aspire docs list'를 사용하세요.
pl: Nie znaleziono strony dokumentacji „{0}”. Użyj opcji „lista dokumentacji”, aby wyświetlić dostępne strony.
pt_br: Página de documentação '{0}' não encontrada. Use 'aspire docs list' para ver as páginas disponíveis.
ru: Страница документации "{0}" не найдена. Чтобы увидеть, какие страницы доступны, используйте команду "aspire docs list".
tr: Belge sayfası ‘{0}’ bulunamadı. Kullanılabilir sayfaları görmek için ‘aspire docs list’ komutunu kullanın.
zh_hans: 找不到文档页面“{0}”。使用 "aspire docs list" 查看可用页面。
zh_hant: 找不到文件頁面 '{0}'。請使用 'aspire docs list' 查看可用頁面。

# FormatOptionDescription
source: Output format (Table or Json).
cs: Výstupní formát (tabulka nebo JSON)
de: Ausgabeformat (Tabelle oder JSON).
es: Formato de salida (tabla o JSON).
fr: Format de sortie (Tableau ou JSON).
it: Formato di output (Tabella o JSON).
ja: 出力形式 (テーブルまたは JSON)。
ko: 출력 형식(테이블 또는 JSON)입니다.
pl: Format danych wyjściowych (Tabela lub JSON).
ru: Формат вывода (таблица или JSON).
tr: Çıktı biçimi (Tablo veya Json).
zh_hans: 输出格式(表格或 Json)。
zh_hant: 輸出格式 (資料表或 Json)。

# FoundDocumentationPages
source: Found {0} documentation pages.
cs: Počet nalezených stránek dokumentace: {0}
de: Es wurden {0} Dokumentationsseiten gefunden.
es: Se encontraron {0} páginas de documentación.
fr: {0} pages de documentation trouvées.
it: Trovate {0} pagine di documentazione.
ja: {0} 件のドキュメント ページが見つかりました。
ko: {0}개의 설명서 페이지를 찾았습니다.
pl: Znalezione strony dokumentacji: {0}
pt_br: {0} páginas de documentação encontradas.
ru: Найдено страниц документации: {0}.
tr: {0} belge sayfası bulundu.
zh_hans: 找到 {0} 个文档页面。
zh_hant: 找到 {0} 文件頁面。

# FoundSearchResults
source: Found {0} results for '{1}'.
cs: Počet nalezených výsledků pro {1}: {0}
de: Es wurden {0} Ergebnisse für „{1}“ gefunden.
es: Se encontraron {0} resultados para '{1}'.
fr: {0} résultats trouvés pour « {1} ».
it: Sono stati trovati {0} risultati per '{1}'.
ja: '{1}' について {0} 件の結果が見つかりました。
ko: '{1}'에 대한 {0}개의 결과를 찾았습니다.
pl: Znaleziono wyniki ({0}) dla „{1}”.
pt_br: {0} resultados encontrados para '{1}'.
ru: По запросу "{1}" найдено результатов: {0}.
tr: ‘{1}’ için {0} sonuç bulundu.
zh_hans: 为“{1}”找到 {0} 个结果。
zh_hant: 找到 {0} 個 '{1}' 個結果。

# GetDescription
source: Get the full content of a documentation page by its slug.
cs: Získejte úplný obsah stránky dokumentace podle jejího slugu.
de: Den vollständigen Inhalt einer Dokumentationsseite anhand ihres Slugs abrufen.
es: Obtenga el contenido completo de una página de documentación por su identificador.
fr: Obtenez le contenu complet d’une page de documentation grâce à son identifiant.
it: Ottieni il contenuto completo di una pagina della documentazione tramite il suo campo dati dinamico.
ja: スラッグを指定してドキュメント ページのすべてのコンテンツを取得します。
ko: 슬러그로 설명서 페이지의 전체 내용을 가져옵니다.
pl: Pobierz pełną zawartość strony dokumentacji przy użyciu jej fragmentu.
pt_br: Obtenha o conteúdo completo de uma página de documentação pelo seu slug.
ru: Получить полное содержимое страницы документации по её динамическому идентификатору.
tr: Bir belge sayfasının tüm içeriğini özel bilgi alanı ile alın.
zh_hans: 通过短标识获取文档页面的完整内容。
zh_hant: 依據識別字串取得文件頁面的完整內容。

# LimitOptionDescription
source: Maximum number of search results to return (default: 5, max: 10).
cs: Maximální počet výsledků hledání, které se mají vrátit (výchozí: 5, max.: 10)
de: Die maximale Anzahl der Suchergebnisse, die zurückgegeben werden sollen (Standard: 5, max: 10).
es: Número máximo de resultados de búsqueda que se devolverán (predeterminado: 5, máximo: 10).
fr: Nombre maximal de résultats de recherche à retourner (par défaut : 5, max : 10).
it: Numero massimo di risultati della ricerca da restituire (predefinito: 5, massimo: 10).
ja: 返される検索結果の最大数 (既定値: 5、最大値: 10)。
ko: 반환할 최대 검색 결과 수입니다(기본값: 5, 최대: 10).
pl: Maksymalna liczba wyników wyszukiwania do zwrócenia (wartość domyślna: 5, maksimum: 10).
pt_br: Número máximo de resultados de pesquisa a serem retornados (padrão: 5, máx. 10).
ru: Максимальное количество результатов поиска, которые следует вернуть (по умолчанию: 5, максимум: 10).
tr: Döndürülecek maksimum arama sonucu sayısı (varsayılan: 5, maksimum: 10).
zh_hans: 要返回的最大搜索结果数(默认: 5，上限: 10)。
zh_hant: 最多回傳的搜尋結果數量 (預設: 5，最大值: 10)。

# ListDescription
source: List all available Aspire documentation pages.
cs: Vypíše všechny dostupné stránky dokumentace Aspire.
de: Alle verfügbaren Aspire-Dokumentationsseiten auflisten.
es: Muestra todas las páginas de documentación disponibles de Aspire.
fr: Listez toutes les pages de documentation Aspire disponibles.
it: Elenca tutte le pagine di documentazione Aspire disponibili.
ja: 利用可能なすべての Aspire ドキュメント ページを一覧表示します。
ko: 사용 가능한 모든 Aspire 설명서 페이지를 나열합니다.
pl: Wyświetl listę wszystkich dostępnych stron dokumentacji.
pt_br: Liste todas as páginas de documentação disponíveis do Aspire.
ru: Выдать список всех доступных страниц документации по Aspire.
tr: Mevcut tüm Aspire belge sayfalarını listeleyin.
zh_hans: 列出所有可用的 Aspire 文档页面。
zh_hant: 列出所有可用的 Aspire 文件頁面。

source: Loading documentation...
cs: Načítá se dokumentace...
de: Dokumentation wird geladen...
es: Cargando documentación...
fr: Chargement en cours de la documentation... Merci de patienter.
it: Caricamento della documentazione in corso...
ja: ドキュメントを読み込んでいます...
ko: 설명서를 로드하는 중...
pl: Trwa ładowanie dokumentacji...
pt_br: Carregando documentação...
ru: Документация загружается...
tr: Belgeler yükleniyor...
zh_hans: 正在加载文档...
zh_hant: 正在載入檔案...

# NoDocumentationAvailable
source: No documentation available. The aspire.dev docs may not have loaded correctly.
cs: Není dostupná žádná dokumentace. Dokumentace aspire.dev se možná nenačetla správně.
de: Keine Dokumente verfügbar. Die aspire.dev-Dokumente wurden möglicherweise nicht korrekt geladen.
es: No hay documentación disponible. Es posible que los documentos de aspire.dev no se hayan cargado correctamente.
fr: Désolé, aucune documentation disponible. Les documents aspire.dev n’ont peut-être pas été chargés correctement.
it: Documentazione non disponibile. I documenti di aspire.dev potrebbero non essere stati caricati correttamente.
ja: 使用可能なドキュメントがありません。aspire.dev ドキュメントが正しく読み込まれなかった可能性があります。
ko: 사용할 수 있는 설명서가 없습니다. aspire.dev 문서가 제대로 로드되지 않았을 수 있습니다.
pl: Brak dostępnej dokumentacji. Dokumenty aspire.dev mogły nie zostać załadowane poprawnie.
pt_br: Nenhum documento disponível. Os documentos do aspire.dev podem não ter carregado corretamente.
ru: Документации нет. Возможно, документация по aspire.dev некорректно загрузилась.
tr: Kullanılabilir belge yok. aspire.dev belgeleri doğru şekilde yüklenmemiş olabilir.
zh_hans: 无可用文档。aspire.dev 文档可能未正确加载。
zh_hant: 沒有可用的文件。aspire.dev 文件可能未正確載入。

# NoResultsFound
source: No results found for '{0}'. Try different search terms.
cs: Pro {0} se nenašly žádné výsledky. Zkuste použít jiné hledané termíny.
de: Für „{0}“ wurden keine Ergebnisse gefunden. Probieren Sie andere Suchbegriffe aus.
es: No se encontraron resultados para "{0}". Intente términos de búsqueda diferentes.
fr: Aucun résultat trouvé pour « {0} ». Essayez différents termes de recherche.
it: Non sono stati trovati risultati per '{0}'. Provare a eseguire la ricerca con termini differenti.
ja: '{0}' の結果が見つかりません。別の検索語句でお試しください。
ko: '{0}'에 대한 결과를 찾을 수 없습니다. 다른 검색어를 사용해 보세요.
pl: Nie znaleziono żadnych wyników dla „{0}”. Wypróbuj inne terminy wyszukiwania.
pt_br: Nenhum resultado encontrado para '{0}'. Tente termos de pesquisa diferentes.
ru: По запросу "{0}" ничего не найдено. Попробуйте искать по другим ключевым словам.
tr: ‘{0}’ için sonuç bulunamadı. Farklı arama terimleri deneyin.
zh_hans: 找不到“{0}”的结果。尝试其他搜索词。
zh_hant: 找不到 '{0}' 的結果。請嘗試不同的搜尋字詞。

# QueryArgumentDescription
source: The search query.
cs: Vyhledávací dotaz
de: Die Suchabfrage.
es: Consulta de búsqueda.
fr: La requête de recherche.
it: Query di ricerca.
ja: 検索クエリ。
ko: 검색 쿼리입니다.
pl: Zapytanie wyszukiwania.
pt_br: A consulta de pesquisa.
ru: Поисковый запрос.
tr: Arama sorgusu.
zh_hans: 搜索查询。
zh_hant: 搜尋查詢。

# SearchDescription
source: Search Aspire documentation by keywords.
cs: V dokumentaci můžete vyhledávat podle klíčových slov.
de: Aspire-Dokumentation nach Schlüsselwörtern suchen.
es: Busque en la documentación de Aspire por palabras clave.
fr: Rechercher la documentation Aspire par mots-clés.
it: Cerca nella documentazione Aspire usando parole chiave.
ja: キーワードを指定して Aspire ドキュメントを検索します。
ko: 키워드로 Aspire 설명서를 검색하세요.
pl: Wyszukaj dokumentację aplikacji Wyszukaj według słów kluczowych.
pt_br: Pesquise a documentação do Aspire por palavras-chave.
ru: Поиск в документации Aspire по ключевым словам.
tr: Aspire belgelerini anahtar kelimelerle arayın.
zh_hans: 按关键字搜索 Aspire 文档。
zh_hant: 依關鍵字搜尋 Aspire 文件。

# SectionOptionDescription
source: Return only the specified section of the page.
cs: Vrátí pouze zadaný oddíl stránky.
de: Nur den angegebenen Abschnitt der Seite zurückgeben.
es: Devuelve solo la sección especificada de la página.
fr: Retourner uniquement la section spécifiée de la page.
it: Restituisci solo la sezione specificata della pagina.
ja: ページの指定したセクションのみを返します。
ko: 페이지의 지정된 섹션만 반환합니다.
pl: Zwróć tylko określoną sekcję strony.
pt_br: Retornar apenas a seção especificada da página.
ru: Возвращать только указанный раздел страницы.
tr: Sayfanın yalnızca belirtilen bölümünü döndür.
zh_hans: 仅返回页面的指定部分。
zh_hant: 僅回傳頁面指定的區段。

# SlugArgumentDescription
source: The slug of the documentation page (e.g., 'redis-integration').
cs: Slug stránky dokumentace (např. redis-integration)
de: Der Slug der Dokumentationsseite (z. B. „redis-integration“).
es: El identificador de la página de documentación (por ejemplo, 'redis-integration').
fr: Identifiant de la page de documentation (par ex., « redis-integration »).
it: Campo dati dinamico della pagina della documentazione (ad esempio, 'redis-integration').
ja: ドキュメント ページのスラッグ (例: 'redis-integration')。
ko: 설명서 페이지의 슬러그(예: 'redis-integration')입니다.
pl: Fragment strony dokumentacji (np. „redis-integration”).
pt_br: O slug da página de documentação (por exemplo, 'redis-integration').
ru: Идентификатор страницы документации (например, "redis-integration").
tr: Belge sayfasının başlığı (örneğin, ‘redis-integration’).
zh_hans: 文档页面的短标识(例如 "redis-integration")。
zh_hant: 文件頁面的識別字串 (例如 'redis-integration')。
