Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/ErrorStrings.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AlreadyConnectedToBackchannel
source: Already connected to AppHost backchannel.
cs: Již připojeno k vedlejšímu kanálu AppHost.
de: Bereits mit AppHost-Rückkanal verbunden.
fr: Déjà connecté au backchannel AppHost.
it: Connessione al backchannel di AppHost già stabilita.
ja: 既に AppHost バックチャネルに接続済みです。
ko: AppHost 백채널에 이미 연결되었습니다.
pl: Nawiązano już połączenie z kanałem backchannel hosta aplikacji.
pt_br: Já conectado ao backchannel AppHost.
ru: Подключение к тайному входу AppHost уже установлено.
tr: AppHost arka kanala zaten bağlı.
zh_hans: 已连接到 AppHost 反向通道。
zh_hant: 已連線到 AppHost 後通道。

# AppHostIncompatibleWithCli
source: AppHost is incompatible with the CLI. The AppHost must be updated to a version that supports the {0} capability.
cs: AppHost není kompatibilní s rozhraním příkazového řádku. AppHost musí být aktualizován na verzi, která podporuje funkci {0}.
de: Der AppHost ist nicht mit der CLI kompatibel. Der AppHost muss auf eine Version aktualisiert werden, die die {0}-Funktion unterstützt.
fr: AppHost est incompatible avec l’interface CLI. AppHost doit être mis à jour vers une version qui prend en charge la fonctionnalité {0}.
it: AppHost non è compatibile con l'interfaccia della riga di comando. AppHost deve essere aggiornato a una versione che supporta la funzionalità {0}.
ja: AppHost に CLI との互換性がありません。AppHost を、{0} 機能がサポートされるバージョンに更新する必要があります。
ko: AppHost가 CLI와 호환되지 않습니다. AppHost를 {0} 기능을 지원하는 버전으로 업데이트해야 합니다.
pl: Host aplikacji jest niezgodny z interfejsem wiersza polecenia. Host aplikacji musi zostać zaktualizowany do wersji obsługującej funkcję {0}.
pt_br: AppHost é incompatível com a CLI. O AppHost deve ser atualizado para uma versão que dê suporte à funcionalidade {0}.
ru: AppHost несовместим с CLI. AppHost необходимо обновить до версии, которая поддерживает возможность {0}.
tr: AppHost, CLI ile uyumsuzdur. AppHost, bu {0} yeteneğini destekleyen bir sürüme güncelleştirilmelidir.
zh_hans: AppHost 与 CLI 不兼容。必须将 AppHost 更新为支持 {0} 功能的版本。
zh_hant: AppHost 與 CLI 不相容。AppHost 必須更新為支援 {0} 功能的版本。

# AppHostWasSpecifiedButDoesntExist
source: AppHost file was specified in '{0}' but it does not exist at '{1}'.
cs: Soubor AppHost byl zadán v {0}, ale v {1} neexistuje.
de: Die AppHost-Datei wurde in „{0}“ angegeben, ist aber unter „{1}“ nicht vorhanden.
fr: Le fichier AppHost a été spécifié dans « {0} » mais il n’existe pas dans « {1} ».
it: Il file AppHost è stato specificato in '{0}', ma non esiste in '{1}'.
ja: AppHost ファイルが '{0}' で指定されましたが、'{1}' に存在していません。
ko: appHost 파일이 '{0}'에 지정되었지만, '{1}'에 존재하지 않습니다.
pl: Plik AppHost został określony w ścieżce „{0}”, ale nie istnieje w lokalizacji „{1}”.
pt_br: O arquivo AppHost foi especificado em ''{0}'', mas não existe em ''{1}''.
ru: Файл AppHost указан в "{0}", но не существует в пути "{1}".
tr: AppHost dosyası '{0}' dosyasında belirtilmiş ancak '{1}' konumunda mevcut değil.
zh_hans: AppHost 文件是在 ‘{0}’ 中指定的，但它在 ‘{1}’ 中不存在。
zh_hant: 在 '{0}' 中指定了 AppHost 檔案，但在 '{1}' 中不存在。

# AppHostsMayNotBeBuildable
source: No buildable app hosts were found, but there may have been unbuildable app hosts.
ko: 빌드 가능한 앱 호스트를 찾을 수 없지만, 빌드할 수 없는 앱 호스트가 있을 수 있습니다.
pl: Nie znaleziono hostów aplikacji z możliwością kompilacji, ale mogły istnieć hosty aplikacji, których nie można było skompilować.
zh_hans: 未找到可构建的应用主机，但可能存在不可构建的应用主机。

# AspireHostingVersionNull
source: AspireHostingVersion is null
cs: AspireHostingVersion má hodnotu null.
de: AspireHostingVersion ist NULL.
fr: AspireHostingVersion est nul
it: OttimizzazionehostingVersion è Null
ja: AspireHostingVersion が null です
ko: AspireHostingVersion이 null입니다
pl: Wartość parametru AspireHostingVersion to null
ru: Значение AspireHostingVersion равно NULL
tr: AspireHostingVersion null
zh_hans: AspireHostingVersion 为 null
zh_hant: AspireHostingVersion 為 null

# AspireSDKVersionNotSupported
source: The Aspire.Hosting package version {0} is not supported. Please update to the latest version.
cs: Verze {0} balíčku Aspire.Hosting se nepodporuje. Aktualizujte ho prosím na nejnovější verzi.
de: Die Aspire.Hosting-Paketversion „{0}“ wird nicht unterstützt. Aktualisieren Sie auf die neueste Version.
fr: La version {0} du package Aspire.Hosting n’est pas prise en charge. Veuillez mettre à jour vers la dernière version.
it: La versione del pacchetto Aspire.Hosting {0} non è supportata. Esegui l'aggiornamento alla versione più recente.
ja: Aspire.Hosting パッケージのバージョン {0} はサポートされていません。最新のバージョンに更新してください。
ko: Aspire.Hosting 패키지 버전 {0}은(는) 지원되지 않습니다. 최신 버전으로 업데이트하세요.
pl: Wersja {0} pakietu Aspire.Hosting nie jest obsługiwana. Zaktualizuj do najnowszej wersji.
pt_br: Não há suporte para a versão {0} do pacote Aspire.Hosting. Atualize para a versão mais recente.
ru: Версия пакета Aspire.Hosting {0} не поддерживается. Обновите продукт до последней версии.
tr: Aspire.Hosting paketinin {0} sürümü desteklenmiyor. Lütfen en son sürüme güncelleştirin.
zh_hans: 不支持 Aspire.Hosting 包版本 {0}。请更新到最新版本。
zh_hant: 不支援 Aspire.Hosting 套件版本 {0}。請更新至最新版本。

# CantUseBothWatchAndNoBuild
source: Cannot use --watch and --no-build at the same time.
cs: Nelze použít --watch a --no-build současně.
de: „--watch“ und „--no-build“ können nicht gleichzeitig verwendet werden.
fr: Impossible d’utiliser --watch et --no-build en même temps.
it: Non è possibile usare --watch e --no-build contemporaneamente.
ja: --watch と --no-build を同時に使用することはできません。
ko: --watch와 --no-build를 동시에 사용할 수 없습니다.
pl: Nie można używać jednocześnie opcji --watch i --no-build.
pt_br: Não é possível usar --watch e --no-build ao mesmo tempo.
ru: Одновременное использование --watch и --no-build невозможно.
tr: --watch ve --no-build aynı anda kullanılamaz.
zh_hans: 不能同时使用 --watch 和 --no-build。
zh_hant: 無法同時使用 --watch 和 --no-build。

# CertificatesMayNotBeFullyTrusted
source: Developer certificates may not be fully trusted (trust exit code was: {0}).
cs: Vývojářské certifikáty nemusí být plně důvěryhodné (ukončovací kód vztahu důvěryhodnosti byl: {0}).
de: Entwicklerzertifikate sind möglicherweise nicht vollständig vertrauenswürdig (vertrauenswürdiger Exitcode war: {0}).
fr: Les certificats de développeur ne sont peut-être pas entièrement approuvés (le code de sortie d’approbation était : {0}).
it: I certificati per sviluppatori potrebbero non essere completamente attendibili (codice di uscita attendibilità: {0}).
ja: 開発者証明書が完全に信頼されていない可能性があります (信頼終了コード: {0})。
ko: 개발자 인증서를 완전히 신뢰할 수 없습니다(신뢰 종료 코드: {0}).
pl: Certyfikaty dewelopera mogą nie być w pełni zaufane (kod zakończenia zaufania: {0}).
pt_br: Os certificados de desenvolvedor podem não ser totalmente confiáveis (o código de saída de confiança era: {0}).
ru: Сертификаты разработчика могут быть не полностью доверенными (код завершения доверия: {0}).
tr: Geliştirici sertifikaları tam olarak güvenilir olmayabilir (güven çıkış kodu şuydu: {0}).
zh_hans: 开发人员证书可能不完全受信任(信任退出代码为: {0})。
zh_hant: 開發人員憑證可能未完全受信任 (信任結束代碼為: {0})。

# CommandNotSupportedWithSingleFileAppHost
source: This command is not yet supported with single file AppHosts.
ko: 이 명령은 단일 파일 AppHosts에서 아직 지원되지 않습니다.
pl: To polecenie nie jest jeszcze obsługiwane w przypadku hostów AppHost z jednym plikiem.
zh_hans: 单文件应用主机尚不支持此命令。

# ConfigurationKeyNotFound
source: Configuration key {0} not found.
cs: Konfigurační klíč {0} se nenašel.
de: Der Konfigurationsschlüssel „{0}“ wurde nicht gefunden.
fr: Clé de configuration {0} introuvable.
it: Chiave di configurazione {0} non trovata.
ja: 構成キー {0} が見つかりません。
ko: 구성 키 {0}을(를) 찾을 수 없습니다.
pl: Nie znaleziono klucza konfiguracji {0}.
pt_br: Chave de configuração {0} não encontrada.
ru: Ключ конфигурации {0} не найден.
tr: {0} yapılandırma anahtarı bulunamadı.
zh_hans: 未找到配置键 {0}。
zh_hant: 找不到設定金鑰 {0}。

# ConfigurationKeyRequired
source: Configuration key is required.
cs: Je vyžadován konfigurační klíč.
de: Der Konfigurationsschlüssel ist erforderlich.
fr: La clé de configuration est obligatoire.
it: La chiave di configurazione è obbligatoria.
ja: 構成キーが必要です。
ko: 구성 키가 필요합니다.
pl: Klucz konfiguracji jest wymagany.
pt_br: A chave de configuração é necessária.
ru: Ключ конфигурации обязателен.
tr: Yapılandırma anahtarı gereklidir.
zh_hans: 配置键是必需的。
zh_hant: 必須提供設定金鑰。

# ConfigurationValueRequired
source: Configuration value is required.
cs: Hodnota konfigurace je povinná.
de: Der Konfigurationswert ist erforderlich.
fr: La valeur de la configuration est requise.
it: Il valore di configurazione è obbligatorio.
ja: 構成値が必要です。
ko: 구성 값이 필요합니다.
pl: Wartość konfiguracji jest wymagana.
pt_br: O valor de configuração é obrigatório.
ru: Значение конфигурации обязательно.
tr: Yapılandırma değeri gereklidir.
zh_hans: 配置值是必需的。
zh_hant: 設定值為必須。

# CouldNotParseAspireSDKVersion
source: Could not parse Aspire.Hosting package version.
cs: Nepodařilo se analyzovat verzi balíčku Aspire.Hosting.
de: Die Aspire.Hosting-Paketversion konnte nicht analysiert werden.
fr: Impossible d’analyser la version du package Aspire.Hosting.
it: Non è possibile analizzare la versione del pacchetto Aspire.Hosting.
ja: Aspire.Hosting パッケージのバージョンを解析できませんでした。
ko: Aspire.Hosting 패키지 버전을 구문 분석할 수 없습니다.
pl: Nie można przeanalizować wersji pakietu Aspire.Hosting.
pt_br: Não foi possível analisar a versão do pacote Aspire.Hosting.
ru: Не удалось выполнить разбор версии пакета Aspire.Hosting.
tr: Aspire.Hosting paket sürümü ayrıştırılamadı.
zh_hans: 无法分析 Aspire.Hosting 包版本。
zh_hant: 無法剖析 Aspire.Hosting 套件版本。

# ErrorDeletingConfiguration
source: Error deleting configuration: {0}
cs: Chyba při odstraňování konfigurace: {0}
de: Fehler beim Löschen der Konfiguration „{0}“.
fr: Erreur lors de la suppression de la configuration : {0}
it: Errore durante l'eliminazione della configurazione: {0}
ja: 次の構成の削除でエラーが発生しました: {0}
ko: 구성을 삭제하는 동안 오류가 발생함: {0}
pl: Błąd podczas usuwania konfiguracji: {0}
pt_br: Erro ao excluir a configuração: {0}
ru: При удалении профиля конфигурации возникла ошибка: {0}
tr: Yapılandırma silinirken hata oluştu: {0}
zh_hans: 删除配置时出错: {0}
zh_hant: 刪除設定檔時發生錯誤: {0}

# ErrorSettingConfiguration
source: Error setting configuration: {0}
cs: Chyba při nastavování konfigurace: {0}
de: Fehler beim Festlegen der Konfiguration „{0}“.
fr: Erreur lors de la définition de la configuration : {0}
it: Errore durante l'impostazione della configurazione: {0}
ja: 次の構成の設定でエラーが発生しました: {0}
ko: 구성 설정 오류: {0}
pl: Błąd podczas ustawiania konfiguracji: {0}
pt_br: Erro ao definir a configuração: {0}
ru: Ошибка при задании настройки конфигурации: {0}
tr: Yapılandırma ayarlanırken hata: {0}
zh_hans: 设置配置时出错: {0}
zh_hant: 設定設定時發生錯誤: {0}

# ExtensionIncompatibleWithCli
source: Aspire Extension is incompatible with the CLI. The Extension must be updated to a version that supports the {0} capability.
fr: L’extension Aspire est incompatible avec l’interface CLI. L’extension doit être mise à jour vers une version qui prend en charge la fonctionnalité {0}.
it: L'estensione Aspire non è compatibile con l'interfaccia della riga di comando. L'estensione deve essere aggiornata a una versione che supporta la funzionalità {0}.
ko: Aspire Extension이 CLI와 호환되지 않습니다. Extension을 {0} 기능을 지원하는 버전으로 업데이트해야 합니다.
pl: Rozszerzenie biblioteki jest niezgodne z interfejsem wiersza polecenia. Rozszerzenie musi zostać zaktualizowane do wersji obsługującej tę funkcję {0}.
pt_br: A Extensão Desalocar é incompatível com a CLI. A Extensão deve ser atualizada para uma versão que dê suporte à funcionalidade {0}.
zh_hans: Aspire 扩展与 CLI 不兼容。扩展必须更新为支持 {0} 功能的版本。
zh_hant: Aspire 延伸模組與 CLI 不相容。該延伸模組必須更新為支援 {0} 功能的版本。

# ExtensionTokenMustBeSet
source: The Aspire extension token must be set if ASPIRE_EXTENSION_ENDPOINT is set. Please ensure that ASPIRE_EXTENSION_TOKEN is set
fr: Le jeton d’extension Aspire doit être défini si ASPIRE_EXTENSION_ENDPOINT est défini. Veuillez vérifier que ASPIRE_EXTENSION_TOKEN est défini
it: È necessario impostare il token di espansione Aspire se ASPIRE_EXTENSION_ENDPOINT è impostato. Assicurarsi che ASPIRE_EXTENSION_TOKEN sia impostato
ko: ASPIRE_EXTENSION_ENDPOINT가 설정된 경우 ASPIRE_EXTENSION_TOKEN도 설정해야 합니다. ASPIRE_EXTENSION_TOKEN이 설정되어 있는지 확인하세요.
pl: Jeśli ustawiono ASPIRE_EXTENSION_ENDPOINT, należy ustawić token rozszerzenia SaS. Upewnij się, że ustawiono ASPIRE_EXTENSION_TOKEN
pt_br: O token de extensão Doam deve ser definido se ASPIRE_EXTENSION_ENDPOINT estiver definido. Verifique se o ASPIRE_EXTENSION_TOKEN está definido
zh_hans: 如果设置了 ASPIRE_EXTENSION_ENDPOINT，则必须设置 Aspire 扩展令牌。请确保已设置 ASPIRE_EXTENSION_TOKEN
zh_hant: 如果已設定 ASPIRE_EXTENSION_ENDPOINT，則必須設定 Aspire 延伸模組權杖。請確定已設定 ASPIRE_EXTENSION_TOKEN

source: Failed to parse template version from stdout.
cs: Nepodařilo se analyzovat verzi šablony ze stdout.
de: Fehler beim Analysieren der Vorlagenversion von stdout.
fr: Échec de l’analyse de la version du modèle à partir de stdout.
it: Non è possibile analizzare la versione del modello da stdout.
ja: stdout からのテンプレート バージョンの解析に失敗しました。
ko: stdout에서 템플릿 버전을 구문 분석하지 못했습니다.
pl: Nie można przeanalizować wersji szablonu z właściwości StdOut.
pt_br: Falha ao analisar a versão do modelo de stdout.
ru: Не удалось проделать разбор версии шаблона из stdout.
tr: stdout'tan şablon sürümü ayrıştırılamadı.
zh_hans: 未能通过 stdout 分析模板版本。
zh_hant: 無法從 stdout 剖析範本版本。

# FailedToRetrieveCachedAllAspirePackages
source: Failed to retrieve all Aspire packages via cache.
ko: 캐시를 통해 모든 Aspire 패키지를 검색하지 못했습니다.
pl: Nie można pobrać wszystkich pakietów Aspire za pośrednictwem pamięci podręcznej.
zh_hans: 未能通过缓存检索所有 Aspire 包。

# FailedToRetrieveCachedTemplatePackages
source: Failed to retrieve template packages via cache.
cs: Nepovedlo se načíst balíčky šablon prostřednictvím mezipaměti.
de: Fehler beim Abrufen von Vorlagenpaketen über den Cache.
fr: Échec de la récupération des packages de modèles via le cache.
it: Non è possibile recuperare i pacchetti modello tramite cache.
ja: キャッシュを経由したテンプレート パッケージの取得に失敗しました。
ko: 캐시를 통해 템플릿 패키지를 검색하지 못했습니다.
pl: Nie można pobrać pakietów szablonów za pośrednictwem pamięci podręcznej.
pt_br: Falha ao recuperar pacotes de modelo por meio do cache.
ru: Не удалось получить пакеты шаблонов через кэш.
tr: Şablon paketleri önbellek aracılığıyla alınamadı.
zh_hans: 未能通过缓存检索模板包。
zh_hant: 無法透過快取擷取範本套件。

# FailedToSearchForPackages
source: Failed to search for packages. Exit code: {0}.
cs: Nepovedlo se vyhledat balíčky. Ukončovací kód: {0}
de: Fehler beim Suchen nach Paketen. Exitcode: {0}.
fr: Échec de la recherche des packages. Code de sortie : {0}.
it: Non è possibile cercare i pacchetti. Codice di uscita: {0}.
ja: パッケージの検索に失敗しました。終了コード: {0}。
ko: 패키지를 검색하지 못했습니다. 종료 코드: {0}.
pl: Nie można wyszukać pakietów. Kod zakończenia: {0}.
pt_br: Falha ao pesquisar pacotes. Código de saída: {0}.
ru: Не удалось выполнить поиск пакетов. Код выхода: {0}.
tr: Paketler aranamadı. Çıkış kodu: {0}.
zh_hans: 未能搜索包。退出代码: {0}。
zh_hant: 無法搜尋套件。結束代碼: {0}。

# InvalidLocaleProvided
source: Invalid locale {0} provided will not be used.
cs: Zadané neplatné národní prostředí {0} se nepoužije.
de: Das angegebene ungültige Gebietsschema „{0}“ wird nicht verwendet.
fr: Les paramètres régionaux non valides {0} fournis ne seront pas utilisés.
it: Le impostazioni locali {0} specificate non valide non verranno utilizzate.
ja: 指定された無効なロケール {0} は使用されません。
ko: 제공한 로캘 {0}이(가) 잘못되어 사용되지 않습니다.
pl: Podane nieprawidłowe ustawienia regionalne {0} nie będą używane.
pt_br: A localidade {0} inválida fornecida não será usada.
ru: Указанный недопустимый языковой стандарт {0} не будет использован.
tr: Sağlanan geçersiz {0} yerel ayarı kullanılmayacaktır.
zh_hans: 将不使用提供的无效区域设置 {0}。
zh_hant: 提供的無效地區設定 {0} 將不會被使用。

# InvalidSocketPath
source: The provided extension socket path needs two valid parts.
fr: Le chemin d’accès de socket d’extension fourni nécessite deux parties valides.
it: Il percorso del socket di estensione fornito richiede due parti valide.
ko: 제공된 확장 소켓 경로에는 두 개의 유효한 부분이 필요합니다.
pl: Podana ścieżka gniazda rozszerzenia wymaga dwóch prawidłowych części.
pt_br: O caminho do soquete de extensão fornecido precisa de duas partes válidas.
zh_hans: 提供的扩展套接字路径需要两个有效部分。
zh_hant: 提供的延伸模組通訊端路徑需要兩個有效的部分。

# MinimumSdkVersionNotMet
source: The Aspire CLI requires .NET SDK version {0} or later. Detected: {1}.
ko: Aspire CLI를 사용하려면 .NET SDK 버전 {0} 이상이 필요합니다. 감지됨: {1}.
pl: Interfejs wiersza polecenia platformy Aspire wymaga zestawu .NET SDK w wersji {0} lub nowszej. Wykryto {1}.
zh_hans: Aspire CLI 需要 .NET SDK {0} 或更高版本。检测到: {1}。

source: Multiple project files found.
cs: Bylo nalezeno více souborů projektu.
de: Es wurden mehrere Projektdateien gefunden.
fr: Plusieurs fichiers projet trouvés.
it: Sono stati trovati più file di progetto.
ja: プロジェクト ファイルが複数見つかりました。
ko: 여러 프로젝트 파일을 찾았습니다.
pl: Znaleziono wiele plików projektu.
pt_br: Vários arquivos de projeto encontrados.
ru: Обнаружено несколько файлов проектов.
tr: Birden fazla proje dosyası bulundu.
zh_hans: 找到多个项目文件。
zh_hant: 找到多個專案檔案。

source: No project file found.
cs: Nenašel se žádný soubor projektu.
de: Es wurde keine Projektdatei gefunden.
fr: Fichier projet introuvable.
it: Non è stato trovato alcun file di progetto.
ja: プロジェクト ファイルが見つかりません。
ko: 프로젝트 파일을 찾을 수 없습니다.
pl: Nie znaleziono pliku projektu.
pt_br: Nenhum arquivo de projeto encontrado.
ru: Файл проекта не найден.
tr: Herhangi bir proje dosyası bulunamadı.
zh_hans: 找不到项目文件。
zh_hant: 找不到專案檔案啊。

# NoSelectionMade
source: Input was required for prompt '{0}' but not provided.
fr: Une entrée était requise pour l’invite '{0}', mais elle n’a pas été fournie.
it: L'input necessario per la richiesta '{0}' non è stato fornito.
ko: 프롬프트 '{0}'에 대한 입력이 필요하지만 제공되지 않았습니다.
pl: Dane wejściowe były wymagane dla monitu „{0}”, ale nie zostały podane.
pt_br: A entrada era necessária para a solicitação "{0}", mas não foi fornecida.
zh_hans: 提示“{0}”需要输入，但未提供。
zh_hant: 提示 '{0}' 需要輸入，但未提供。

# ProjectCouldNotBeAnalyzed
source: The project could not be analyzed due to a build error. For more information run with --debug switch.
cs: Projekt se nepodařilo analyzovat kvůli chybě sestavení. Další informace získáte spuštěním s přepínačem --debug.
de: Das Projekt konnte aufgrund eines Buildfehlers nicht analysiert werden. Weitere Informationen erhalten Sie, wenn Sie mit dem Schalter „--debug“ ausführen.
fr: Impossible d’analyser le projet en raison d’une erreur de build. Pour plus d’informations, exécutez avec le commutateur --debug.
it: Non è possibile analizzare il progetto a causa di un errore di compilazione. Per altre informazioni, eseguire con l'opzione --debug.
ja: ビルド エラーのため、プロジェクトを分析できませんでした。詳細情報については、--debug スイッチを使用し実行してください。
ko: 빌드 오류로 인해 프로젝트를 분석할 수 없습니다. 자세한 내용을 보려면 --debug 스위치를 이용하여 실행하세요.
pl: Nie można przeanalizować projektu z powodu błędu kompilacji. Aby uzyskać więcej informacji, uruchom polecenie przełącznika --debug.
pt_br: Não foi possível analisar o projeto devido a um erro de compilação. Para obter mais informações, execute com a opção --debug.
ru: Не удалось проанализировать проект из-за ошибки сборки. Для получения дополнительных сведений запустите команду с параметром --debug.
tr: Proje bir derleme hatası nedeniyle analiz edilemedi. Daha fazla bilgi için --debug anahtarıyla çalıştırın.
zh_hans: 由于生成错误，无法分析项目。有关详细信息，请使用 --debug 开关运行。
zh_hant: 因為組建錯誤，無法分析專案。如需詳細資訊，請使用 --debug 切換執行。

# ProjectFileDoesntExist
source: Project file does not exist.
cs: Soubor projektu neexistuje.
de: Die Projektdatei ist nicht vorhanden.
fr: Le fichier projet de bot n’existe pas.
it: Il file di progetto non esiste.
ja: プロジェクト ファイルが存在しません。
ko: 프로젝트 파일이 없습니다.
pl: Plik projektu nie istnieje.
pt_br: O arquivo de projeto não existe.
ru: Файл проекта не существует.
tr: Proje dosyası mevcut değil.
zh_hans: 项目文件不存在。
zh_hant: 專案檔案不存在。

# ProjectFileMayBeUnbuildableAppHost
source: Could not build: {0}
ko: 빌드할 수 없음: {0}
pl: Nie można skompilować: {0}
zh_hans: 无法构建: {0}

# ProjectFileNotAppHostProject
source: Project file is not an Aspire AppHost project.
ko: 프로젝트 파일이 Aspire AppHost 프로젝트가 아닙니다.
pl: Plik projektu nie jest projektem hosta AppHost platformy Aspire.
zh_hans: 项目文件不是 Aspire AppHost 项目。

# ProjectIsNotAppHost
source: The project does not contain an Aspire apphost.
ko: 프로젝트에 Aspire AppHost가 포함되어 있지 않습니다.
pl: Projekt nie zawiera hosta AppHost platformy Aspire.
zh_hans: 该项目不包含 Aspire 应用主机。

# SingleFileAppHostFeatureNotEnabled
source: Single file AppHost feature is not enabled. To use .cs AppHost files, enable the feature using configuration.
ko: 단일 파일 AppHost 기능을 사용할 수 없습니다. .cs AppHost 파일을 사용하려면 설정을 사용하여 기능을 활성화해야 합니다.
pl: Funkcja hosta AppHost z jednym plikiem nie jest włączona. Aby użyć plików .cs hosta AppHost, włącz tę funkcję przy użyciu konfiguracji.
zh_hans: 未启用单文件应用主机功能。要使用 .cs AppHost 文件，请通过配置启用该功能。

# UnableToRetrieveAssemblyVersion
source: Unable to retrieve the assembly version.
cs: Nelze načíst verzi sestavení.
de: Die Assemblyversion kann nicht abgerufen werden.
fr: Impossible de récupérer la version de l’assembly.
it: Non è possibile recuperare la versione dell'assembly.
ja: アセンブリのバージョンを取得できません。
ko: 어셈블리 버전을 검색할 수 없습니다.
pl: Nie można pobrać wersji zestawu.
pt_br: Não é possível recuperar a versão do assembly.
ru: Не удалось получить версию сборки.
tr: Derleme sürümü alınamadı.
zh_hans: 无法检索程序集版本。
zh_hant: 無法擷取組件版本。

# UnsupportedLocaleProvided
source: Unsupported locale {0} provided will not be used. Supported locales are: {1}.
cs: Zadané nepodporované národní prostředí {0} se nepoužije. Podporovaná národní prostředí jsou: {1}.
de: Das angegebene nicht unterstützte Gebietsschema „{0}“ wird nicht verwendet. Unterstützte Gebietsschemas sind „{1}“.
fr: Les paramètres régionaux {0} non pris en charge fournis ne seront pas utilisés. Paramètres régionaux pris en charge : {1}.
it: Le impostazioni locali {0} non supportate specificate non verranno utilizzate. Le impostazioni locali supportate sono: {1}.
ja: 指定されたサポート対象外のロケール {0} は使用されません。サポート対象のロケールは {1} です。
ko: 제공한 로캘 {0}이(가) 지원되지 않아 사용되지 않습니다. 지원되는 로캘은 {1}입니다.
pl: Podane nieobsługiwane ustawienia regionalne {0} nie będą używane. Obsługiwane ustawienia regionalne to: {1}.
pt_br: A localidade {0} sem suporte fornecida não será usada. As localidades com suporte são: {1}.
ru: Указанный неподдерживаемый языковой стандарт {0} не будет использован. Поддерживаемые языковые стандарты: {1}.
tr: Sağlanan desteklenmeyen {0} yerel ayarı kullanılmayacaktır. Desteklenen yerel ayarlar: {1}.
zh_hans: 将不使用提供的不受支持的区域设置 {0}。支持的区域设置为: {1}。
zh_hant: 提供的不支援地區設定 {0} 將不會被使用。支援的地區設定為: {1}。

# ProjectFileNotAppHostProject
source: Project file is not an Aspire app host project.
cs: Soubor projektu není projekt hostitele aplikací Aspire.
fr: Le fichier projet n’est pas un projet hôte d’application Aspire.
it: Il file di progetto non è un progetto host dell'app Aspire.
pt_br: O arquivo de projeto não é um projeto do host de aplicativo do Aspire.
tr: Proje dosyası bir Aspire uygulama ana işlemi projesi değil.
zh_hant: 專案檔案不是 Aspire 應用程式主機專案。

# ProjectIsNotAppHost
source: The project is not an Aspire app host project.
cs: Projekt není projekt hostitele aplikací Aspire.
fr: Le projet n’est pas un projet hôte d’application Aspire.
it: Il progetto non è un progetto host dell'app Aspire.
pt_br: O projeto não é um projeto de host de aplicativo do Aspire.
tr: Proje, Aspire uygulama ana işlemi projesi değil.
zh_hant: 專案不是 Aspire 應用程式主機專案。

# ProjectFileNotAppHostProject
source: Project file is not an Aspire Apphost project.
de: Die Projektdatei ist kein Aspire-App-Hostprojekt.
ja: Aspire アプリ ホスティング プロセスのプロジェクトではないプロジェクト ファイルです。
ru: Файл проекта не является проектом хоста приложений Aspire.

# ProjectIsNotAppHost
source: The project is not an Aspire Apphost project.
de: Das Projekt ist kein Aspire-App-Hostprojekt.
ja: このプロジェクトは、Aspire アプリ ホスティング プロセスのプロジェクトではありません。
ru: Проект не является проектом хоста приложений Aspire.
