Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/ExecCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CommandArgumentDescription
source: The command to execute in the target resource's context. Commands can be specified directly after options or after a -- separator.
cs: Příkaz, který se má provést v kontextu cílového prostředku. Příkazy lze zadat přímo po parametrech nebo za oddělovačem --.
de: Der Befehl, der im Kontext der Zielressource ausgeführt werden soll. Befehle können direkt nach Optionen oder nach einem -- Trennzeichen angegeben werden.
es: Comando que se va a ejecutar en el contexto del recurso de destino. Los comandos se pueden especificar directamente después de las opciones o después de un separador --.
fr: Commande à exécuter dans le contexte de la ressource cible. Vous pouvez spécifier les commandes directement après les options ou après un séparateur -- .
it: Il comando da eseguire nel contesto della risorsa di destinazione. I comandi possono essere specificati direttamente dopo le opzioni o dopo un separatore --.
ja: ターゲット リソースのコンテキストで実行するコマンド。コマンドは、オプションの直後または -- 区切り記号の後に指定できます。
ko: 대상 리소스의 컨텍스트에서 실행할 명령입니다. 명령은 옵션 뒤에 바로 지정하거나 -- 구분 기호 뒤에 지정할 수 있습니다.
pl: Polecenie do wykonania w kontekście zasobu docelowego. Polecenia można określać bezpośrednio po opcjach lub po separatorze --.
pt_br: O comando a ser executado no contexto do recurso alvo. Os comandos podem ser especificados diretamente após as opções ou após um separador --.
ru: Команда для выполнения в контексте целевого ресурса. Команды можно указывать непосредственно после параметров или после разделителя --.
tr: Hedef kaynağın bağlamında yürütülecek komut. Komutlar, seçeneklerin hemen ardından veya -- ayırıcısından sonra belirtilebilir.
zh_hans: 要在目标资源的上下文中执行的命令。可以在选项之后或 -- 分隔符之后直接指定命令。
zh_hant: 要在目標資源的內容中執行的命令。命令可以直接在選項之後或在 -- 分隔符號之後指定。

# Description
source: Execute commands in the context of an Aspire application resource. Starts the AppHost, waits for resources to initialize, then runs the specified command in the target resource's environment. (Preview) Examples: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
cs: Umožňuje spouštět příkazy v kontextu prostředku aplikace Aspire. Spustí AppHost, počká na inicializaci prostředků a pak spustí zadaný příkaz v prostředí cílového prostředku. (Preview) Příklady: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
de: Führen Sie Befehle im Kontext einer Aspire-Anwendungsressource aus. Startet den AppHost, wartet auf die Initialisierung von Ressourcen und führt dann den angegebenen Befehl in der Umgebung der Zielressource aus. (Vorschau) Beispiele: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
es: Ejecute comandos en el contexto de un recurso de aplicación Aspire. Inicie AppHost, espere a que se inicialicen los recursos y a continuación, ejecute el comando especificado en el entorno del recurso de destino. (Versión preliminar) Ejemplos: exec de --resource api dotnet build exec de --resource api -- dotnet test --logger console exec de --start-resource worker pwsh -c "Get-Process"
fr: Exécutez des commandes dans le contexte d’une ressource d’application Aspire. Démarre l’AppHost, attend l’initialisation des ressources, puis exécute la commande spécifiée dans l’environnement de la ressource cible. (Préversion) Exemples : aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
it: Eseguire comandi nel contesto di una risorsa dell'applicazione Aspire. Avvia AppHost, attende che le risorse si inizializzino, quindi esegue il comando specificato nell'ambiente della risorsa di destinazione. (anteprima) Esempi: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
ja: Aspire アプリケーション リソースのコンテキストでコマンドを実行します。AppHost を開始し、リソースが初期化されるのを待ってから、ターゲット リソースの環境で指定されたコマンドを実行します。(プレビュー) 例: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
ko: Aspire 애플리케이션 리소스의 컨텍스트에서 명령을 실행합니다. AppHost를 시작하고 리소스가 초기화될 때까지 기다린 후, 대상 리소스 환경에서 지정된 명령을 실행합니다. (미리 보기) 예: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
pl: Wykonywanie poleceń w kontekście zasobu aplikacji Aspire. Uruchamia usługę AppHost, czeka na zainicjowanie zasobów, a następnie uruchamia określone polecenie w środowisku zasobu docelowego. (Podgląd) Przykłady: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
pt_br: Execute comandos no contexto de um recurso de aplicativo Aspire. Inicia o AppHost, espera os recursos serem inicializados e então executa o comando especificado no ambiente do recurso alvo. (Prévia) Exemplos: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
ru: Выполнение команд в контексте ресурса приложения Aspire. Запускает AppHost, ждет инициализации ресурсов, затем запускает указанную команду в среде целевого ресурса. (Предварительная версия) Примеры aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
tr: Aspire uygulama kaynağı bağlamında komutları yürütün. AppHost'u başlatır, kaynakların başlatılmasını bekler, ardından hedef kaynağın ortamında belirtilen komutu çalıştırır. (Önizleme) Örnekler: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
zh_hans: 在 Aspire 应用程序资源的上下文中执行命令。启动 AppHost，等待资源初始化，然后在目标资源的环境中运行指定的命令。(预览) 示例: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"
zh_hant: 在 Aspire 應用程式資源的內容中執行命令。啟動 AppHost，等待資源初始化，然後在目標資源的環境中執行指定的命令。(預覽) 範例: aspire exec --resource api dotnet build aspire exec --resource api -- dotnet test --logger console aspire exec --start-resource worker pwsh -c "Get-Process"

# FailedToParseCommand
source: Failed to parse the command. Ensure the command is specified after all options or after the -- separator.
cs: Nepovedlo se parsovat příkaz. Ujistěte se, že je příkaz zadán po všech parametrech nebo po oddělovači --.
de: Fehler beim Analysieren des Befehls. Stellen Sie sicher, dass der Befehl nach allen Optionen oder nach dem -- Trennzeichen angegeben wird.
es: No se pudo analizar el comando. Asegúrese de que el comando se especifica después de todas las opciones o después del separador --.
fr: Nous n’avons pas pu analyser la commande. Vérifiez que la commande est spécifiée après toutes les options ou après le séparateur --.
it: Analisi del comando non riuscita. Assicurarsi che il comando sia specificato dopo tutte le opzioni o dopo il separatore --.
ja: コマンドを解析できませんでした。すべてのオプションの後または -- 区切り記号の後にコマンドが指定されていることを確認します。
ko: 명령을 구문 분석하지 못했습니다. 명령이 모든 옵션 뒤에 또는 -- 구분 기호 뒤에 지정되어 있는지 확인하세요.
pl: Nie udało się przeanalizować polecenia. Upewnij się, że polecenie jest określone po wszystkich opcjach lub po separatorze --.
pt_br: Falha ao analisar o comando. Certifique-se de que o comando seja especificado após todas as opções ou após o separador --.
ru: Не удалось анализировать команду. Убедитесь, что команда указана после всех параметров или после разделителя --.
tr: Komut ayrıştırılamadı. Komutun tüm seçeneklerden sonra veya -- ayırıcısından sonra belirtildiğinden emin olun.
zh_hans: 无法分析命令。确保在所有选项之后或 -- 分隔符之后指定命令。
zh_hant: 無法剖析命令。請確保命令在所有選項之後或在 -- 分隔符號之後指定。

# NoCommandSpecified
source: Command is not specified.
cs: Příkaz není zadán.
de: Der Befehl wurde nicht angegeben.
es: El comando no se especificó.
fr: La commande n’est pas spécifiée.
it: Comando non specificato.
ja: コマンドが指定されていません。
ko: 명령을 지정하지 않았습니다.
pl: Nie określono polecenia.
pt_br: O comando não foi especificado.
ru: Команда не указана.
tr: Komut belirtilmedi.
zh_hans: 未指定命令。
zh_hant: 未指定命令。

# ProjectArgumentDescription
source: The path to the Aspire AppHost project file. If not specified, searches for a project file in the current directory.
cs: Cesta k souboru projektu Aspire AppHost. Pokud není zadána, vyhledá se soubor projektu v aktuálním adresáři.
de: Der Pfad zur Aspire AppHost-Projektdatei. Wenn keine Angabe erfolgt, wird im aktuellen Verzeichnis nach einer Projektdatei gesucht.
es: La ruta de acceso al archivo del proyecto host de la aplicación Aspire. Si no se especifica, se busca un archivo de proyecto en el directorio actual.
fr: Chemin d’accès au fichier projet AppHost Aspire. Si rien n’est spécifié, recherche un fichier projet dans le répertoire actif.
it: Percorso del file di un progetto AppHost di Aspire. Se non specificato, cerca un file di progetto nella directory corrente.
ja: Aspire AppHost プロセス プロジェクト ファイルへのパス。指定しない場合は、現在のディレクトリ内のプロジェクトファイルを検索します。
ko: Aspire AppHost 프로젝트 파일의 경로입니다. 지정하지 않으면 현재 디렉터리에서 프로젝트 파일을 검색합니다.
pl: Ścieżka do pliku projektu AppHost usługi Aspire. Jeżeli nie określono, wyszukuje plik projektu w bieżącym katalogu.
pt_br: O caminho para o arquivo de projeto Aspire AppHost. Se não especificado, procura por um arquivo de projeto no diretório atual.
ru: Путь к файлу проекта Aspire AppHost. Если не указано иное, ищет файл проекта в текущем каталоге.
tr: Aspire AppHost proje dosyasının yolu. Belirtilmezse, geçerli dizinde bir proje dosyası aranır.
zh_hans: Aspire AppHost 项目文件的路径。如果未指定，则在当前目录中搜索项目文件。
zh_hant: Aspire AppHost 專案檔案的路徑。如果未指定，將在目前目錄中搜尋專案檔案。

# Running
source: Running exec...
cs: Spouští se příkaz exec...
de: Ausführung wird ausgeführt...
es: Ejecutando el comando...
fr: Exécution en cours... Merci de patienter.
it: Esecuzione in corso...
ja: exec を実行しています...
ko: 실행 중...
pl: Trwa uruchamianie polecenia exec...
pt_br: Executando...
ru: Запуск исполн...
tr: Exec çalıştırılıyor...
zh_hans: 正在运行 exec...
zh_hant: 正在執行 exec...

# StartTargetResourceArgumentDescription
source: The name of the target resource to execute the command against. The command will only be executed after the target resource has successfully started and is running.
cs: Název cílového prostředku, proti kterému má být příkaz proveden. Příkaz se spustí až po úspěšném spuštění cílového prostředku.
de: Der Name der Zielressource, für die der Befehl ausgeführt werden soll. Der Befehl wird erst ausgeführt, nachdem die Zielressource erfolgreich gestartet wurde und ausgeführt wird.
es: El nombre del recurso de destino en el que se ejecutará el comando. El comando solo se ejecutará después de que el recurso de destino se haya iniciado correctamente y se esté ejecutando.
fr: Nom de la ressource cible sur laquelle exécuter la commande. La commande ne sera exécutée qu’une fois que la ressource cible aura correctement démarré et sera en cours d’exécution.
it: Nome della risorsa di destinazione rispetto al quale eseguire il comando. Il comando verrà eseguito solo dopo che la risorsa di destinazione è stata avviata correttamente ed è in esecuzione.
ja: コマンドを実行するターゲット リソースの名前。このコマンドは、ターゲットリソースが正常に起動し、実行中である後にのみ実行されます。
ko: 명령을 실행할 대상 리소스의 이름입니다. 명령은 대상 리소스가 성공적으로 시작되고 실행된 후에만 실행됩니다.
pl: Nazwa zasobu docelowego, względem którego ma zostać wykonane polecenie. Polecenie zostanie wykonane dopiero po pomyślnym uruchomieniu zasobu docelowego i jego działaniu.
pt_br: O nome do recurso alvo para executar o comando contra. O comando só será executado após o recurso alvo ter sido iniciado com sucesso e estar em execução.
ru: Имя целевого ресурса для выполнения команды. Команда будет выполнена только после успешного запуска и работы целевого ресурса.
tr: Komutun yürütüleceği hedef kaynağın adıdır. Komut, yalnızca hedef kaynak başarıyla başlatıldıktan ve çalışmaya başladıktan sonra yürütülür.
zh_hans: 要针对其执行命令的目标资源的名称。只有在目标资源成功启动并处于运行状态后，才会执行该命令。
zh_hant: 要執行命令的目標資源名稱。命令僅在目標資源成功啟動並運行後執行。

source: Stopping app host...
cs: Zastavuje se hostitel aplikací...
de: App-Host wird beendet...
es: Deteniendo el host de aplicaciones...
fr: Arrêt en cours de l’application... Merci de patienter.
it: Arresto dell'host delle app...
ja: アプリ ホストを停止しています...
ko: 앱 호스트를 중지하는 중...
pl: Trwa zatrzymywanie hosta aplikacji...
pt_br: Parando o host de aplicativo...
ru: Остановка хоста приложения...
tr: Uygulama ana işlemi durduruluyor...
zh_hans: 正在停止应用主机...
zh_hant: 正在停止主控處理程序...

# TargetResourceArgumentDescription
source: The name of the target resource to execute the command against. The command will be executed as soon as the AppHost starts, without waiting for the resource to be ready.
cs: Název cílového prostředku, proti kterému má být příkaz proveden. Příkaz se spustí ihned po spuštění AppHost, aniž by se čekalo, až bude prostředek připravený.
de: Der Name der Zielressource, für die der Befehl ausgeführt werden soll. Der Befehl wird ausgeführt, sobald der AppHost gestartet wird, ohne darauf zu warten, dass die Ressource bereit ist.
es: El nombre del recurso de destino en el que se ejecutará el comando. El comando se ejecutará en cuanto se inicie AppHost, sin tener que esperar a que el recurso esté listo.
fr: Nom de la ressource cible sur laquelle exécuter la commande. La commande est exécutée dès le démarrage de l’AppHost, sans attendre que la ressource soit prête.
it: Nome della risorsa di destinazione rispetto al quale eseguire il comando. Il comando verrà eseguito non appena AppHost si avvia, senza attendere che la risorsa sia pronta.
ja: コマンドを実行するターゲット リソースの名前。このコマンドは、リソースの準備が整うのを待たずに、AppHost が起動するとすぐに実行されます。
ko: 명령을 실행할 대상 리소스의 이름입니다. 명령은 리소스가 준비될 때까지 기다리지 않고 AppHost가 시작되는 즉시 실행됩니다.
pl: Nazwa zasobu docelowego, względem którego ma zostać wykonane polecenie. Polecenie zostanie wykonane zaraz po uruchomieniu usługi AppHost, bez oczekiwania na gotowość zasobu.
pt_br: O nome do recurso alvo para executar o comando contra. O comando será executado assim que o AppHost iniciar, sem esperar que o recurso esteja pronto.
ru: Имя целевого ресурса для выполнения команды. Команда будет выполнена сразу после запуска AppHost, не дожидаясь готовности ресурса.
tr: Komutun yürütüleceği hedef kaynağın adıdır. Komut, kaynak hazır olana kadar beklemeden AppHost başlatılır başlatılmaz yürütülür.
zh_hans: 要针对其执行命令的目标资源的名称。该命令将在 AppHost 启动后立即执行，而无需等待资源就绪。
zh_hant: 要執行命令的目標資源名稱。命令將在 AppHost 啟動後立即執行，而不會等待資源就緒。

# TargetResourceNotSpecified
source: Target resource is not specified. Use --resource or --start-resource to specify the target.
cs: Cílový prostředek není zadaný. K určení cíle použijte --resource nebo --start-resource.
de: Die Zielressource wurde nicht angegeben. Verwenden Sie „--resource“ oder „--start-resource“, um das Ziel anzugeben.
es: No se especificó el recurso de destino. Use --resource o --start-resource para especificar el destino.
fr: La ressource cible n’est pas spécifiée. Utilisez --resource ou --start-resource pour spécifier la cible.
it: La risorsa di destinazione non è specificata. Utilizzare --resource o --start-resource per specificare la destinazione.
ja: ターゲット リソースが指定されていません。ターゲットを指定するには、--resource または --start-resource を使用します。
ko: 대상 리소스가 지정되지 않았습니다. --resource 또는 --start-resource를 사용하여 대상을 지정합니다.
pl: Nie określono zasobu docelowego. Użyj polecenia --resource lub --start-resource, aby określić cel.
pt_br: O recurso alvo não foi especificado. Use --resource ou --start-resource para especificar o alvo.
ru: Целевой ресурс не указан. Используйте --resource или --start-resource для указания цели.
tr: Hedef kaynak belirtilmedi. Hedefi belirtmek için --resource veya --start-resource kullanın.
zh_hans: 未指定目标资源。使用 --resource 或 --start-resource 指定目标。
zh_hant: 未指定目標資源。請使用 --resource 或 --start-resource 來指定目標。

# WorkdirArgumentDescription
source: The working directory to execute the command in.
cs: Pracovní adresář, ve kterém se má příkaz spustit
de: Das Arbeitsverzeichnis, in dem der Befehl ausgeführt wird.
es: Directorio de trabajo en el que se va a ejecutar el comando.
fr: Répertoire de travail dans lequel exécuter la commande.
it: La directory di lavoro in cui eseguire il comando.
pl: Katalog roboczy, w którym ma zostać wykonane polecenie.
pt_br: O diretório de trabalho no qual executar o comando.
ru: Рабочий каталог, в котором будет выполнена команда.
