Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/InitCommandStrings.*.xlf
Languages: cs, de, es, it, ko, pl, pt_br, ru, zh_hans, zh_hant

source: Adding AppHost project to solution...
cs: Přidává se projekt AppHost do řešení...
de: AppHost-Projekt wird der Lösung hinzugefügt …
es: Agregando el proyecto AppHost a la solución...
it: Aggiunta del progetto AppHost alla soluzione in corso...
ko: 솔루션에 AppHost 프로젝트를 추가하는 중...
pl: Trwa dodawanie projektu AppHost do rozwiązania...
pt_br: Adicionando o projeto AppHost à solução...
ru: Добавление проекта AppHost в решение...
zh_hans: 正在将 AppHost 项目添加到解决方案中...
zh_hant: 正在將 AppHost 專案新增至解決方案...

source: Adding projects to solution...
cs: Přidávání projektů do řešení...
de: Projekte werden der Lösung hinzugefügt …
es: Agregando proyectos a la solución...
it: Aggiunta di progetti alla soluzione in corso...
ko: 솔루션에 프로젝트를 추가하는 중...
pl: Trwa dodawanie projektów do rozwiązania...
pt_br: Adicionando projetos à solução...
ru: Добавление проектов в решение...
zh_hans: 正在将项目添加到解决方案中...
zh_hant: 正在將專案新增至解決方案...

source: Adding ServiceDefaults project to solution...
cs: Přidává se projekt ServiceDefaults do řešení...
de: ServiceDefaults-Projekt wird der Lösung hinzugefügt …
es: Agregando el proyecto ServiceDefaults a la solución...
it: Aggiunta del progetto ServiceDefaults alla soluzione in corso...
ko: 솔루션에 ServiceDefaults 프로젝트를 추가하는 중...
pl: Trwa dodawanie projektu ServiceDefaults do rozwiązania...
pt_br: Adicionando o projeto ServiceDefaults à solução...
ru: Добавление проекта ServiceDefaults в решение...
zh_hans: 正在将 ServiceDefaults 项目添加到解决方案中...
zh_hant: 正在將 ServiceDefaults 專案新增至解決方案...

source: Aspire initialization complete!
cs: Inicializace Aspire se dokončila!
de: Die Initialisierung von Aspire ist abgeschlossen!
es: Se ha completado la inicialización de Aspire.
it: Inizializzazione di Aspire completata.
ko: Aspire 초기화 완료
pl: Inicjalizacja Aspire została zakończona.
pt_br: Inicialização do Aspire concluída!
ru: Инициализация Aspire завершена!
zh_hans: Aspire 初始化完成!
zh_hant: Aspire 初始化完成!

source: Creating AppHost project...
cs: Vytváří se projekt AppHost...
de: AppHost-Projekt wird erstellt …
es: Creando proyecto AppHost...
it: Creazione del progetto AppHost in corso...
ko: AppHost 프로젝트를 만드는 중...
pl: Trwa tworzenie projektu AppHost...
pt_br: Criando o projeto AppHost...
ru: Создание проекта AppHost...
zh_hans: 正在创建 AppHost 项目...
zh_hant: 正在建立 AppHost 專案...

source: Creating ServiceDefaults project...
cs: Vytváří se projekt ServiceDefaults...
de: ServiceDefaults-Projekt wird erstellt …
es: Creando proyecto ServiceDefaults...
it: Creazione del progetto ServiceDefaults in corso...
ko: ServiceDefaults 프로젝트를 만드는 중...
pl: Trwa tworzenie projektu ServiceDefaults...
pt_br: Criando o projeto ServiceDefaults...
ru: Создание проекта ServiceDefaults...
zh_hans: 正在创建 ServiceDefaults 项目...
zh_hant: 正在建立 ServiceDefaults 專案...

# Description
source: Initialize Aspire support in an existing solution or create a single-file AppHost.
cs: Inicializujte podporu Aspire v existujícím řešení nebo vytvořte AppHost s jedním souborem.
de: Initialisieren der Unterstützung von Aspire in einer vorhandenen Lösung, oder Erstellen einen AppHosts mit nur einer Datei.
es: Inicializa la compatibilidad con Initialize en una solución existente o crea un AppHost de un solo archivo.
it: Inizializzare il supporto Aspire in una soluzione esistente o creare un AppHost a file singolo.
ko: 기존 솔루션에서 Aspire 지원을 초기화하거나 단일 파일 AppHost를 만듭니다.
pl: Zainicjuj obsługę Aspire w istniejącym rozwiązaniu lub utwórz AppHost składający się z jednego pliku.
pt_br: Ative o suporte ao Aspire em uma solução existente ou crie um AppHost de arquivo único.
ru: Инициализируйте поддержку Aspire в существующем решении или создайте однофайловый AppHost.
zh_hans: 在现有解决方案中初始化 Aspire 支持，或创建单文件 AppHost。
zh_hant: 將現有解決方案中的 Aspire 支援初始化，或建立單一檔案 AppHost。

# MultipleSolutionsFound
source: Multiple solution files found. Please select which one to add the Aspire projects to:
cs: Bylo nalezeno více souborů řešení. Vyberte, do kterého projektu Aspire chcete přidat:
de: Es wurden mehrere Lösungsdateien gefunden. Wählen Sie das Projekt aus, dem die Aspire-Projekte hinzugefügt werden sollen:
es: Se encontraron varios archivos de solución. Seleccione a cuál desea agregar los proyectos de Aspire:
it: Trovati più file di soluzione. Selezionare a quale aggiungere i progetti Aspire:
ko: 여러 솔루션 파일을 찾았습니다. Aspire 프로젝트를 추가할 항목을 선택하세요.
pl: Znaleziono wiele plików rozwiązań. Wybierz projekt, do którego ma zostać dodany projekt Prześlij projekty:
pt_br: Vários arquivos de solução foram encontrados. Selecione a qual deles você quer adicionar os projetos do Aspire:
ru: Найдено несколько файлов решений. Выберите, к какому из них добавить проекты Aspire:
zh_hans: 找到多个解决方案文件。请选择要将 Aspire 项目添加到哪个解决方案:
zh_hant: 找到多個解決方案檔案。請選取要新增 Aspire 專案的項目:

# NoSolutionFoundCreatingSingleFileAppHost
source: No solution file found. Creating single-file AppHost...
cs: Nenašel se žádný soubor řešení. Vytváří se AppHost s jedním souborem...
de: Keine Lösungsdatei gefunden. AppHost mit einzelner Datei wird erstellt …
es: No se encontró ningún archivo de solución. Creando AppHost de un solo archivo...
it: Nessun file di soluzione trovato. Creazione di AppHost a file singolo in corso...
ko: 솔루션 파일을 찾을 수 없습니다. 단일 파일 AppHost를 만드는 중...
pl: Nie znaleziono pliku rozwiązania. Trwa tworzenie hosta aplikacji (AppHost) z jednym plikiem...
pt_br: Não há arquivos de solução abertos. Criando o AppHost de arquivo único...
ru: Файл решения не найден. Создание однофайлового AppHost...
zh_hans: 找不到解决方案文件。正在创建单文件 AppHost...
zh_hant: 找不到解決方案檔案。正在建立單一檔案 AppHost...

# SolutionDetected
source: Solution detected: {0}
cs: Zjištěné řešení: {0}
de: Lösung erkannt: {0}
es: Solución detectada: {0}
it: Soluzione rilevata: {0}
ko: 솔루션 검색됨: {0}
pl: Wykryto rozwiązanie: {0}
pt_br: Solução detectada: {0}
ru: Обнаружено решение: {0}
zh_hans: 检测到解决方案: {0}
zh_hant: 偵測到的解決方案: {0}

# SolutionAlreadyInitialized
source: Solution has already been initialized with Aspire.
cs: Řešení se už inicializovalo pomocí Aspire.
de: Die Lösung wurde bereits mit Aspire initialisiert.
es: La solución ya está inicializada con Aspire.
it: La soluzione è già stata inizializzata con Aspire.
ko: 솔루션이 이미 Aspire로 초기화되었습니다.
pl: Rozwiązanie zostało już zainicjowane za pomocą narzędzia Prześlij.
pt_br: A solução já foi inicializada com o Aspire.
ru: Решение уже инициализировано с помощью Aspire.
zh_hans: 解决方案已使用 Aspire 初始化。
zh_hant: 解決方案已隨著 Aspire 初始化。
