Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/InteractionServiceStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, zh_hant

# AppHostConnectionLost
source: The connection to the app host was lost: {0}.
ru: Потеряно подключение к узлу приложения: {0}.

# AppHostNotCompatibleConsiderUpgrading
source: The AppHost version is not compatible. Please upgrade the apphost or Aspire CLI.
cs: Verze AppHost není kompatibilní. Upgradujte prosím hostitele aplikací nebo rozhraní příkazového řádku Aspire.
de: Die AppHost-Version ist nicht kompatibel. Aktualisieren Sie den AppHost oder die Aspire-CLI.
fr: La version de l’AppHost n’est pas compatible. Veuillez mettre à jour l’AppHost ou l’interface CLI Aspire.
ja: AppHost のバージョンに互換性がありません。AppHost または Aspire CLI をアップグレードしてください。
ko: AppHost 버전이 호환되지 않습니다. AppHost 또는 Aspire CLI를 업그레이드해 주세요.
pl: Wersja hosta AppHost jest niezgodna. Uaktualnij hosta AppHost lub interfejs wiersza polecenia platformy Aspire.
pt_br: A versão do AppHost não é compatível. Atualize o apphost ou o Aspire CLI.
ru: Версия AppHost несовместима. Обновите хост приложений или Aspire CLI.
zh_hant: 應用程式主機版本不相容。請升級應用程式主機或 Aspire CLI。

source: Aspire CLI Version
cs: Verze Aspire CLI
es: Versión de la CLI de Aspire
fr: Version de l’interface CLI Aspire
it: Versione dell'interfaccia della riga di comando Aspire
ja: Aspire CLI バージョン
ko: Aspire CLI 버전
pl: Wersja interfejsu wiersza polecenia platformy Aspire
pt_br: Versão da CLI do Aspire
ru: Версия CLI Aspire
zh_hant: Aspire CLI 版本

# AspireHostingSDKVersion
source: Aspire.Hosting Version
cs: Verze Aspire.Hosting
de: Apsire.Hosting-Version
es: Versión de Aspire.Hosting
fr: Version d’Aspire.Hosting
it: Versione di Aspire.Hosting
ja: Aspire.Hosting バージョン
ko: Aspire.Hosting 버전
pl: Wersja Aspire.Hosting
pt_br: Versão do Aspire.Hosting
ru: Версия Aspire.Hosting
zh_hant: Aspire.Hosting 版本

source: Building apphost...
cs: Vytváří se hostitel aplikací...
de: AppHost wird erstellt...
fr: Génération de l’AppHost…
ja: Apphost をビルドしています...
ko: apphost를 빌드하는 중...
pl: Trwa tworzenie hosta AppHost...
pt_br: Criando apphost...
ru: Создание хоста приложений...
zh_hant: 正在建置應用程式主機...

source: Checking certificates...
cs: Kontrolují se certifikáty...
de: Zertifikate werden überprüft...
es: Comprobando certificados...
fr: Vérification des certificats...
it: Controllo dei certificati in corso...
ja: 証明書を確認しています...
ko: 인증서를 확인하는 중...
pl: Sprawdzanie certyfikatów...
pt_br: Verificando certificados...
ru: Выполняется проверка сертификатов...
zh_hant: 正在檢查憑證...

source: Checking project type...
cs: Kontroluje se typ projektu...
de: Projekttyp wird überprüft...
es: Comprobando el tipo de proyecto...
fr: Vérification du type de projet...
it: Controllo del tipo di progetto in corso...
ja: プロジェクト タイプを確認しています...
ko: 프로젝트 형식을 확인하는 중...
pl: Sprawdzanie typu projektu...
pt_br: Verificando o tipo de projeto...
ru: Производится проверка типа проекта...
zh_hant: 正在檢查專案類型...

# CreatedSettingsFile
source: Created settings file at {0}.
cs: Byl vytvořen soubor nastavení v cestě {0}.
de: Die Einstellungsdatei wurde unter {0} erstellt.
es: Archivo de configuración creado en {0}.
fr: Fichier de paramètres créé dans {0}.
it: File di impostazioni creato in {0}.
ja: {0} で設定ファイルを作成しました。
ko: {0}에 설정 파일을 만들었습니다.
pl: Utworzono plik ustawień w {0}.
pt_br: Arquivo de configurações criado em {0}.
ru: Файл настроек создан по адресу {0}.
zh_hant: 已在 {0} 建立設定檔案。

# CustomChoiceLabel
source: Other (specify next)
cs: Jiné (zadejte další)
de: Sonstiges (als Nächstes angeben)
fr: Autre (précisez ci-dessous)
ja: その他 (次に指定)
ko: 기타(다음에 지정)
pl: Inne (określ następny)
pt_br: Outros (especifique o próximo)
ru: Другое (укажите далее)
zh_hant: 其他 (指定下一個)

source: Dashboard
cs: Řídicí panel
es: Panel
fr: Tableau de bord
ja: ダッシュボード
ko: 대시보드
pl: Pulpit nawigacyjny
pt_br: Painel
ru: Панель мониторинга
zh_hant: 儀表板

# DirectLink
source: Direct
cs: Přímé
de: Direkt
es: Directo
it: Diretto
ja: ダイレクト
ko: 직접
pl: Bezpośredni
pt_br: Direto
ru: Прямой
zh_hant: 直接

# ErrorConnectingToAppHost
source: An error occurred while connecting to the app host. The app host possibly crashed before it was available: {0}.
cs: Při připojování k hostiteli aplikací došlo k chybě. Pravděpodobně došlo k chybovému ukončení hostitele aplikací před tím, než byl k dispozici: {0}.
de: Fehler beim Herstellen einer Verbindung mit dem App-Host. Der App-Host ist möglicherweise abgestürzt, bevor er verfügbar war: {0}.
es: Se produjo un error al conectarse al host de aplicaciones. Es posible que el host de la aplicación se haya bloqueado antes de que estuviera disponible: {0}.
fr: Une erreur s’est produite lors de la connexion à l’hôte d’application. L’hôte d’application s’est peut-être bloqué avant qu’il ne soit disponible : {0}.
ja: アプリ ホスティング プロセスへの接続でエラーが発生しました。アプリ ホスティング プロセスが、利用可能になる前にクラッシュした可能性があります: {0}。
ko: 앱 호스트에 연결하는 동안 오류가 발생했습니다. 앱 호스트가 사용 가능하기 전에 충돌했을 수 있음: {0}.
pl: Wystąpił błąd podczas nawiązywania połączenia z hostem aplikacji. Host aplikacji prawdopodobnie uległ awarii, zanim był dostępny: {0}.
pt_br: Erro ao se conectar ao host de aplicativo. O host de aplicativo possivelmente falhou antes de estar disponível: {0}.
ru: При подключении к хосту приложений возникла ошибка. Возможно, хост приложения аварийно завершил работу до того, как стал доступен: {0}.
zh_hant: 連接到應用程式主機時發生錯誤。應用程式主機可能在可用之前當機: {0}。

source: Finding apphosts...
cs: Hledají se hostitelé aplikací...
de: AppHosts werden gesucht...
fr: Recherche des AppHosts…
ja: Apphost を検索しています...
ko: apphost를 찾는 중...
pl: Trwa znajdowanie hostów AppHost...
pt_br: Localizando apphosts...
ru: Поиск хостов приложений...
zh_hant: 正在尋找應用程式主機...

# InteractiveInputNotSupported
source: Interactive input is not supported in this environment. Use the --non-interactive flag or ensure the CLI is running in an interactive terminal.
cs: Interaktivní vstup se v tomto prostředí nepodporuje. Použijte příznak --non-interactive nebo zajistěte, aby rozhraní příkazového řádku běželo v interaktivním terminálu.
de: Interaktive Eingaben werden in dieser Umgebung nicht unterstützt. Verwenden Sie das Flag „--non-interactive“, oder stellen Sie sicher, dass die CLI in einem interaktiven Terminal ausgeführt wird.
fr: La saisie interactive n'est pas prise en charge dans cet environnement. Utilisez l’indicateur --non-interactive ou assurez-vous que la CLI s’exécute dans un terminal interactif.
ja: 対話型入力は、この環境ではサポートされていません。--non-interactive フラグを使用するか、CLI が対話型ターミナルで実行されていることを確認してください。
ko: 이 환경에서는 대화형 입력이 지원되지 않습니다. --non-interactive 플래그를 사용하거나 CLI가 대화형 터미널에서 실행되고 있는지 확인합니다.
pl: Interakcyjne dane wejściowe nie są obsługiwane w tym środowisku. Użyj flagi --non-interactive lub upewnij się, że interfejs wiersza polecenia jest uruchomiony w terminalu interaktywnym.
ru: Интерактивный ввод не поддерживается в этой среде. Используйте флаг --non-interactive или убедитесь, что CLI запущен в интерактивном терминале.
zh_hant: 此環境不支援互動輸入。請使用 --non-interactive 旗標，或確保 CLI 在互動終端中執行。

# MoreInfoNewCliVersion
source: [dim]For more information, see: [link]{0}[/][/]
cs: [dim]Další informace najdete tady: [link]{0}[/][/]
de: [dim]Weitere Informationen finden Sie unter: [Link]{0}[/][/]
fr: Pour découvrir plus d’informations, consultez : [lien]{0}[/][/]
ja: [暗い]詳細については、次を参照してください: [link]{0}[/][/]
ko: [dim]자세한 내용은 [link]{0}[/][/]을(를) 참조하세요.
pl: [dim]Aby uzyskać więcej informacji, zobacz: [link]{0}[/][/]
pt_br: [dim]Para obter mais informações, consulte: [link]{0}[/][/]
ru: [dim]Дополнительные сведения: [link]{0}[/][/]
zh_hant: [dim]如需詳細資訊，請參閱: [link]{0}[/][/]

# NewCliVersionAvailable
source: [yellow]A new version of the Aspire CLI is available: {0}[/]
cs: [yellow]K dispozici je nová verze rozhraní příkazového řádku Aspire: {0}[/]
de: [yellow]Eine neue Version der Aspire-CLI ist verfügbar: {0}[/]
fr: [jaune]Une nouvelle version de l’interface CLI Aspire est disponible : {0}[/]
ja: [黄色]Aspire CLI の新しいバージョンが利用可能です: {0}[/]
ko: [yellow]새 버전의 Aspire CLI {0}[/]을(를) 사용할 수 있습니다.
pl: [yellow]Dostępna jest nowa wersja interfejsu wiersza polecenia Aspire: {0}[/]
pt_br: [yellow]Uma nova versão da CLI do Aspire está disponível: {0}[/]
ru: [yellow]Доступна новая версия Aspire CLI: {0}[/]
zh_hant: [yellow]有新版的 Aspire CLI 可供使用: {0}[/]

# NoItemsAvailableForSelection
source: No items available for selection: {0}
cs: Nejsou k dispozici žádné položky pro výběr: {0}
de: Es sind keine Elemente zur Auswahl verfügbar: {0}
es: No hay elementos disponibles para la selección: {0}
fr: Aucun élément disponible pour la sélection : {0}
it: Nessun elemento disponibile per la selezione: {0}
ja: 選択できる項目がありません: {0}
ko: 선택할 수 있는 항목 없음: {0}
pl: Brak dostępnych elementów do wyboru: {0}
pt_br: Nenhum item disponível para seleção: {0}
ru: Нет элементов, доступных для выбора: {0}
zh_hant: 沒有可供選取的項目: {0}

# OperationCancelled
source: The operation was canceled.
cs: Operace byla zrušena.
de: Der Vorgang wurde abgebrochen.
es: Operación cancelada.
fr: L’opération a été annulée.
it: L'operazione è stata annullata.
ja: 操作は取り消されました。
ko: 작업이 취소되었습니다.
pl: Operacja została anulowana.
pt_br: A operação foi cancelada.
ru: Операция была отменена.
zh_hant: 已取消作業。

# ProjectCouldNotBeBuilt
source: The project could not be built. For more information run with --debug switch.
cs: Projekt se nepovedlo sestavit. Další informace získáte spuštěním s přepínačem --debug.
de: Das Projekt konnte nicht erstellt werden. Weitere Informationen erhalten Sie, wenn Sie mit dem Schalter „--debug“ ausführen.
es: No se pudo compilar el proyecto. Para obtener más información, ejecute con el modificador --debug.
fr: Le projet n’a pas pu être généré. Pour plus d’informations, exécutez avec le commutateur --debug.
it: Non è possibile compilare il progetto. Per altre informazioni, eseguire con l'opzione --debug.
ja: プロジェクトをビルドできませんでした。詳細については、--debug スイッチを使用し実行してください。
ko: 프로젝트를 빌드할 수 없습니다. 자세한 내용을 보려면 --debug 스위치를 이용하여 실행하세요.
pl: Nie można skompilować projektu. Aby uzyskać więcej informacji, uruchom polecenie przełącznika --debug.
pt_br: O projeto não pôde ser compilado. Para obter mais informações, execute com a opção --debug.
ru: Не удалось выполнить сборку проекта. Для получения дополнительных сведений запустите команду с параметром --debug.
zh_hant: 無法建置專案。如需詳細資訊，請使用 --debug 切換執行。

# ProjectOptionDoesntExist
source: The --project option specified a project that does not exist.
cs: Parametr --project určil projekt, který neexistuje.
de: Die Option „--project“ hat ein Projekt angegeben, das nicht vorhanden ist.
es: La opción --project especificó un proyecto que no existe.
fr: L’option --project spécifiait un projet qui n’existe pas.
it: L'opzione --project ha specificato un progetto che non esiste.
ja: --project オプションで、存在しないプロジェクトが指定されています。
ko: --project 옵션에서 존재하지 않는 프로젝트를 지정했습니다.
pl: Opcja --project określiła projekt, który nie istnieje.
pt_br: A opção --project especificou um projeto que não existe.
ru: В параметре --project указан несуществующий проект.
zh_hant: --project 選項指定的專案不存在。

# ProjectOptionNotSpecifiedMultipleAppHostsFound
source: The --project option was not specified and multiple app host project files were detected.
cs: Nebyl zadán parametr --project a bylo zjištěno více souborů projektu hostitele aplikací.
de: Die Option „--project“ wurde nicht angegeben, und es wurden mehrere App-Hostprojektdateien erkannt.
es: No se especificó la opción --project y se detectaron varios archivos de proyecto de host de aplicaciones.
fr: L’option --project n’a pas été spécifiée et plusieurs fichiers de projet d’hôte d’application ont été détectés.
ja: --project オプションが指定されておらず、アプリ ホスティング プロセスのプロジェクト ファイルが複数検出されました。
ko: --project 옵션이 지정되지 않았고 앱 호스트 프로젝트 파일이 여러 개 감지되었습니다.
pl: Nie określono opcji --project i wykryto wiele plików projektu hosta aplikacji.
pt_br: A opção --project não foi especificada e vários arquivos de projeto de host do aplicativo foram detectados.
ru: Параметр --project не был указан, и было обнаружено несколько файлов проекта хоста приложений.
zh_hant: 未指定 --project 選項，且偵測到多個應用程式主機專案檔案。

# ProjectOptionNotSpecifiedNoCsprojFound
source: The project argument was not specified and no app host project files were detected.
cs: Nebyl zadán argument projektu a nebyly zjištěny žádné soubory projektů hostitele aplikace.
de: Das Projektargument wurde nicht angegeben, und es wurden keine App-Hostprojektdateien erkannt.
fr: L’argument de projet n’a pas été spécifié et aucun fichier *.csproj n’a été détecté.
pl: Nie określono argumentu projektu i nie wykryto plików projektu hosta aplikacji.
ru: Аргумент проекта не указан. Не найдены файлы проекта узла приложений.
zh_hant: 未指定專案引數，且未偵測到任何 *.csproj 檔案。

source: Required Capability
cs: Požadovaná funkce
de: Erforderliche Funktion
es: Funcionalidad requerida
fr: Capacité requise
it: Funzionalità richiesta
ja: 必要な機能
ko: 필수 기능
pl: Wymagana możliwość
pt_br: Funcionalidade Necessária
ru: Нужная возможность
zh_hant: 必要的功能

# SearchingProjects
source: Searching...
cs: Vyhledávání…
de: Suche wird ausgeführt...
es: Buscando...
fr: Recherche en cours...
it: Ricerca in corso...
ja: 検索しています...
ko: 검색 중...
pl: Trwa wyszukiwanie...
pt_br: Pesquisando...
ru: Выполняется поиск...
zh_hant: 正在搜尋...

# SelectAppHostToUse
source: Select an apphost to use:
cs: Vyberte hostitele aplikací, kterého chcete použít:
de: AppHost zur Verwendung auswählen:
fr: Sélectionnez un AppHost à utiliser :
ja: 使用する Apphost を選択してください:
ko: 사용할 apphost를 선택하세요:
pl: Wybierz hosta AppHost do użycia:
pt_br: Selecione um apphost a ser usado:
ru: Выберите хост приложений для использования:
zh_hant: 選擇要使用的應用程式主機:

# SpecifiedProjectFileNotAppHostProject
source: The specified project file is not an Aspire AppHost project.
cs: Zadaný soubor projektu není projekt Aspire AppHost.
de: Die angegebene Projektdatei ist kein Aspire-AppHost-Projekt.
fr: Le fichier projet spécifié n’est pas un projet Aspire AppHost.
ja: 指定されたプロジェクト ファイルは、Aspire AppHost のプロジェクトではありません。
ko: 지정한 프로젝트 파일은 Aspire AppHost 프로젝트가 아닙니다.
pl: Określony plik projektu nie jest projektem hosta AppHost platformy Aspire.
pt_br: O arquivo de projeto especificado não é um projeto Aspire AppHost.
ru: Указанный файл проекта не является проектом Aspire AppHost.
zh_hant: 指定的專案檔案不是 Aspire 應用程式主機專案。

source: Stopping Aspire.
cs: Zastavuje se Aspire.
de: Aspire wird beendet.
es: Deteniendo Aspire.
fr: Arrêt d’Aspire.
it: Arresto di Aspire.
ja: Aspire を停止しています。
ko: Aspire를 중지하는 중입니다.
pl: Zatrzymywanie platformy Aspire.
pt_br: Interrompendo o Aspire.
ru: Производится остановка Aspire.
zh_hant: 正在停止 Aspire。

# ToUpdateRunCommand
source: [dim]To update, run: {0}[/]
cs: [dim]Pro aktualizaci spusťte: {0}[/]
de: [dim]Zum Aktualisieren diesen Befehl ausführen: {0}[/]
fr: [dim]Pour mettre à jour, exécutez : {0}[/]
pl: [dim]Aby zaktualizować, uruchom: {0}[/]
ru: [dim]Для обновления выполните: {0}[/]
zh_hant: [dim]若要更新，請執行: {0}[/]

source: Trusting certificates...
cs: Vytváří se vztah důvěryhodnosti k certifikátům...
de: Zertifikate werden als vertrauenswürdig eingestuft...
es: Confiar en certificados...
fr: Approbation des certificats...
it: Conferma dell'attendibilità dei certificati in corso...
ja: 証明書の信頼を処理中です...
ko: 인증서를 신뢰하는 중...
pl: Ufanie certyfikatom...
pt_br: Confiando nos certificados...
ru: Выполняется доверие сертификатам...
zh_hant: 信任憑證...

# UnbuildableAppHostsDetected
source: No app hosts were found (there may be app hosts project files with syntax errors/invalid SDK versions).
cs: Nenašli se žádní hostitelé aplikací (je možné, že aplikace hostuje soubory projektu s chybami syntaxe nebo neplatnými verzemi sady SDK).
de: Es wurden keine App-Hosts gefunden (möglicherweise gibt es App-Host-Projektdateien mit Syntaxfehlern/ungültigen SDK-Versionen).
fr: Aucun hôte d’application n’a été trouvé (il peut y avoir des fichiers de projet d’hôtes d’application contenant des erreurs de syntaxe ou des versions de SDK non valides).
ja: アプリ ホストが見つかりませんでした (構文エラーがあるか SDK バージョンが無効であるアプリ ホスト プロジェクト ファイルが存在する可能性があります)。
ko: 앱 호스트를 찾을 수 없습니다 (구문 오류나 잘못된 SDK 버전이 있는 앱 호스트 프로젝트 파일이 있을 수 있습니다).
pl: Nie znaleziono hostów aplikacji (mogą istnieć pliki projektu hostów aplikacji z błędami składni/nieprawidłowymi wersjami zestawu SDK).
pt_br: Nenhum host de aplicativo foi encontrado (pode haver arquivos de projeto de hosts de aplicativos com erros de sintaxe/versões inválidas do SDK).
ru: Хосты приложений не найдены (возможно, есть файлы проектов хостов приложений с синтаксическими ошибками или недопустимыми версиями SDK).
zh_hant: 找不到應用程式主機 (可能有應用程式主機專案檔案具有語法錯誤/無效的 SDK 版本)。

# UnexpectedErrorOccurred
source: An unexpected error occurred: {0}
cs: Došlo k neočekávané chybě: {0}
de: Ein unerwarteter Fehler ist aufgetreten: {0}
es: Se ha producido un error inesperado: {0}
fr: Une erreur inattendue est survenue : {0}
it: Si è verificato un errore imprevisto: {0}
ja: 予期しないエラーが発生しました: {0}
ko: 예기치 않은 오류가 발생했습니다. {0}
pl: Wystąpił nieoczekiwany błąd: {0}
pt_br: Ocorreu um erro inesperado: {0}
ru: Возникла непредвиденная ошибка: {0}
zh_hant: 發生未預期的錯誤: {0}

# WaitingForDebuggerToAttachToAppHost
source: Waiting for debugger to attach to app host process
cs: Čeká se na připojení ladicího programu k procesu hostitele aplikací.
de: Es wird darauf gewartet, dass der Debugger an den App-Hostprozess angefügt wird.
es: Esperando a que el depurador se conecte al proceso del host de aplicaciones
fr: En attente de l’attachement du débogueur au processus de l’hôte d’application
ja: デバッガーがアプリ ホスティング プロセスにアタッチされるのを待機しています
ko: 디버거가 앱 호스트 프로세스에 연결되기를 기다리는 중
pl: Oczekiwanie na dołączenie debugera do procesu hosta aplikacji
pt_br: Aguardando que o depurador seja anexado ao processo de host do aplicativo
ru: Ожидание подключения отладчика к процессу хоста приложения
zh_hant: 正在等候偵錯工具連結到應用程式主機流程

# ProjectOptionNotSpecifiedNoCsprojFound
source: The project argument was not specified and no *.csproj files were detected.
es: No se especificó el argumento del proyecto y no se detectaron archivos *.csproj.
it: L'argomento del progetto non è stato specificato e non sono stati rilevati file *.csproj.
ja: プロジェクトで引数が指定されておらず、*.csproj ファイルが検出されませんでした。
ko: 프로젝트 인수가 지정되지 않았고 *.csproj 파일이 감지되지 않았습니다.
pt_br: O argumento do projeto não foi especificado e nenhum arquivo *.csproj foi detectado.

# AppHostNotCompatibleConsiderUpgrading
source: The app host is not compatible. Consider upgrading the app host or Aspire CLI.
es: El host de aplicaciones no es compatible. Considere actualizar el host de aplicaciones o la CLI de Aspire.

source: Building app host...
es: Compilando host de aplicaciones...

source: Finding app hosts...
es: Buscando hosts de aplicaciones...

source: Select app host to run
es: Seleccionar host de aplicación para ejecutar

# SpecifiedProjectFileNotAppHostProject
source: The specified project file is not an Aspire app host project.
es: El archivo de proyecto especificado no es un proyecto de host de aplicaciones de Aspire.

# AppHostNotCompatibleConsiderUpgrading
source: The Apphost is not compatible. Consider upgrading the Apphost or Aspire CLI.
it: L'host delle app non è compatibile. Prendi in considerazione l'aggiornamento dell'host delle app o dell'interfaccia della riga di comando Aspire.

source: Building Apphost...
it: Creazione dell'host delle app in corso...

# ErrorConnectingToAppHost
source: An error occurred while connecting to the Apphost. The Apphost possibly crashed before it was available: {0}.
it: Si è verificato un errore durante la connessione all'host delle app. È possibile che l'host delle app si sia arrestato in modo anomalo prima che fosse disponibile: {0}.

source: Finding Apphosts...
it: Ricerca degli host delle app in corso...

# ProjectOptionNotSpecifiedMultipleAppHostsFound
source: The --project option was not specified and multiple Apphost project files were detected.
it: L'opzione --project non è stata specificata e sono stati rilevati più file di progetto host delle app.

source: Select Apphost to run
it: Seleziona l'host delle app da eseguire

# SpecifiedProjectFileNotAppHostProject
source: The specified project file is not an Aspire Apphost project.
it: Il file di progetto specificato non è un progetto host delle app.

# WaitingForDebuggerToAttachToAppHost
source: Waiting for debugger to attach to Apphost process
it: In attesa del collegamento del debugger al processo dell'host delle app
