Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/LogsCommandStrings.*.xlf
Languages: cs, de, fr, it, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AppHostNotRunning
source: No running AppHost found. Use 'aspire run' to start one first.
cs: Nenašel se žádný spuštěný hostitel aplikací. Nejprve spusťte spuštění pomocí příkazu „aspire run“.
de: Es wurde kein aktiver AppHost gefunden. Verwenden Sie zuerst „aspire run“, um einen zu starten.
fr: Désolé, aucun AppHost en cours d’exécution n’a été trouvé. Utilisez « aspire run » pour en démarrer un.
it: Non è stato trovato alcun AppHost in esecuzione. Usare prima di tutto "aspire run" per avviarne uno.
ko: 실행 중인 AppHost를 찾을 수 없습니다. 'aspire run'을 사용하여 먼저 하나를 시작합니다.
pl: Nie znaleziono uruchomionego hosta aplikacji. Najpierw uruchom go poleceniem „aspire run”.
pt_br: Nenhum AppHost em execução encontrado. Use "aspire run" para iniciar um primeiro.
ru: Запущенные хосты приложений не найдены. Сначала запустите один из них с помощью команды "aspire run".
tr: Çalışan AppHost bulunamadı. Önce birini başlatmak için 'aspire run' komutunu kullanın.
zh_hans: 找不到正在运行的 AppHost。请先使用 "aspire run" 启动一个。
zh_hant: 找不到正在執行的 AppHost。請先使用 'aspire run' 啟動一個。

# Description
source: Display logs from resources in a running apphost.
cs: Umožňuje zobrazit protokoly z prostředků v běžícím hostiteli aplikací Aspire.
pl: Wyświetl dzienniki z zasobów w działającym hoście usługi Aspire.
pt_br: Exiba logs de recursos em um apphost do Aspire em execução.
ru: Отображать журналы ресурсов в запущенном хосте приложений Aspire.
zh_hans: 显示正在运行的 Aspire 应用主机中资源的日志。
zh_hant: 顯示正在執行 Aspire Apphost 中的資源記錄。

# FollowOptionDescription
source: Stream logs in real-time as they are written.
cs: Streamujte protokoly v reálném čase při jejich zápisu.
de: Streamen Sie Protokolle in Echtzeit, während sie geschrieben werden.
fr: Diffuser les journaux en temps réel au fur et à mesure de leur écriture.
it: Consente di trasmettere i log in tempo reale man mano che vengono scritti.
ko: 로그가 기록되는 대로 실시간으로 스트리밍합니다.
pl: Przesyłaj dzienniki w czasie rzeczywistym podczas ich zapisywania.
pt_br: Transmita logs em tempo real conforme eles são gravados.
ru: Потоковая передача журналов в реальном времени по мере их записи.
tr: Günlükleri yazıldıkça gerçek zamanlı olarak akışla aktar.
zh_hans: 在写入日志时实时流式传输这些日志。
zh_hant: 在寫入記錄時即時串流這些記錄。

# JsonOptionDescription
source: Output format (Table or Json).
cs: Výstupní protokoly ve formátu JSON (NDJSON).
pl: Dzienniki wyjściowe w formacie JSON (NDJSON).
pt_br: Logs de saída no formato JSON (NDJSON).
ru: Вывод журналов в формате JSON (NDJSON).
zh_hans: 以 JSON 格式输出日志(NDJSON)。
zh_hant: 輸出記錄採用 JSON 格式 (NDJSON)。

# NoInScopeAppHostsShowingAll
source: No AppHosts found in current directory. Showing all running AppHosts.
cs: V aktuálním adresáři se nenašli žádní hostitelé aplikací. Zobrazují se všichni spuštění hostitelé aplikací.
de: Im aktuellen Verzeichnis wurden keine AppHosts gefunden. Es werden alle aktiven AppHosts angezeigt.
fr: Désolé, aucun AppHosts n’a été trouvé dans le répertoire actif. Affichage de tous les AppHosts en cours d’exécution.
it: Nessun AppHost trovato nella directory corrente. Visualizzazione di tutti gli AppHost in esecuzione.
ko: 현재 디렉터리에 AppHost가 없습니다. 실행 중인 모든 AppHost를 표시하는 중입니다.
pl: Nie znaleziono hostów aplikacji w bieżącym katalogu. Wyświetlanie wszystkich uruchomionych hostów aplikacji.
pt_br: Nenhum AppHosts encontrado no diretório atual. Mostrando todos os AppHosts em execução.
ru: Хосты приложений не найдены в текущем каталоге. Отображаются все запущенные хосты приложений.
tr: Geçerli dizinde AppHost bulunamadı. Tüm çalışan AppHost'lar gösteriliyor.
zh_hans: 当前目录中未找到 AppHost。显示所有正在运行的 AppHost。
zh_hant: 在目前的目錄中找不到 AppHost。顯示所有正在執行的 AppHost。

source: No resources found.
cs: Nenašly se žádné prostředky.
de: Keine Ressourcen gefunden.
fr: Ressources introuvables.
it: Non sono state trovate risorse.
ko: 리소스를 찾을 수 없습니다.
pl: Nie znaleziono żadnych zasobów.
pt_br: Nenhum recurso encontrado.
ru: Ресурсы не найдены.
tr: Kaynak bulunamadı.
zh_hans: 未找到资源。
zh_hant: 找不到任何資源。

# ProjectOptionDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
de: Der Pfad zur Aspire AppHost-Projektdatei.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
ko: Aspire AppHost 프로젝트 파일의 경로입니다.
pl: Ścieżka do pliku projektu hosta AppHost platformy Aspire.
pt_br: O caminho para o arquivo de projeto do Aspire AppHost.
ru: Путь к файлу проекта Aspire AppHost.
tr: Aspire AppHost proje dosyasının yolu.
zh_hans: Aspire AppHost 项目文件的路径。
zh_hant: Aspire AppHost 專案檔案的路徑。

# ResourceArgumentDescription
source: The name of the resource to get logs for. If not specified, logs from all resources are shown.
cs: Název prostředku, pro který se mají načíst protokoly. Pokud se nezadá, zobrazí se protokoly ze všech prostředků.
de: Name der Ressource, für die Protokolle abgerufen werden sollen. Wenn keine Angabe erfolgt, werden Protokolle von allen Ressourcen angezeigt.
fr: Le nom de la ressource pour laquelle obtenir les journaux. Si aucun nom n’est spécifié, les journaux d’activité de toutes les ressources sont affichées.
it: Nome della risorsa per cui ottenere i log. Se non specificato, vengono visualizzati i log di tutte le risorse.
ko: 로그를 가져올 리소스의 이름입니다. 지정하지 않으면 모든 리소스의 로그가 표시됩니다.
pl: Nazwa zasobu, którego dzienniki mają zostać pobrane. Jeśli nie podasz nazwy, pokażą się dzienniki ze wszystkich zasobów.
pt_br: O nome do recurso para o qual obter logs. Se não for especificado, os logs de todos os recursos serão mostrados.
ru: Имя ресурса, для которого нужно получить журналы. Если не указано, отображаются журналы из всех ресурсов.
tr: Günlükleri alınacak kaynağın adı. Belirtilmezse tüm kaynakların günlükleri gösterilir.
zh_hans: 要获取其日志的资源的名称。如果未指定，则显示所有资源的日志。
zh_hant: 要取得其記錄的資源名稱。如果未指定，則顯示所有資源的記錄。

# ResourceRequiredWithoutFollow
source: A resource name is required when not using --follow. Use --follow to stream logs from all resources.
cs: Pokud nepoužíváte --follow, vyžaduje se název prostředku. Pokud chcete streamovat protokoly ze všech prostředků, použijte --follow.
de: Ein Ressourcenname ist erforderlich, wenn --follow nicht verwendet wird. Verwenden Sie --follow, um Protokolle aller Ressourcen zu streamen.
fr: Un nom de ressource est requis si vous n’utilisez pas --follow. Utilisez --follow pour diffuser en continu les journaux de toutes les ressources.
it: Quando non si usa --follow, è necessario specificare un nome di risorsa. Usare --follow per trasmettere i log da tutte le risorse.
ko: --follow를 사용하지 않을 경우 리소스 이름은 필수 항목입니다. --follow를 사용하여 모든 리소스의 로그를 스트리밍합니다.
pl: Nazwa zasobu jest wymagana, jeśli nie używasz opcji --follow. Użyj opcji --follow, aby przesyłać strumieniowo dzienniki ze wszystkich zasobów.
pt_br: Um nome de recurso é necessário ao não usar --follow. Use --follow para transmitir logs de todos os recursos.
ru: При отсутствии параметра --follow необходимо указать имя ресурса. Используйте --follow для потоковой передачи журналов из всех ресурсов.
tr: --follow kullanılmadığında kaynak adı gereklidir. Tüm kaynaklardan günlük akışı yapmak için --follow kullanın.
zh_hans: 不使用 --follow 时必须指定资源名称。使用 --follow 流式传输所有资源的日志。
zh_hant: 當未使用 --follow 時，必須指定資源名稱。使用 --follow 從所有資源串流記錄。

source: Scanning for running AppHosts...
cs: Vyhledávání spuštěných hostitelů aplikací...
de: Suche nach aktiven AppHosts …
fr: Recherche des AppHosts en cours d’exécution...
it: Analisi per l'esecuzione di AppHosts in corso...
ko: 실행 중인 AppHost를 검색하는 중...
pl: Skanowanie w poszukiwaniu uruchomionych hostów aplikacji...
pt_br: Verificando se há AppHosts em execução...
ru: Выполняется сканирование на наличие запущенных хостов приложений...
tr: Çalışan AppHost'lar taranıyor...
zh_hans: 正在扫描处于运行状态的 AppHost...
zh_hant: 正在掃描執行中的 AppHost...

# SelectAppHost
source: Select an AppHost:
cs: Vyberte hostitele aplikací:
de: AppHost auswählen:
fr: Sélectionner un AppHost :
it: Selezionare un AppHost:
ko: AppHost 선택:
pl: Wybierz hosta aplikacji:
pt_br: Selecione um AppHost:
ru: Выберите хост приложения:
tr: AppHost seçin:
zh_hans: 选择 AppHost:
zh_hant: 選取 AppHost:

# TailMustBePositive
source: The --tail value must be a positive number.
cs: Hodnota --tail musí být kladné číslo.
de: Der Wert für --tail muss eine positive Zahl sein.
fr: La valeur --tail doit être un nombre positif.
it: Il valore --tail deve essere un numero positivo.
ko: --tail 값은 양수여야 합니다.
pl: Wartość --tail musi być liczbą dodatnią.
pt_br: O valor --tail deve ser um número positivo.
ru: Значение --tail должно быть положительным числом.
tr: --tail değeri, pozitif bir sayı olmalıdır.
zh_hans: --tail 值必须为正数。
zh_hant: --tail 值必須是正數。

# TailOptionDescription
source: Number of lines to show from the end of logs (default: all).
cs: Počet řádků, které se mají zobrazit od konce protokolů (výchozí: vše).
de: Anzahl der Zeilen, die vom Ende der Protokolle angezeigt werden sollen (Standard: alle).
fr: Nombre de lignes à afficher à partir de la fin des journaux (par défaut : toutes).
it: Numero di righe da visualizzare dalla fine dei log (impostazione predefinita: all).
ko: 로그 끝에서 표시할 줄 수입니다(기본값: 모두).
pl: Liczba linii wyświetlanych od końca dzienników (domyślnie: wszystkie).
pt_br: Número de linhas a serem mostradas a partir do final dos logs (padrão: todos).
ru: Количество строк, отображаемых с конца журналов (по умолчанию: все).
tr: Günlüklerin sonundan gösterilecek satır sayısı (varsayılan: tümü).
zh_hans: 要在日志末尾显示的行数(默认: 全部)。
zh_hant: 從記錄末端顯示的行數 (預設: 全部)。

# TailRequiresResource
source: The --tail option requires a resource name to be specified.
cs: Možnost --tail vyžaduje zadání názvu prostředku.
de: Für die Option --tail muss ein Ressourcenname angegeben werden.
fr: L’option --tail requiert la spécification d’un nom de ressource.
it: L'opzione --tail richiede che venga specificato un nome di risorsa.
ko: --tail 옵션을 사용하려면 리소스 이름을 지정해야 합니다.
pl: Opcja --tail wymaga podania nazwy zasobu.
pt_br: A opção --tail requer que um nome de recurso seja especificado.
ru: Параметр --tail требует указания имени ресурса.
tr: --tail seçeneği için bir kaynak adı belirtilmelidir.
zh_hans: --tail 选项需要指定资源名称。
zh_hant: --tail 選項需要指定資源名稱。

# Description
source: Display logs from resources in a running Aspire apphost.
it: Consente di visualizzare i log delle risorse in un apphost Aspire in esecuzione.
tr: Çalışan bir Aspire apphost'taki kaynakların günlüklerini görüntüle.

# JsonOptionDescription
source: Output logs in JSON format (NDJSON).
it: Log di output in formato JSON (NDJSON).
tr: Günlükleri JSON biçiminde (NDJSON) çıkar.
