Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/McpCommandStrings.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, zh_hans, zh_hant

# DeprecatedCommandWarning
source: Warning: 'aspire mcp' commands are deprecated and will be removed in a future release. Please use 'aspire agent' instead.
pl: Ostrzeżenie: polecenia „aspire mcp” są przestarzałe i zostaną usunięte w przyszłym wydaniu. Użyj zamiast nich polecenia „aspire agent”.
zh_hans: 警告: "aspire mcp" 命令已弃用，将在未来版本中移除。请改用 "aspire agent"。

# Description
source: Manage MCP (Model Context Protocol) server. (deprecated, use 'agent')
pl: Zarządzaj serwerem MCP (Model Context Protocol). (przestarzałe, użyj polecenia „agent”)
zh_hans: 管理 MCP (模型上下文协议)服务器。(已弃用，请使用 "agent")

# InitCommand_AdditionalOptionsSelectPrompt
source: Which additional options do you want to enable?
cs: Které další možnosti chcete povolit?
pl: Jakie dodatkowe opcje chcesz włączyć?
zh_hans: 你想启用哪些其他选项?

# InitCommand_AgentConfigurationSelectPrompt
source: Which agent environments do you want to configure?
cs: Která prostředí agentů chcete nakonfigurovat?
pl: Które środowiska agentów chcesz skonfigurować?
zh_hans: 你想配置哪些智能体环境?

# InitCommand_ConfigurationComplete
source: Agent environment configuration complete.
cs: Konfigurace prostředí agentů se dokončila.
de: Die Konfiguration der Agentumgebung ist abgeschlossen.
fr: Configuration de l’environnement d’agent terminée.
it: Configurazione dell'ambiente agente completata.
ja: エージェント環境の構成が完了しました。
ko: 에이전트 환경 구성이 완료되었습니다.
pl: Ukończono konfigurację środowiska agenta.
pt_br: Configuração do ambiente do agente concluída.
ru: Конфигурация среды агента завершена.
zh_hans: 智能体环境配置完成。
zh_hant: 代理程式環境設定完成。

# InitCommand_ConfigurePlaywrightPrompt
source: Install Playwright CLI for browser automation?
pl: Wstępnie skonfigurować serwer MCP Playwright?

# InitCommand_CreateAgentInstructionsPrompt
source: Create agent environment specific instruction files?
cs: Chcete vytvořit soubory instrukcí specifické pro prostředí agenta?
de: Agentenspezifische Anweisungsdateien erstellen?
it: Creare file di istruzioni specifici per l'ambiente dell'agente?
ja: エージェント環境固有の指示ファイルを作成しますか?
ko: 에이전트 환경별 지침 파일을 만드시겠어요?
pl: Utworzyć pliki instrukcji specyficzne dla środowiska agenta?
pt_br: Criar arquivos de instrução específicos do ambiente do agente?
ru: Создать файлы инструкций, специфичные для среды агента?
zh_hans: 创建特定于代理环境的指令文件?
zh_hant: 建立代理程式環境特定指示檔案?

# InitCommand_Description
source: Initialize MCP server configuration for detected agent environments. (deprecated, use 'agent init')
pl: Zainicjuj konfigurację serwera MCP dla wykrytych środowisk agentów. (przestarzałe, użyj polecenia „agent init”)
zh_hans: 初始化检测到的智能体环境的 MCP 服务器配置。(已弃用，请使用 "agent init")

# InitCommand_DetectingAgentEnvironments
source: Detecting agent environments...
cs: Zjišťují se prostředí agentů...
de: Agent-Umgebungen werden erkannt...
fr: Détection des environnements d’agent...
it: Rilevamento degli ambienti dell'agente...
ja: エージェント環境を検出しています...
ko: 에이전트 환경을 검색하는 중...
pl: Wykrywanie środowisk agentów...
pt_br: Detectando ambientes de agente...
ru: Определение сред агентов...
zh_hans: 正在检测智能体环境...
zh_hant: 正在偵測代理程式環境...

# InitCommand_NoAgentEnvironmentsDetected
source: No agent environments were detected.
cs: Nebyla zjištěna žádná prostředí agentů.
de: Es wurden keine Agentumgebungen gefunden.
fr: Aucun environnement d’agent n’a été détecté.
it: Non sono stati rilevati ambienti agente.
ja: エージェント環境は検出されませんでした。
ko: 에이전트 환경이 검색되지 않았습니다.
pl: Nie wykryto żadnych środowisk agentów.
pt_br: Nenhum ambiente de agente foi detectado.
ru: Среды агентов не обнаружены.
zh_hans: 未检测到智能体环境。
zh_hant: 未偵測到代理程式環境。

# InitCommand_WorkspaceRootNotFound
source: Directory not found: {0}
cs: Adresář se nenašel: {0}.
de: Verzeichnis nicht gefunden: {0}
fr: Répertoire introuvable : {0}
it: Directory non trovata: {0}
ja: ディレクトリが見つかりません: {0}
ko: 디렉터리가 없습니다. {0}
pl: Katalog nie został znaleziony: {0}
pt_br: Diretório não encontrado: {0}
ru: Каталог не найден: {0}
zh_hans: 找不到目录: {0}
zh_hant: 找不到目錄: {0}

# InitCommand_WorkspaceRootPrompt
source: Enter the path to the root of your workspace:
cs: Zadejte cestu ke kořenovému adresáři pracovního prostoru:
de: Geben Sie den Stammpfad Ihres Arbeitsbereichs ein:
fr: Entrez le chemin d’accès à la racine de votre espace de travail :
it: Immettere il percorso della radice dell'area di lavoro:
ja: ワークスペースのルートへのパスを入力してください:
ko: 작업 영역의 루트 경로를 입력합니다.
pl: Wprowadź ścieżkę do katalogu głównego obszaru roboczego:
pt_br: Insira o caminho para a raiz do seu workspace:
ru: Введите путь к корню рабочей области:
zh_hans: 请输入工作区根路径:
zh_hant: 輸入工作區根目錄的路徑:

# InitCommand_WorkspaceRootRequired
source: Workspace root path is required.
cs: Kořenová cesta pracovního prostoru je povinná.
de: Der Stammpfad des Arbeitsbereichs ist erforderlich.
fr: Le chemin racine de l’espace de travail est obligatoire.
it: È necessario un percorso della radice dell'area di lavoro.
ja: ワークスペース ルート パスが必要です。
ko: 작업 영역 루트 경로가 필요합니다.
pl: Ścieżka główna obszaru roboczego jest wymagana.
pt_br: O caminho raiz do workspace é obrigatório.
ru: Требуется путь к корню рабочей области.
zh_hans: 工作区根路径是必需的。
zh_hant: 需要工作區根路徑。

# StartCommand_Description
source: Start the MCP (Model Context Protocol) server. (deprecated, use 'agent mcp')
pl: Uruchom serwer MCP (Model Context Protocol). (przestarzałe, użyj polecenia „agent mcp”)
zh_hans: 启动 MCP (模型上下文协议)服务器。(已弃用，请使用 "agent mcp")

# InitCommand_ConfigurePlaywrightPrompt
source: Pre-configure Playwright MCP server?
cs: Chcete předem nakonfigurovat server Playwright MCP?
de: Playwright MCP-Server vorkonfigurieren?
it: Preconfigurare il server MCP di Playwright?
ja: Playwright MCP サーバーを事前に構成しますか?
ko: Playwright MCP 서버를 미리 구성할까요?
pt_br: Pré-configurar o servidor MCP do Playwright?
ru: Предварительно настроить сервер MCP Playwright?
zh_hans: 预配置 Playwright MCP 服务器?
zh_hant: 預先設定 Playwright MCP 伺服器?

# Description
source: Manage MCP (Model Context Protocol) server.
cs: Spravujte server MCP (Model Context Protocol).
de: Verwalten Sie den MCP-Server (Model Context Protocol).
fr: Gérez le serveur MCP (Model Context Protocol).
it: Gestire il server MCP (Model Context Protocol).
ja: MCP (モデル コンテキスト プロトコル) サーバーを管理します。
ko: MCP(모델 컨텍스트 프로토콜) 서버를 관리합니다.
pt_br: Gerencie o servidor MCP (Protocolo de Contexto de Modelo).
ru: Управление сервером MCP (протокол контекста модели).
zh_hant: 管理 MCP (模型內容通訊協定) 伺服器。

# InitCommand_Description
source: Initialize MCP server configuration for detected agent environments.
cs: Inicializujte konfiguraci serveru MCP pro detekovaná prostředí agentů.
de: Initialisieren Sie die MCP-Serverkonfiguration für erkannte agentische Umgebungen.
fr: Initialisez la configuration du serveur MCP pour les environnements d’agent détectés.
it: Inizializzare la configurazione del server MCP per gli ambienti agente rilevati.
ja: 検出されたエージェント環境の MCP サーバー構成を初期化します。
ko: 검색된 에이전트 환경에 대한 MCP 서버 구성을 초기화합니다.
pt_br: Inicialize a configuração do servidor MCP para ambientes de agente detectados.
ru: Инициализируйте конфигурацию сервера MCP для обнаруженных сред агентов.
zh_hant: 為偵測到的代理程式環境初始化 MCP 伺服器設定。

# StartCommand_Description
source: Start the MCP (Model Context Protocol) server.
cs: Spusťte server MCP (Model Context Protocol).
de: Starten Sie den MCP-Server (Model Context Protocol).
fr: Démarrez le serveur MCP (Model Context Protocol).
it: Avviare il server MCP (Model Context Protocol).
ja: MCP (モデル コンテキスト プロトコル) サーバーを起動します。
ko: MCP(모델 컨텍스트 프로토콜) 서버를 시작합니다.
pt_br: Inicie o servidor MCP (Protocolo de Contexto de Modelo).
ru: Запуск сервера MCP (протокол контекста модели).
zh_hant: 啟動 MCP (模型內容通訊協定) 伺服器。

# InitCommand_AgentConfigurationSelectPrompt
source: Select agent environments to configure:
fr: Sélectionnez les environnements d’agent à configurer :
