Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/NewCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Description
source: Create a new Aspire project.
cs: Vytvořte nový ukázkový projekt Aspire.
de: Erstellen Sie ein neues Aspire-Beispielprojekt.
es: Crear un nuevo proyecto Aspire.
it: Creare un nuovo progetto Aspire di esempio.
ja: 新しい Aspire サンプル プロジェクトを作成します。
ko: 새 Aspire 프로젝트를 만듭니다.
pl: Utwórz nowy projekt usługi Aspire.
ru: Создайте новый проект Aspire.
tr: Yeni bir Aspire örnek projesi oluşturun.
zh_hans: 创建新的 Aspire 示例项目。

source: Enter the output path:
cs: Zadejte výstupní cestu:
de: Ausgabepfad eingeben:
es: Escriba la ruta de acceso de salida:
fr: Entrez le chemin de sortie :
it: Immetti il percorso di output:
ja: 出力パスを入力してください:
ko: 출력 경로 입력:
pl: Wprowadź ścieżkę wyjściową:
pt_br: Insira o caminho de saída:
ru: Введите выходной путь:
tr: Çıkış yolunu girin:
zh_hans: 输入输出路径:
zh_hant: 輸入輸出路徑:

source: Enter the project name:
cs: Zadejte název projektu:
de: Projektnamen eingeben:
fr: Entrez le nom du projet :
it: Immetti il nome del progetto:
ja: プロジェクト名を入力してください:
pt_br: Insira o nome do projeto:
tr: Proje adını girin:
zh_hans: 输入项目名称:
zh_hant: 輸入專案名稱:

source: Invalid project name.
cs: Neplatný název projektu
de: Ungültiger Projektname.
es: Nombre de proyecto no válido.
fr: Nom de projet non valide.
it: Nome progetto non valido.
ja: プロジェクト名が無効です。
ko: 프로젝트 이름이 잘못되었습니다.
pl: Nieprawidłowa nazwa projektu.
pt_br: Nome de projeto inválido.
ru: Недопустимое имя проекта.
tr: Geçersiz proje adı.
zh_hans: 项目名称无效。
zh_hant: 無效的專案名稱。

# NameArgumentDescription
source: The name of the project to create.
cs: Název projektu, který se má vytvořit
de: Der Name des zu erstellenden Projekts.
es: El nombre del proyecto que se va a crear.
fr: Nom du projet à créer.
it: Nome del progetto da creare.
ko: 만들 프로젝트의 이름입니다.
pl: Nazwa projektu do utworzenia.
pt_br: O nome do projeto a ser criado.
ru: Имя создаваемого проекта.
tr: Oluşturulacak projenin adı.
zh_hans: 要创建的项目的名称。
zh_hant: 要建立專案之名稱。

# OutputArgumentDescription
source: The output path for the project.
cs: Výstupní cesta pro projekt
de: Der Ausgabepfad für das Projekt.
es: La ruta de salida del proyecto.
fr: Le chemin de sortie du projet.
it: Percorso di output per il progetto.
ko: 프로젝트의 출력 경로입니다.
pl: Ścieżka wyjściowa projektu.
pt_br: O caminho de saída para o projeto.
ru: Выходной путь для проекта.
tr: Projenin çıkış yolu.
zh_hans: 项目的输出路径。
zh_hant: 專案的輸出路徑。

source: Select a project template:
cs: Vyberte šablonu projektu:
de: Projektvorlage auswählen:
es: Seleccione una plantilla de proyecto:
fr: Sélectionnez un modèle de projet :
it: Selezionare un modello di progetto:
ja: プロジェクト テンプレートを選択してください:
ko: 프로젝트 템플릿 선택:
pl: Wybierz szablon projektu:
pt_br: Selecione um modelo de projeto:
ru: Выберите шаблон проекта:
tr: Bir proje şablonu seçin:
zh_hans: 选择项目模板:
zh_hant: 選取專案範本:

source: Select a template version:
cs: Vyberte verzi šablony:
de: Vorlagenversion auswählen:
es: Seleccione una versión de plantilla:
fr: Sélectionner une version de modèle :
it: Selezionare una versione di modello:
ja: テンプレート のバージョンを選択してください:
ko: 템플릿 버전 선택:
pl: Wybierz wersję szablonu:
pt_br: Selecione uma versão de modelo:
ru: Выберите версию шаблона:
tr: Bir şablon sürümü seçin:
zh_hans: 选择模板版本:
zh_hant: 選取範本版本:

# SourceArgumentDescription
source: The NuGet source to use for the project templates.
cs: Zdroj NuGet, který se má použít pro šablony projektu
de: Die NuGet-Quelle, die für die Projektvorlagen verwendet werden soll.
es: El origen de NuGet que se va a usar para las plantillas de proyecto.
fr: La source NuGet à utiliser pour les modèles de projet.
it: Origine NuGet da utilizzare per i modelli di progetto.
ko: 프로젝트 템플릿에 사용할 NuGet 소스입니다.
pl: Źródło NuGet, które ma być używane dla szablonów projektu.
pt_br: A origem do NuGet a ser usada para os modelos de projeto.
ru: Источник NuGet для использования в шаблонах проекта.
tr: Proje şablonları için kullanılacak NuGet kaynağı.
zh_hans: 要用于项目模板的 NuGet 源。
zh_hant: 要用於專案範本的 NuGet 來源。

# VersionArgumentDescription
source: The version of the project templates to use.
cs: Verze šablon projektu, která se má použít
de: Die Version der zu verwendenden Projektvorlagen.
es: La versión de las plantillas de proyecto que se van a usar.
fr: Version des modèles de projet à utiliser.
it: Versione dei modelli di progetto da utilizzare.
ko: 사용할 프로젝트 템플릿의 버전입니다.
pl: Wersja szablonów projektu do użycia.
pt_br: A versão dos modelos de projeto a serem usados.
ru: Версия шаблонов проекта, которую следует использовать.
tr: Kullanılacak proje şablonlarının sürümü.
zh_hans: 要使用的项目模板的版本。
zh_hant: 要使用的專案範本版本。

source: Enter the project name
es: Escriba el nombre del proyecto:
ko: 프로젝트 이름 입력:
pl: Wprowadź nazwę projektu:
ru: Введите имя проекта:

# Description
source: Create a new Aspire sample project.
fr: Créez un nouveau projet d’exemple Aspire.
pt_br: Crie um novo projeto de exemplo do Aspire.
zh_hant: 建立新的 Aspire 範例專案。

# NameArgumentDescription
source: The name of the project to create
ja: 作成するプロジェクトの名前。

# OutputArgumentDescription
source: The output path for the project
ja: プロジェクトの出力パス。

# SourceArgumentDescription
source: The NuGet source to use for the project templates
ja: プロジェクト テンプレートに使用する NuGet ソース。

# VersionArgumentDescription
source: The version of the project templates to use
ja: 使用するプロジェクト テンプレートのバージョン。
