Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/ResourceCommandStrings.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, ru, zh_hant

# CommandDescription
source: Execute a command on a resource.
cs: Spusťte příkaz pro prostředek.
de: Führen Sie einen Befehl auf einer Ressource aus.
fr: Exécuter une commande sur une ressource.
it: Eseguire un comando su una risorsa.
ja: リソースでコマンドを実行します。
ko: 리소스에서 명령을 실행합니다.
pl: Wykonaj polecenie dla zasobu.
ru: Выполнить команду на ресурсе.
zh_hant: 在資源上執行命令。

# CommandNameArgumentDescription
source: The name of the command to execute.
cs: Název příkazu, který se má spustit
de: Der Name des auszuführenden Befehls.
fr: Le nom de la commande à exécuter.
it: Nome del comando da eseguire.
ja: 実行するコマンドの名前。
ko: 실행할 명령의 이름입니다.
pl: Nazwa polecenia do wykonania.
ru: Имя команды, которую нужно выполнить.
zh_hant: 所要執行命令的名稱。

# CommandResourceArgumentDescription
source: The name of the resource to execute the command on.
cs: Název prostředku, na kterém se má příkaz provést
de: Der Name der Ressource, für die der Befehl ausgeführt werden soll.
fr: Nom de la ressource sur laquelle exécuter la commande.
it: Nome della risorsa di destinazione rispetto al quale eseguire il comando.
ja: コマンドを実行する対象のリソースの名前。
ko: 명령을 실행할 대상 리소스의 이름입니다.
pl: Nazwa zasobu, na którym ma zostać wykonane polecenie.
ru: Имя целевого ресурса, на котором будет выполняться команда.
zh_hant: 要執行命令的資源名稱。

# NoInScopeAppHostsShowingAll
source: No in-scope AppHosts found. Showing all running AppHosts.
cs: Nebyli nalezeni žádní hostitelé aplikací v daném oboru. Zobrazují se všichni spuštění hostitelé aplikací.
de: Es wurden keine AppHosts im Geltungsbereich gefunden. Es werden alle aktiven AppHosts angezeigt.
fr: Aucun AppHost dans le périmètre n’a été trouvé. Affichage de tous les AppHosts en cours d’exécution.
it: Nessun AppHost in ambito trovato. Visualizzazione di tutti gli AppHost in esecuzione.
ja: スコープ内の AppHost が見つかりません。実行中のすべての AppHost を表示しています。
ko: 범위 내 AppHost를 찾을 수 없습니다. 실행 중인 모든 AppHost를 표시하는 중입니다.
pl: Nie znaleziono hostów aplikacji w zakresie. Wyświetlanie wszystkich uruchomionych hostów aplikacji.
ru: Не найдено ни одного AppHost в области действия. Показаны все выполняющиеся AppHost.
zh_hant: 未找到符合範圍的 AppHost。顯示所有正在執行的 AppHost。

source: No running AppHosts found.
cs: Nebyl nalezen žádný spuštěný hostitel aplikací.
de: Es wurden keine ausgeführten AppHosts gefunden.
fr: Désolé, aucun AppHost en cours d’exécution n’a été trouvé.
it: Non sono stati trovati AppHost in esecuzione.
ja: 実行中の AppHost が見つかりません。
ko: 실행 중인 AppHost를 찾을 수 없습니다.
pl: Nie znaleziono uruchomionych hostów aplikacji.
ru: Запущенные appHosts не найдены.
zh_hant: 找不到正在執行的 AppHost。

# ProjectOptionDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
de: Der Pfad zur Aspire AppHost-Projektdatei.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
ja: Aspire AppHost プロジェクト ファイルへのパス。
ko: Aspire AppHost 프로젝트 파일의 경로입니다.
pl: Ścieżka do pliku projektu hosta AppHost platformy Aspire.
ru: Путь к файлу проекта Aspire AppHost.
zh_hant: Aspire AppHost 專案檔案的路徑。

# RestartDescription
source: Restart a running resource.
cs: Restartujte spuštěný prostředek.
de: Starten Sie eine laufende Ressource neu.
fr: Redémarrer une ressource en cours d’exécution.
it: Riavviare una risorsa in esecuzione.
ja: 実行中のリソースを再起動します。
ko: 실행 중인 리소스를 다시 시작합니다.
pl: Uruchom ponownie uruchomiony zasób.
ru: Перезапустить уже запущенный ресурс.
zh_hant: 重新啟動正在執行的資源。

# RestartResourceArgumentDescription
source: The name of the resource to restart.
cs: Název prostředku, který se má restartovat
de: Der Name der Ressource, die neu gestartet werden soll.
fr: Le nom de la ressource à redémarrer.
it: Nome della risorsa da riavviare.
ja: 再起動するリソースの名前。
ko: 다시 시작할 리소스의 이름입니다.
pl: Nazwa zasobu do ponownego uruchomienia.
ru: Имя ресурса, который нужно перезапустить.
zh_hant: 要重新啟動的資源名稱。

source: Scanning for running AppHosts...
de: Suche nach aktiven AppHosts …
fr: Recherche des AppHosts en cours d’exécution...
ko: 실행 중인 AppHost를 검색하는 중...
pl: Skanowanie w poszukiwaniu uruchomionych hostów aplikacji...
ru: Выполняется сканирование на наличие запущенных хостов приложений...
zh_hant: 正在掃描執行中的 AppHost...

# SelectAppHost
source: Select which AppHost to connect to:
de: Wählen Sie den AppHost aus, mit dem eine Verbindung hergestellt werden soll:
fr: Sélectionnez l’AppHost auquel vous connecter :
ko: 연결할 AppHost 선택:
pl: Wybierz host aplikacji, z którym chcesz nawiązać połączenie:
ru: Выберите AppHost, к которому нужно подключиться:
zh_hant: 選取要連接的 AppHost:

# StartDescription
source: Start a stopped resource.
de: Starten Sie eine gestoppte Ressource.
fr: Démarrer une ressource arrêtée.
ko: 중지된 리소스를 시작합니다.
pl: Uruchom zatrzymany zasób.
ru: Запустить остановленный ресурс.
zh_hant: 啟動已停止的資源。

# StartResourceArgumentDescription
source: The name of the resource to start.
de: Der Name der Ressource, die gestartet werden soll.
fr: Le nom de la ressource à commencer.
ko: 시작할 리소스의 이름입니다.
pl: Nazwa zasobu do uruchomienia.
ru: Имя ресурса, который нужно запустить.
zh_hant: 要啟動的資源名稱。

# StartDescription
source: Start an apphost in the background, or start a stopped resource.
cs: Spusťte zastavený prostředek.
it: Avviare una risorsa arrestata.
ja: 停止しているリソースを開始します。

# StartResourceArgumentDescription
source: The name of the resource to start. If not specified, starts the AppHost in the background.
cs: Název prostředku, který se má spustit
it: Nome della risorsa da avviare.
ja: 開始するリソースの名前。
