Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/ResourcesCommandStrings.*.xlf
Languages: cs, es, fr, it, ja, ko, pt_br, tr, zh_hans, zh_hant

# AppHostNotRunning
source: No running AppHost found. Use 'aspire run' to start one first.
cs: Nenašel se žádný spuštěný hostitel aplikací. Nejprve spusťte spuštění pomocí příkazu „aspire run“.
es: No se encontró ningún AppHost en ejecución. Usa 'aspire run' para iniciar uno primero.
fr: Désolé, aucun AppHost en cours d’exécution n’a été trouvé. Utilisez « aspire run » pour en démarrer un.
it: Non è stato trovato alcun AppHost in esecuzione. Usare prima di tutto "aspire run" per avviarne uno.
ja: 実行中の AppHost は見つかりません。最初に 'aspire run' を使って起動してください。
ko: 실행 중인 AppHost를 찾을 수 없습니다. 'aspire run'을 사용하여 먼저 하나를 시작합니다.
pt_br: Nenhum AppHost em execução encontrado. Use "aspire run" para iniciar um primeiro.
tr: Çalışan AppHost bulunamadı. Önce birini başlatmak için 'aspire run' komutunu kullanın.
zh_hans: 找不到正在运行的 AppHost。请先使用 "aspire run" 启动一个。
zh_hant: 找不到正在執行的 AppHost。請先使用 'aspire run' 啟動一個。

# Description
source: Describe resources in a running apphost.
cs: Umožňuje zobrazit snímky prostředků ze spuštěného hostitele aplikací Aspire.
es: Muestra instantáneas de recursos de un apphost de Aspire en ejecución.
fr: Afficher les instantanés de ressource d’un Apphost Aspire en cours d’exécution.
it: Consente di visualizzare gli snapshot delle risorse da un apphost Aspire in esecuzione.
pt_br: Exiba instantâneos de recursos de um apphost do Aspire em execução.
tr: Çalışan bir Aspire apphost'tan kaynak anlık görüntülerini göster.
zh_hans: 显示正在运行的 Aspire 应用主机中的资源快照。

# JsonOptionDescription
source: Output format (Table or Json).
cs: Výstup ve formátu JSON pro spotřebu počítače.
es: Salida en formato JSON para el consumo de la máquina.
fr: Générer la sortie au format JSON pour traitement automatique.
it: Output in formato JSON per l'utilizzo da parte del computer.
pt_br: Saída no formato JSON para consumo do computador.
tr: Makine tarafından kullanılmak üzere JSON biçiminde çıktı ver.
zh_hans: 以 JSON 格式输出，供计算机使用。

# NoAppHostFound
source: No AppHost project found.
cs: Nenašel se žádný projekt hostitele aplikací.
es: No se encontró ningún proyecto de AppHost.
fr: Désolé, aucun projet AppHost n’a été trouvé.
it: Nessun progetto AppHost trovato.
ja: AppHost プロジェクトは見つかりません。
ko: AppHost 프로젝트를 찾을 수 없습니다.
pt_br: Nenhum projeto AppHost encontrado.
tr: AppHost projesi bulunamadı.
zh_hans: 找不到 AppHost 项目。
zh_hant: 找不到 AppHost 專案。

# NoInScopeAppHostsShowingAll
source: No AppHosts found in current directory. Showing all running AppHosts.
cs: V aktuálním adresáři se nenašli žádní hostitelé aplikací. Zobrazují se všichni spuštění hostitelé aplikací.
es: No se encontró ningún AppHosts en el directorio actual. Mostrando todos los AppHosts en ejecución.
fr: Désolé, aucun AppHosts n’a été trouvé dans le répertoire actif. Affichage de tous les AppHosts en cours d’exécution.
it: Nessun AppHost trovato nella directory corrente. Visualizzazione di tutti gli AppHost in esecuzione.
ja: 現在のディレクトリ内に AppHost が見つかりません。実行中のすべての AppHost を表示しています。
ko: 현재 디렉터리에 AppHost가 없습니다. 실행 중인 모든 AppHost를 표시하는 중입니다.
pt_br: Nenhum AppHosts encontrado no diretório atual. Mostrando todos os AppHosts em execução.
tr: Geçerli dizinde AppHost bulunamadı. Tüm çalışan AppHost'lar gösteriliyor.
zh_hans: 当前目录中未找到 AppHost。显示所有正在运行的 AppHost。
zh_hant: 在目前的目錄中找不到 AppHost。顯示所有正在執行的 AppHost。

# ProjectOptionDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
es: La ruta de acceso al archivo del proyecto host de la AppHost Aspire.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
ja: Aspire AppHost プロジェクト ファイルへのパス。
ko: Aspire AppHost 프로젝트 파일의 경로입니다.
pt_br: O caminho para o arquivo de projeto do Aspire AppHost.
tr: Aspire AppHost proje dosyasının yolu.
zh_hans: Aspire AppHost 项目文件的路径。
zh_hant: Aspire AppHost 專案檔案的路徑。

# ResourceArgumentDescription
source: The name of the resource to display. If not specified, all resources are shown.
cs: Název prostředku, který se má zobrazit. Pokud se nezadá, zobrazí se všechny prostředky.
es: Nombre del recurso que se va a mostrar. Si no se especifica, se muestran todos los recursos.
fr: Le nom de la ressource à afficher. Si aucun nom n’est spécifié, toutes les ressources sont affichées.
it: Nome della risorsa da visualizzare. Se non è specificato, vengono visualizzate tutte le risorse.
ja: 表示するリソースの名前。指定しない場合は、すべてのリソースが表示されます。
ko: 표시할 리소스의 이름입니다. 지정하지 않으면 모든 리소스가 표시됩니다.
pt_br: O nome do recurso a ser exibido. Se não for especificado, todos os recursos serão mostrados.
tr: Görüntülenecek kaynağın adı. Belirtilmezse tüm kaynaklar gösterilir.
zh_hans: 要显示的资源名称。如果未指定，则显示所有资源。
zh_hant: 要顯示的資源名稱。如果未指定，則會顯示所有資源。

# ResourceNotFound
source: Resource '{0}' not found.
cs: Prostředek {0} nebyl nalezen.
es: No se encuentra el recurso '{0}'.
fr: Ressource « {0} » introuvable.
it: Risorsa '{0}' non trovata.
ja: リソース '{0}' が見つかりません。
ko: '{0}' 리소스를 찾을 수 없습니다.
pt_br: O recurso “{0}” não foi encontrado.
tr: '{0}' kaynağı bulunamadı.
zh_hans: 找不到资源“{0}”。
zh_hant: 找不到資源 '{0}'。

source: Scanning for running AppHosts...
cs: Vyhledávání spuštěných hostitelů aplikací...
es: Buscando AppHosts en ejecución...
fr: Recherche des AppHosts en cours d’exécution...
it: Analisi per l'esecuzione di AppHosts in corso...
ja: 実行中の AppHost をスキャンしています...
ko: 실행 중인 AppHost를 검색하는 중...
pt_br: Verificando se há AppHosts em execução...
tr: Çalışan AppHost'lar taranıyor...
zh_hans: 正在扫描处于运行状态的 AppHost...
zh_hant: 正在掃描執行中的 AppHost...

# SelectAppHost
source: Select an AppHost:
cs: Vyberte hostitele aplikací:
es: Seleccione un AppHost:
fr: Sélectionner un AppHost :
it: Selezionare un AppHost:
ja: AppHost を選択:
ko: AppHost 선택:
pt_br: Selecione um AppHost:
tr: AppHost seçin:
zh_hans: 选择 AppHost:
zh_hant: 選取 AppHost:

# WatchOptionDescription
source: Stream resource snapshots as they change (NDJSON format when used with --json).
fr: Diffuser les instantanés de ressource au fur et à mesure de leur modification (format NDJSON lorsqu’il est utilisé avec --json).
it: Consente di trasmettere gli snapshot delle risorse man mano che cambiano (formato NDJSON se usato con --json).
ja: 変化が発生したときにリソース スナップショットをストリームします (--json と組み合わせた場合は NDJSON 形式)。
ko: 리소스 스냅샷이 변경될 때 스트림으로 전송합니다(--json과 함께 사용 시 NDJSON 형식).
tr: Kaynak anlık görüntülerini değiştikçe akışla aktarın (--json ile kullanıldığında NDJSON biçimi).
zh_hans: 在资源快照改变时流式传输这些快照(与 --json 一起使用时为 NDJSON 格式)。
zh_hant: 變更時串流資源快照集 (與 --json 一起使用時為 NDJSON 格式)。

# Description
source: Display resource snapshots from a running Aspire apphost.
ja: 実行中の Aspire apphost からのリソース スナップショットを表示します。
ko: 실행 중인 Aspire AppHost의 리소스 스냅샷을 표시합니다.
zh_hant: 顯示正在執行的 Aspire AppHost 的資源快照集。

# JsonOptionDescription
source: Output in JSON format for machine consumption.
ja: 機械処理用の JSON 形式で出力します。
ko: 컴퓨터 사용량에 대한 JSON형식의 출력입니다.
zh_hant: 輸出為 JSON 格式供機器使用。
