Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/RootCommandStrings.*.xlf
Languages: es, it, ko, pl, pt_br, ru, tr, zh_hans

# BannerArgumentDescription
source: Display the animated Aspire CLI welcome banner.
es: Muestra el banner de bienvenida animado de la CLI de Aspire.
it: Visualizzare il banner di benvenuto animato dell'interfaccia della riga di comando di Aspire.
ko: 애니메이션 Aspire CLI 환영 배너를 표시합니다.
pl: Wyświetl animowany baner powitalny interfejsu wiersza polecenia aplikacji Aspire.
pt_br: Exibir a barra de notificação de boas-vindas animada da CLI Aspire.
ru: Отобразить анимированный приветственный баннер CLI Aspire.
tr: Animasyonlu Aspire CLI karşılama başlığını görüntüleyin.
zh_hans: 显示动画 Aspire CLI 欢迎横幅。

# BannerVersionFormat
source: CLI — version {0}
es: CLI: versión {0}
it: Interfaccia della riga di comando - Versione {0}
ko: CLI — 버전 {0}
pl: CLI — wersja {0}
pt_br: CLI — versão {0}
ru: CLI — версия {0}
tr: CLI — sürüm {0}
zh_hans: CLI - 版本 {0}

# BannerWelcomeText
source: Welcome to the
es: Le damos la bienvenida al
it: Benvenuti in
ko: 시작:
pl: Witamy w
pt_br: Bem-vindo(a) à
ru: Вас приветствует
tr: Hoş geldiniz
zh_hans: 欢迎使用

# CliWaitForDebuggerArgumentDescription
source: Wait for a debugger to attach before executing the command.
es: Espere a que se asocie un depurador antes de ejecutar el comando.
it: Attendi che un debugger si connetta prima di eseguire il comando.
ko: 명령을 실행하기 전에 디버거가 연결되기를 기다리세요.
pl: Przed wykonaniem polecenia poczekaj na dołączenie debugera.
pt_br: Aguarde um depurador anexar antes de executar o comando.
ru: Дождитесь подключения отладчика, прежде чем выполнять команду.
tr: Komutu yürütmeden önce hata ayıklayıcısının eklenmesini bekleyin.
zh_hans: 在执行命令之前，请等待附加调试程序。

# DebugArgumentDescription
source: Enable debug logging to the console.
es: Habilite el registro de depuración en la consola.
it: Abilita la registrazione di debug nella console.
ko: 콘솔에 디버그 로깅을 활성화하세요.
pl: Włącz rejestrowanie debugowania w konsoli.
pt_br: Habilitar o log de depuração no console.
ru: Включает журналирование отладки в консоли.
tr: Konsolda hata ayıklama kaydını etkinleştirin.
zh_hans: 启用控制台的调试日志记录。

# DebugLevelArgumentDescription
source: Set the minimum log level for console output (Trace, Debug, Information, Warning, Error, Critical).
it: Impostare il livello minimo di log per l'output della console (Trace, Debug, Information, Warning, Error, Critical).
ko: 콘솔 출력에 대한 최소 로그 수준(추적, 디버그, 정보, 경고, 오류, 위험)을 설정합니다.
pl: Ustaw minimalny poziom dziennika dla wyjścia konsoli (Trace, Debug, Information, Warning, Error, Critical).
pt_br: Defina o nível mínimo de log para a saída do console (Rastreamento, Depuração, Informação, Aviso, Erro, Crítico).
tr: Konsol çıkışı için minimum günlük düzeyini ayarlayın (İzleme, Hata Ayıklama, Bilgi, Uyarı, Hata, Kritik).

# Description
source: The Aspire CLI can be used to create, run, and publish Aspire-based applications.
es: La CLI de Aspire puede utilizarse para crear, ejecutar y publicar aplicaciones basadas en Aspire.
it: L'interfaccia della riga di comando Aspire può essere usata per creare, eseguire e pubblicare applicazioni basate su Aspire.
ko: Aspire CLI를 사용하여 Aspire 기반 애플리케이션을 만들고, 실행하고, 게시할 수 있습니다.
pl: Interfejs wiersza polecenia platformy Aspire może służyć do tworzenia, uruchamiania i publikowania aplikacji opartych na platformie Aspire.
pt_br: A CLI do Aspire pode ser usada para criar, executar e publicar aplicações baseadas em Aspire.
ru: CLI Aspire можно использовать для создания, запуска и публикации приложений на основе Aspire.
tr: Aspire CLI, Aspire tabanlı uygulamalar oluşturmak, çalıştırmak ve yayımlamak için kullanılabilir.
zh_hans: Aspire CLI 可用于创建、运行和发布基于 Aspire 的应用程序。

# FirstTimeUseTelemetryNotice
source: Telemetry --------- The Aspire CLI collects usage data. It is collected by Microsoft and is used to help us improve your experience. You can opt out of telemetry by setting the ASPIRE_CLI_TELEMETRY_OPTOUT environment variable to '1' or 'true' using your preferred shell. Read more about Aspire CLI telemetry: https://aka.ms/aspire/cli-telemetry
es: Telemetría --------- La CLI de Aspire recopila datos de uso. Lo recopila Microsoft y se usa para ayudarnos a mejorar su experiencia. Puede rechazar la telemetría estableciendo la variable de entorno ASPIRE_CLI_TELEMETRY_OPTOUT en "1" o "true" mediante el shell que prefiera. Más información acerca de la telemetría de la CLI de Aspire: https://aka.ms/aspire/cli-telemetry
it: Dati di telemetria --------- L'interfaccia della riga di comando di Aspire raccoglie i dati di utilizzo. Vengono raccolti da Microsoft e usati per contribuire al miglioramento dell'esperienza. È possibile rifiutare esplicitamente la raccolta dei dati di telemetria impostando la variabile di ambiente ASPIRE_CLI_TELEMETRY_OPTOUT su "1" o "true" nella shell preferita. Altre informazioni sui dati di telemetria dell'interfaccia della riga di comando di Aspire: https://aka.ms/aspire/cli-telemetry
ko: 원격 분석 --------- Aspire CLI는 사용량 현황 데이터를 수집합니다. Microsoft에서는 이를 수집하여 사용자 환경을 개선하는 데 활용합니다. 원하는 셸에서 ASPIRE_CLI_TELEMETRY_OPTOUT 환경 변수를 '1' 또는 'true'로 설정하여 원격 분석을 옵트아웃할 수 있습니다. Aspire CLI 원격 분석에 대해 자세히 알아보기: https://aka.ms/aspire/cli-telemetry
pl: Telemetria --------- Interfejs wiersza polecenia usługi Aspire zbiera dane o użyciu. Dane te są zbierane przez firmę Microsoft i pomagają nam ulepszać Twoje doświadczenia. Możesz zrezygnować z telemetrii, ustawiając dla zmiennej środowiskowej DOTNET_CLI_TELEMETRY_OPTOUT wartość „1” lub „true” przy użyciu preferowanej powłoki. Dowiedz się więcej o telemetrii wiersza polecenia usługi Aspire: https://aka.ms/aspire/cli-telemetry
pt_br: Telemetria --------- A CLI do Aspire coleta dados de uso. Eles são coletados pela Microsoft e usados para nos ajudar a melhorar sua experiência. Você pode recusar a telemetria definindo a variável de ambiente DOTNET_CLI_TELEMETRY_OPTOUT como "1" ou "true" usando seu shell favorito. Leia mais sobre a telemetria da CLI do Aspire: https://aka.ms/aspire/cli-telemetry
ru: Телеметрия --------- Aspire CLI собирает данные об использовании. Корпорация Майкрософт собирает и использует их для улучшения взаимодействия. Вы можете отказаться от отправки телеметрии, установив значение "1" или "true" для переменной среды ASPIRE_CLI_TELEMETRY_OPTOUT в предпочтительной оболочке. Подробнее о телеметрии Aspire CLI: https://aka.ms/aspire/cli-telemetry
tr: Telemetri ---------- Aspire CLI kullanım verilerini toplar. Microsoft tarafından toplanır ve deneyiminizi geliştirmemize yardımcı olması için kullanılır. Telemetriyi geri çevirmek için tercih ettiğiniz kabuğu kullanarak ASPIRE_CLI_TELEMETRY_OPTOUT ortam değişkenini '1' veya 'true' olarak ayarlayabilirsiniz. Aspire CLI telemetrisi hakkında daha fazla bilgi edinin: https://aka.ms/aspire/cli-telemetry
zh_hans: 遥测 --------- Aspire CLI 收集使用情况数据。该数据由 Microsoft 收集，用于帮助我们提升你的体验。可以通过使用首选 shell 将环境变量 ASPIRE_CLI_TELEMETRY_OPTOUT 设置为 "1" 或 "true" 来选择退出遥测。 详细了解 Aspire CLI 遥测: https://aka.ms/aspire/cli-telemetry

# FirstTimeUseWelcome
source: Welcome to Aspire! Learn more about Aspire at https://aspire.dev
it: Vi diamo il benvenuto in Aspire! Per altre informazioni su Aspire, vedere https://aspire.dev
ko: Aspire에 오신 것을 환영합니다! https://aspire.dev에서 Aspire에 대해 자세히 알아보기
pl: Witamy w usłudze Aspire! Dowiedz się więcej o usłudze Aspire na https://aspire.dev
pt_br: Bem-vindo(a) ao Aspire! Saiba mais sobre o Aspire em https://aspire.dev
ru: Добро пожаловать в Aspire! Подробнее об Aspire см. на странице https://aspire.dev
tr: Aspire'a hoş geldiniz! Aspire hakkında daha fazla bilgi için https://aspire.dev adresini ziyaret edin
zh_hans: 欢迎使用 Aspire!如需详细了解 Aspire，请访问 https://aspire.dev

# NoLogoArgumentDescription
source: Suppress the startup banner and telemetry notice.
es: Suprima el banner de inicio y el aviso de telemetría.
it: Consente di disabilitare il banner di avvio e l'avviso di telemetria.
ko: 시작 배너 및 원격 분석 알림을 표시하지 않습니다.
pl: Wstrzymaj baner startowy i powiadomienie o telemetrii.
pt_br: Suprima a faixa de inicialização e o aviso de telemetria.
ru: Отключить баннер запуска и уведомление о телеметрии.
tr: Başlangıç başlığını ve telemetri bildirimini gizle.
zh_hans: 抑制显示启动横幅和遥测通知。

# WaitForDebuggerArgumentDescription
source: Wait for a debugger to attach before executing the command.
es: Espere a que se asocie un depurador antes de ejecutar el comando.
it: Attendi che un debugger si connetta prima di eseguire il comando.
ko: 명령을 실행하기 전에 디버거가 연결되기를 기다리세요.
pl: Przed wykonaniem polecenia poczekaj na dołączenie debugera.
pt_br: Aguarde um depurador anexar antes de executar o comando.
ru: Дождитесь подключения отладчика, прежде чем выполнять команду.
tr: Komutu yürütmeden önce hata ayıklayıcısının eklenmesini bekleyin.
zh_hans: 在执行命令之前，请等待附加调试程序。

# WaitingForDebugger
source: Waiting for debugger to attach to CLI process ID: {0}
es: Esperando a que el depurador se asocie al id. de proceso de la CLI: {0}
it: In attesa del collegamento del debugger all'ID processo dell'interfaccia della riga di comando: {0}
ko: 디버거가 CLI 프로세스 ID에 연결하기를 기다리는 중: {0}
pl: Oczekiwanie na dołączenie debugera do identyfikatora procesu interfejsu wiersza polecenia: {0}
pt_br: Aguardando o depurador anexar ao processo CLI ID: {0}
ru: Ожидание подключения отладчика к процессу CLI с идентификатором: {0}
tr: Hata ayıklayıcısının CLI işlem kimliğine eklenmesi bekleniyor: {0}
zh_hans: 正在等待调试程序附加到 CLI 进程 ID: {0}
