Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/RunCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AgentConfigurationMaybeLater
source: Maybe later
cs: Možná později
de: Vielleicht später
es: Quizás más tarde
fr: Peut-être plus tard
it: Forse più tardi
ja: 後で
ko: 나중에
pt_br: Talvez mais tarde
tr: Belki daha sonra
zh_hans: 稍后再说
zh_hant: 稍後再說

# AgentConfigurationNo
source: No
cs: Ne
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
tr: Hayır
zh_hans: 否
zh_hant: 否

# AgentConfigurationPrompt
source: Aspire has detected {0} agentic coding environment(s) to configure. Would you like to configure now?
cs: Aspire zjistil agentní programovací prostředí (celkem {0}), která je potřeba nakonfigurovat. Chcete teď provést konfiguraci?
de: Aspire hat {0} agentische Codierungsumgebung(en) zur Konfiguration erkannt. Möchten Sie jetzt konfigurieren?
es: Aspire ha detectado {0} entornos de codificación de agente que configurar. ¿Desea configurar ahora?
fr: Aspire a détecté {0} environnement(s) de codage agentique à configurer. Voulez-vous configurer maintenant ?
it: Aspire ha rilevato {0} ambienti di codifica agentici da configurare. Configurare ora?
ja: Aspire は、構成するエージェント コーディング環境を {0} 件検出しました。今すぐ構成しますか?
ko: {0} 에이전트 코딩 환경을 구성하도록 검색했습니다. 지금 구성하시겠습니까?
pt_br: O Aspire detectou {0} ambientes de codificação agênticos para configurar. Deseja configurar agora?
tr: Aspire, yapılandırılacak {0} aracılı kodlama ortamı algıladı. Şimdi yapılandırmak istiyor musunuz?
zh_hans: Aspire 检测到 {0} 个智能体编码环境需要配置。是否现在要配置?
zh_hant: Aspire 已偵測到 {0} 個代理式程式碼環境。您想現在進行設定嗎?

# AgentConfigurationSelectPrompt
source: Select agent environments to configure:
cs: Vyberte prostředí agentů, která se mají nakonfigurovat:
de: Wählen Sie die Agentumgebungen aus, die konfiguriert werden sollen:
es: Seleccione los entornos de agente que desea configurar:
fr: Sélectionnez les environnements d’agent à configurer :
it: Selezionare gli ambienti agente da configurare:
ja: 構成するエージェント環境を選択してください:
ko: 구성할 에이전트 환경 선택:
pl: Wybierz środowiska agentów do skonfigurowania:
pt_br: Selecione ambientes de agente a serem configurados:
tr: Yapılandırılacak aracı ortamlarını seçin:
zh_hans: 选择要配置的智能体环境:
zh_hant: 請選取要設定的代理程式環境:

# AgentConfigurationYes
source: Yes
cs: Ano
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
tr: Evet
zh_hans: 是
zh_hant: 是

# AppHostExitedWithCode
source: AppHost process exited with code {0}.
cs: Proces AppHost byl ukončen s kódem {0}.
de: Der AppHost-Prozess wurde mit Code {0} beendet.
es: El proceso AppHost se cerró con código {0}.
fr: Processus AppHost arrêté avec le code {0}.
ja: AppHost プロセスが終了し、コード {0} を返しました。
ko: AppHost 프로세스가 {0} 코드로 종료되었습니다.
pl: Proces hosta aplikacji zakończył się z kodem {0}.
pt_br: O processo AppHost foi encerrado com o código {0}.
zh_hant: AppHost 程序以返回碼 {0} 結束。

source: AppHost failed to build.
ja: AppHost を構築できませんでした。

source: AppHost started successfully.
cs: Hostitel aplikací (AppHost) se úspěšně spustil.
de: Der AppHost wurde erfolgreich gestartet.
es: AppHost se ha iniciado correctamente.
fr: AppHost a démarré correctement.
ja: AppHost が正常に起動しました。
ko: AppHost를 시작했습니다.
pl: Host aplikacji został pomyślnie uruchomiony.
pt_br: AppHost iniciado com sucesso.
zh_hant: 已成功啟動 AppHost。

# CheckLogsForDetails
source: Check logs for details: {0}
cs: Podrobnosti najdete v protokolech: {0}
de: Details finden Sie in den Protokollen: {0}
es: Compruebe los registros para obtener más información: {0}
fr: Pour en savoir plus, consultez les journaux : {0}
ja: 詳細については、ログを確認してください: {0}
ko: 자세한 내용은 로그를 확인하세요. {0}
pl: Sprawdź dzienniki, aby uzyskać szczegółowe informacje: {0}
pt_br: Verifique os logs para obter detalhes: {0}
zh_hant: 檢查記錄以取得詳細資料: {0}

source: Checking for running instances...
cs: Kontrolují se spuštěné instance...
de: Es wird nach ausgeführten Instanzen gesucht…
es: Comprobando si hay instancias en ejecución...
fr: Vérification des instances en cours d’exécution...
ja: 実行中のインスタンスを確認しています...
ko: 실행 중인 인스턴스를 확인하는 중...
pt_br: Verificando se há instâncias em execução...
zh_hant: 正在檢查是否有正在執行的執行個體...

source: Connecting to apphost...
cs: Připojování k hostiteli aplikací...
de: Verbindung zum AppHost wird hergestellt...
es: Conectando con apphost...
fr: Connexion à apphost...
it: Connessione all'AppHost Aspire in corso...
ja: AppHost に接続しています...
ko: apphost에 연결하는 중...
pl: Trwa łączenie z hostem AppHost...
pt_br: Conectando ao apphost...
tr: Apphost'a bağlanılıyor...
zh_hans: 正在连接到应用主机...
zh_hant: 正線連線到 AppHost...

# CopyingUserSecrets
source: Copying user secrets for isolated mode...
cs: Kopírování tajných kódů uživatele pro izolovaný režim...
de: Benutzergeheimnisse für den isolierten Modus werden kopiert…
es: Copiando secretos de usuario para el modo aislado...
fr: Copie des secrets utilisateur pour le mode isolé...
ja: ユーザー シークレットを分離モード用にコピーしています...
ko: 격리 모드용 사용자 암호를 복사하는 중...
pl: Kopiowanie wpisów tajnych użytkownika do trybu izolowanego...
pt_br: Copiando os segredos do usuário para o modo isolado...
zh_hant: 正在複製隔離模式的使用者袐密...

source: Dashboard
cs: Řídicí panel
es: Panel
fr: Tableau de bord
ja: ダッシュボード
ko: 대시보드
pl: Pulpit nawigacyjny
pt_br: Painel
ru: Панель мониторинга
tr: Pano
zh_hans: 仪表板
zh_hant: 儀表板

# DashboardFailedToStart
source: Aspire Dashboard failed to start.
cs: Řídicí panel Aspire se nepovedlo spustit.
de: Fehler beim Starten des Aspire-Dashboards.
es: No se pudo iniciar el panel de Aspire.
fr: Nous n’avons pas pu lancer le tableau de bord Aspire.
it: Avvio del dashboard di Aspire non riuscito.
ja: Aspire ダッシュボードの起動に失敗しました。
ko: Azure 대시보드를 시작하지 못했습니다.
pl: Nie udało się uruchomić pulpitu nawigacyjnego Aspire.
pt_br: Falha ao iniciar o Painel do Aspire.
ru: Не удалось запустить панель управления Aspire.
tr: Aspire Pano başlatılamadı.
zh_hans: Aspire 仪表板启动失败。
zh_hant: Aspire 儀表板啟動失敗。

# Description
source: Run an Aspire AppHost interactively for development.
es: Ejecutar un apphost de Aspire en modo de desarrollo.
ja: 開発用に Aspire AppHost を対話形式で実行します。
zh_hant: 在開發模式中執行 Aspire AppHost。

# DetachArgumentDescription
source: Run the AppHost in the background and exit after it starts.
cs: Spusťte AppHost na pozadí a po spuštění ho ukončete.
de: Führen Sie den AppHost im Hintergrund aus und beenden Sie ihn, sobald er gestartet ist.
es: Ejecute AppHost en segundo plano y cierre la aplicación una vez que se inicie.
fr: Exécuter AppHost en arrière-plan et le quitter après son démarrage.
ja: AppHost をバックグラウンドで実行し、起動後に終了させます。
ko: AppHost를 백그라운드에서 실행하고 시작되면 종료합니다.
pl: Uruchom hosta aplikacji w tle i zakończ po jego uruchomieniu.
pt_br: Execute o AppHost em segundo plano e saia depois que ele for iniciado.
zh_hant: 在背景執行 AppHost，啟動後即退出。

source: Endpoints
cs: Koncové body
de: Endpunkte
es: Puntos de conexión
fr: Points de terminaison
it: Endpoint
ja: エンドポイント
ko: 엔드포인트
pl: Punkty końcowe
pt_br: Pontos de Extremidade
ru: Конечные точки
tr: Uç Noktalar
zh_hans: 终结点
zh_hant: 端點

# FailedToStartAppHost
source: Failed to start the AppHost.
cs: Nepovedlo se spustit AppHost.
de: Fehler beim Starten des AppHost.
es: Error al iniciar AppHost.
fr: Échec du démarrage d’AppHost.
ja: AppHost を起動できませんでした。
ko: AppHost를 시작하지 못 했습니다.
pl: Nie udało się uruchomić hosta aplikacji.
pt_br: Falha ao iniciar o AppHost.
zh_hant: 無法啟動 AppHost。

# ForceArgumentDescription
source: Stop any running instance of the AppHost without prompting.
cs: Zastavte všechny běžící instance AppHost bez výzvy.
de: Beenden Sie alle ausgeführten Instanzen von AppHost ohne Aufforderung.
es: Detenga cualquier instancia en ejecución de AppHost sin pedir confirmación.
fr: Arrêtez les instances en cours d’exécution de AppHost sans requête.
it: Arresta qualsiasi istanza in esecuzione di AppHost senza chiedere conferma.
ja: プロンプトを表示せずに AppHost の実行中のインスタンスを停止します。
ko: 프롬프트 없이 AppHost의 실행 중인 인스턴스를 중지합니다.
pt_br: Pare qualquer instância em execução do AppHost sem avisos.
zh_hans: 在不提示的情况下停止任何正在运行的 AppHost 实例。
zh_hant: 停止任何正在執行的 AppHost 執行個體，且不顯示提示。

# FormatRequiresDetach
source: The --format option can only be used together with --detach.
cs: Možnost --format lze použít pouze společně s parametrem --detach.
de: Die Option „--format“ kann nur zusammen mit „--detach“ verwendet werden.
es: La opción --format solo se puede usar junto con --detach.
fr: L’option --format ne peut être utilisée qu’avec --detach.
ja: --format オプションは、--detach との組み合わせでのみ使用できます。
ko: --format 옵션은 --detach와만 함께 사용할 수 있습니다.
pl: Opcji --format można używać tylko razem z opcją --detach.
pt_br: A opção --format só pode ser usada junto com --detach.
zh_hant: --format 選項只能搭配 --detach 使用。

# Health
source: The health of the resource, eg Healthy
cs: Stav prostředku, např. V pořádku
de: Die Integrität der Ressource, z. B. fehlerfrei
es: El estado del recurso, por ejemplo, Correcto
fr: L’état de la ressource, par exemple, Sain
it: Integrità della risorsa, ad esempio Integro
ja: リソースの正常性 (正常など)
ko: 리소스의 상태, 예: 정상
pl: Kondycja zasobu, np. w dobrej kondycji
pt_br: A integridade do recurso, por exemplo, Íntegro
ru: Работоспособность ресурса, например "Работоспособен"
tr: Kaynağın durumu, örneğin İyi Durumda
zh_hans: 资源的运行状况，例如“正常”
zh_hant: 資源的健康狀況，例如：健康

source: IsCompatibleAppHost is null
cs: IsCompatibleAppHost má hodnotu null.
de: IsCompatibleAppHost ist NULL.
es: IsCompatibleAppHost es null
fr: IsCompatibleAppHost est nul
it: IsCompatibleAppHost è null
ja: IsCompatibleAppHost が null です
ko: IsCompatibleAppHost가 null입니다
pl: Element IsCompatibleAppHost ma wartość null
ru: Значение параметра IsCompatibleAppHost равно null
tr: IsCompatibleAppHost öğesinin değeri null
zh_hans: IsCompatibleAppHost 为 null
zh_hant: IsCompatibleAppHost 為 null

# JsonArgumentDescription
source: Output format for detached AppHost results.
es: Resultado de salida como JSON (solo válido con --detach).
ja: デタッチされた AppHost 結果の出力形式です。
zh_hant: 輸出結果為 JSON (僅於使用 --detach 時有效)。

# IsolatedArgumentDescription
source: Run in isolated mode with randomized ports and isolated user secrets, allowing multiple instances to run simultaneously.
cs: Spouštějte v izolovaném režimu s náhodnými porty a izolovanými tajnými kódy uživatelů, což umožňuje, aby několik instancí běželo současně.
de: Im isolierten Modus mit zufälligen Ports und getrennten Benutzergeheimnissen ausführen, sodass mehrere Instanzen gleichzeitig laufen können.
es: Ejecutar en modo aislado con puertos aleatorios y secretos de usuario aislados, lo que permite que varias instancias se ejecuten simultáneamente.
fr: Exécuter en mode isolé avec des ports aléatoires et des secrets utilisateur isolés, ce qui permet à plusieurs instances de fonctionner simultanément.
ja: ランダムなポートと分離されたユーザー シークレットを使って分離モードで実行し、複数のインスタンスを同時に実行できるようにします。
ko: 임의의 포트와 격리된 사용자 암호를 사용해 격리 모드로 실행하면 여러 인스턴스를 동시에 실행할 수 있습니다.
pl: Uruchom w trybie izolowanym z losowymi portami i izolowanymi wpisami tajnymi użytkownika, co pozwala na jednoczesne działanie wielu wystąpień.
pt_br: Execute no modo isolado com portas aleatórias e segredos de usuário isolados, permitindo que várias instâncias executem simultaneamente.
zh_hant: 在隔離模式中搭配隨機化連接埠和隔離的使用者袐密執行，允許同時執行多個執行個體。

# IsolatedModeRunningInstanceWarning
source: A running instance of this AppHost was found and will be stopped. To run multiple isolated instances simultaneously, run from different directories such as git worktree directories.
cs: Byla nalezena spuštěná instance tohoto hostitele aplikací a bude zastavena. Pokud chcete spustit více izolovaných instancí současně, spusťte je z různých adresářů, jako jsou adresáře pracovního stromu Gitu.
de: Eine laufende Instanz dieses AppHosts wurde gefunden und wird beendet. Um mehrere isolierte Instanzen gleichzeitig auszuführen, starten Sie sie aus verschiedenen Verzeichnissen, zum Beispiel aus Git-Worktree-Verzeichnissen.
es: Se ha encontrado una instancia en ejecución de este AppHost y se detendrá. Para ejecutar varias instancias aisladas simultáneamente, ejecute desde directorios diferentes, como directorios de árbol de trabajo de Git.
fr: Une instance en cours d’exécution de cet AppHost a été détectée et va être arrêtée. Pour exécuter plusieurs instances isolées simultanément, lancez-les depuis des répertoires différents, comme des répertoires git worktree.
ja: この AppHost の実行中のインスタンスが見つかったため、停止します。複数の分離したインスタンスを同時に実行するには、異なるディレクトリ (git worktree ディレクトリなど) から実行してください。
ko: 이 AppHost의 실행 중인 인스턴스가 발견되어 중지됩니다. 여러 개의 격리된 인스턴스를 동시에 실행하려면 git worktree 디렉터리와 같은 서로 다른 디렉터리에서 실행합니다.
pl: Znaleziono działające wystąpienie tego hosta aplikacji, które zostanie zatrzymane. Aby uruchomić jednocześnie wiele izolowanych wystąpień, uruchom je z różnych katalogów, na przykład katalogów drzewa roboczego usługi Git.
pt_br: Foi encontrada uma instância em execução deste AppHost, que será interrompida. Para executar várias instâncias isoladas simultaneamente, execute de diretórios diferentes, como diretórios do git worktree.
zh_hant: 找到此 AppHost 的一個執行中執行個體，將會停止。若要同時執行多個隔離的執行個體，請從 git worktree 目錄等不同目錄執行。

source: Logs
cs: Protokoly
de: Protokolle
es: Registros
fr: Journaux
it: Log
ja: ログ
ko: 로그
pl: Dzienniki
ru: Журналы
tr: Günlükler
zh_hans: 日志
zh_hant: 記錄

# NoBuildArgumentDescription
source: Do not build or restore the project before running.
fr: Ne générer ni ne restaurer le projet avant l’exécution.
ja: 実行する前にプロジェクトを構築または復元しないでください。

# NoBuildNotSupportedWithWatchMode
source: The --no-build option cannot be used when watch mode is enabled.
fr: L’option --no-build ne peut pas être utilisée lorsque le mode surveillance est activé.
ja: ウォッチ モードが有効な場合、--no-build オプションは使用できません。

# PressCtrlCToStopAppHost
source: Press [bold]CTRL+C[/] to stop the apphost and exit.
cs: Stisknutím kláves [bold]Ctrl+C[/] zastavíte hostitele aplikací a provedete ukončení.
de: Drücken Sie [bold]STRG+C[/], um den App-Host zu beenden und zu verlassen.
es: Presione [bold]CTRL+C[/] para detener el apphost y salir.
fr: Appuyez sur [bold]CTRL+C[/] pour arrêter l’apphost et quitter.
it: Premere [bold]CTRL+C[/] per arrestare l'apphost e uscire.
ja: [bold]Ctrl+C[/] キーを押して AppHost を停止して終了します。
ko: 앱 호스트를 중지하고 종료하려면 [bold]CTRL+C[/]를 누르세요.
pl: Naciśnij klawisze [bold]CTRL+C[/], aby zatrzymać hosta aplikacji i zakończyć.
pt_br: Pressione [bold]CTRL+C[/] para interromper o apphost e sair.
ru: Нажмите клавиши [bold]CTRL+C[/], чтобы остановить хост приложений и выйти.
tr: Apphost'u durdurmak ve çıkmak için [bold]CTRL+C[/] tuşlarına basın.
zh_hans: 按 [bold]Ctrl+C[/] 以停止应用主机并退出。
zh_hant: 按 [bold]CTRL+C[/] 停止 apphost 並結束。

# ProjectArgumentDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
de: Der Pfad zur Aspire AppHost-Projektdatei.
es: La ruta de acceso al archivo del proyecto host de la AppHost Aspire.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
ja: Aspire AppHost プロジェクト ファイルへのパス。
ko: Aspire AppHost 프로젝트 파일의 경로입니다.
pl: Ścieżka do pliku projektu hosta AppHost platformy Aspire.
pt_br: O caminho para o arquivo de projeto do Aspire AppHost.
tr: Aspire AppHost proje dosyasının yolu.
zh_hans: Aspire AppHost 项目文件的路径。
zh_hant: Aspire AppHost 專案檔案的路徑。

# ProjectCouldNotBeRun
source: The project could not be run. See logs at {0}
cs: Projekt nelze spustit. Protokoly najdete na {0}
fr: Désolé, le projet n’a pas pu être exécuté. Consultez les journaux à l’emplacement {0}
ja: プロジェクトを実行できませんでした。{0} でログを表示する
pt_br: Não foi possível executar o projeto. Ver logs em {0}

source: Resource
cs: Prostředek
de: Ressource
es: Recurso
fr: Ressource
it: Risorsa
ja: リソース
ko: 리소스
pl: Zasób
pt_br: Recurso
ru: Ресурс
tr: Kaynak
zh_hans: 资源
zh_hant: 資源

# RunningInstanceStopped
source: Running instance stopped successfully.
cs: Běžící instance byla úspěšně zastavena.
de: Die ausgeführte Instanz wurde erfolgreich beendet.
es: La instancia en ejecución se detuvo correctamente.
fr: L’instance en cours d’exécution s’est correctement arrêtée.
it: L'istanza in esecuzione è stata interrotta correttamente.
ja: 実行中のインスタンスは正常に停止しました。
ko: 실행 중인 인스턴스가 중지되었습니다.
pl: Uruchomione wystąpienie zostało zatrzymane pomyślnie.
pt_br: A instância em execução foi interrompida com sucesso.
zh_hans: 运行中的实例已成功停止。
zh_hant: 執行中的執行個體已成功停止。

# StartDebugSessionArgumentDescription
source: Whether to start a debug session, if running in an Aspire Terminal.
cs: Určuje, jestli se má spustit relace ladění, pokud běží v terminálu Aspire.
de: Gibt an, ob eine Debugsitzung gestartet werden soll, wenn sie in einem Aspire-Terminal ausgeführt wird.
es: Indique si se debe iniciar una sesión de depuración si se ejecuta en un terminal Aspire.
fr: Indique s’il faut démarrer une session de débogage lorsqu’il s’exécute dans un terminal Aspire.
it: Indica se avviare una sessione di debug, se si esegue in un terminale Aspire.
ja: Aspire ターミナルで実行されている場合に、デバッグ セッションを開始するかどうか。
ko: Aspire 터미널에서 실행 중일 때 디버그 세션을 시작할지 여부입니다.
pl: Określa, czy należy uruchomić sesję debugowania, jeśli jest uruchomiona w terminalu platformy Aspire.
pt_br: Se deve iniciar uma sessão de depuração, se estiver em execução no Aspire Terminal.
tr: Aspire Terminal'de çalışıyorsa, hata ayıklama oturumu başlatılıp başlatılmayacağı.
zh_hans: 是否在 Aspire 终端中运行时启动调试会话。
zh_hant: 是否要啟動偵測工作階段 (當在 Aspire 終端機中執行時)。

# StartingAppHost
source: Starting Aspire apphost...
cs: Spouští se hostitel aplikací Aspire...
de: Aspire-AppHost wird gestartet...
es: Iniciando apphost de Aspire...
fr: Démarrage d'Aspire apphost...
it: Avvio dell'AppHost Aspire in corso...
ja: Aspire AppHost を開始しています...
ko: Aspire apphost를 시작하는 중...
pl: Trwa uruchamianie hosta AppHost platformy Aspire...
pt_br: Iniciando o Aspire apphost...
tr: Aspire apphost başlatılıyor...
zh_hans: 正在启动 Aspire 应用主机...
zh_hant: 正在啟動 Aspire AppHost...

# StartingAppHostInBackground
source: Starting Aspire apphost in the background...
cs: Spouští se hostitel aplikací Aspire na pozadí...
de: Aspire-Apphost wird im Hintergrund gestartet…
es: Iniciando el host de aplicaciones Aspire en segundo plano...
fr: Démarrage de l’application Aspire en arrière-plan...
ja: バックグラウンドで Aspire apphost を起動しています...
ko: 백그라운드에서 Aspire apphost를 시작하는 중...
pl: Trwa uruchamianie hosta aplikacji Aspire w tle...
pt_br: Iniciando o apphost Aspire em segundo plano...
zh_hant: 正在背景啟動 Aspire apphost...

source: Starting dashboard...
cs: Spouští se řídicí panel...
de: Dashboard wird gestartet...
es: Iniciando el panel...
fr: Démarrage du tableau de bord...
it: Avvio del dashboard in corso...
ja: ダッシュボードを起動しています...
ko: 대시보드 시작 중...
pl: Trwa uruchamianie pulpitu nawigacyjnego...
pt_br: Iniciando o painel...
ru: Запускается панель мониторинга...
tr: Pano başlatılıyor...
zh_hans: 正在启动仪表板...
zh_hant: 正在啟動儀表板...

# StartingDebugSessionInExtension
source: Detected aspire run inside the Aspire extension, starting a debug session in VS Code...
cs: Bylo zjištěno spuštění Aspire v rozšíření Aspire, spouští se relace ladění ve VS Code...
de: Innerhalb der Aspire-Erweiterung wurde eine Aspire-Ausführung erkannt, und eine Debugsitzung wird in VS Code gestartet...
es: Se detectó una ejecución de Aspire dentro de la extensión Aspire, lo que inició una sesión de depuración en VS Code...
fr: Exécution d’Aspire détectée dans l’extension Aspire, démarrage d’une session de débogage dans VS Code...
it: Esecuzione Aspire rilevata all'interno dell'estensione Aspire, avvio di una sessione di debug in VS Code in corso...
ja: Aspire 拡張機能内で Aspire の実行が検出されました。VS Codeでデバッグ セッションを開始しています...
ko: Aspire 확장 내에서 Aspire 실행이 감지되어 VS Code에서 디버그 세션을 시작합니다...
pl: Wykryto przebieg platformy Aspire w rozszerzeniu platformy Aspire, uruchamiający sesję debugowania w programie VS Code...
pt_br: Execução Aspire detectada dentro da extensão Aspire, iniciando uma sessão de depuração no VS Code...
tr: Aspire uzantısı içinde Aspire çalıştırması algılandı, VS Code'da hata ayıklama oturumu başlatılıyor...
zh_hans: 检测到 Aspire 在 Aspire 扩展内运行，正在 VS Code 中启动调试会话...
zh_hant: 偵測到 Aspire 在 Aspire 擴充功能中執行，正在 VS Code 中啟動偵錯工作階段...

source: State
cs: Stav
de: Zustand
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
pl: Stan
pt_br: Estado
ru: Состояние
tr: Durum
zh_hans: 状态
zh_hant: 狀態

# TimeoutWaitingForAppHost
source: Timeout waiting for AppHost to start.
cs: Při čekání na spuštění hostitele aplikací (AppHost) vypršel časový limit.
de: Timeout beim Warten auf den Start des AppHost.
es: Tiempo de espera de inicio de AppHost.
fr: Délai d’attente pour le démarrage d’AppHost.
ja: AppHost の起動待機中にタイムアウトしました。
ko: AppHost가 시작될 때까지 기다리는 시간 제한입니다.
pl: Przekroczono limit czasu podczas oczekiwania na uruchomienie hosta aplikacji.
pt_br: Tempo limite de espera para o AppHost iniciar.
zh_hant: 等候 AppHost 啟動時發生逾時。

source: Type
cs: Typ
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pl: Typ
pt_br: Tipo
ru: Тип
tr: Tür
zh_hans: 类型
zh_hant: 類型

source: Waiting for apphost to start...
cs: Čeká se na spuštění hostitele aplikace...
de: Warten auf den Start des Apphosts…
es: Esperando a que se inicie apphost...
fr: En attente du démarrage d’AppHost...
ja: apphost の起動を待っています...
ko: apphost가 시작되기를 기다리는 중...
pt_br: Aguardando o apphost iniciar...
zh_hant: 正在等待 apphost 啟動...

# WatchArgumentDescription
source: Start project resources in watch mode.
cs: Umožňuje spustit prostředky projektu v režimu kukátka.
de: Starten Sie Projektressourcen im Überwachungsmodus.
es: Inicie los recursos del proyecto en modo de inspección.
fr: Démarrez les ressources du projet en mode surveillance.
it: Avvia le risorse del progetto in modalità di monitoraggio.
ja: watch モードでプロジェクト リソースを開始します。
ko: watch 모드에서 프로젝트 리소스를 시작합니다.
pt_br: Inicie os recursos do projeto no modo de inspeção.
ru: Запустите ресурсы проекта в режиме наблюдения.
tr: Proje kaynaklarını izleme modunda başlatın.
zh_hans: 在监视模式下启动项目资源。
zh_hant: 以監視模式啟動專案資源。

# Description
source: Run an Aspire apphost in development mode.
cs: Spusťte hostitele aplikací Aspire ve vývojovém režimu.
de: Führen Sie einen Aspire-App-Host im Entwicklungsmodus aus.
fr: Exécutez un hôte d’application Aspire en mode développement.
it: Esegui un AppHost Aspire in modalità di sviluppo.
ko: 개발 모드에서 Aspire 앱호스트를 실행합니다.
pl: Uruchamianie hosta AppHost platformy Aspire w trybie programowania.
pt_br: Execute um apphost do Aspire no modo de desenvolvimento.
tr: Geliştirme modunda bir Aspire uygulama ana işlemini çalıştırın.
zh_hans: 在开发模式下运行 Aspire 应用主机。

# JsonArgumentDescription
source: Output result as JSON (only valid with --detach).
cs: Výsledek výstupu ve formátu JSON (platný jenom s parametrem --detach).
de: Ausgabeergebnis als JSON (nur gültig mit --detach).
fr: Afficher le résultat au format JSON (valide uniquement avec --detach).
ko: JSON으로 결과를 출력합니다(--detach와 함께 사용 시에만 유효).
pl: Wyświetl wynik jako JSON (działa tylko z parametrem --detach).
pt_br: Resultado de saída como JSON (válido somente com --detach).

# ProcessId
source: PID
pl: Identyfikator PID

# ProjectCouldNotBeRun
source: The project could not be run. For more information run with --debug switch.
it: Non è possibile eseguire il progetto. Per altre informazioni, eseguire con l'opzione --debug.
ru: Не удалось запустить проект. Для получения дополнительных сведений запустите команду с параметром --debug.
tr: Proje çalıştırılamadı. Daha fazla bilgi için --debug anahtarıyla çalıştırın.
zh_hans: 无法运行该项目。有关详细信息，请使用 --debug 开关运行。

# RunningInstanceStopFailed
source: Failed to stop running instance. The process may have already exited.
it: Non è possibile arrestare l'istanza in esecuzione. Il processo potrebbe essere già terminato.
zh_hans: 无法停止正在运行的实例。进程可能已退出。

source: Connecting to app host...
ru: Подключение к хосту приложений...

# Description
source: Run an Aspire app host in development mode.
ru: Запустите хост приложений Aspire в режиме разработки.

# ProjectArgumentDescription
source: The path to the Aspire app host project file.
ru: Путь к файлу проекта хоста приложений Aspire.

# PromptForDebugging
source: Do you want to start a debugging session?
ru: Вы хотите начать сеанс отладки?
