Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/RunCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# StartingAppHost
source: Starting Aspire app host...
ru: Запускается хост приложений Aspire...
