Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/StopCommandStrings.*.xlf
Languages: cs, de, es, fr, ja, ko, pl, zh_hans, zh_hant

# AllOptionDescription
source: Stop all running AppHosts.
de: Beenden Sie alle ausgeführten AppHosts.
fr: Arrêter tous les AppHosts en cours d’exécution.
ja: 実行中のすべての AppHost を停止します。
pl: Zatrzymaj wszystkie działające hosty aplikacji.

source: AppHost stopped successfully.
cs: Hostitel aplikací se úspěšně zastavil.
de: AppHost wurde erfolgreich beendet.
es: AppHost se detuvo correctamente.
fr: AppHost s’est arrêtée avec succès.
ja: AppHost が正常に停止しました。
ko: AppHost가 중지되었습니다.
pl: Host aplikacji został pomyślnie zatrzymany.
zh_hans: 已成功停止 AppHost。
zh_hant: 已成功停止 AppHost。

# Description
source: Stop a running apphost or the specified resource.
cs: Zastavte spuštěného hostitele aplikací Aspire.
de: Beendet einen laufenden Apphost oder die angegebene Ressource.
es: Detenga un apphost en ejecución de Aspire.
fr: Arrêter un apphost en cours d’exécution ou la ressource spécifiée.
ja: 実行中の AppHost または指定したリソースを停止します。
ko: 실행 중인 apphost 또는 지정된 리소스를 중지합니다.
pl: Zatrzymaj działający host aplikacji lub określony zasób.
zh_hans: 停止正在运行的 apphost 或指定的资源。
zh_hant: 停止正在執行的 Aspire apphost。

# FailedToStopAppHost
source: Failed to stop the AppHost.
cs: Nepovedlo se zastavit hostitele aplikací.
de: Beim Beenden des AppHost ist ein Fehler aufgetreten.
es: No se pudo detener AppHost.
fr: Échec de l'arrêt d’AppHost.
ja: AppHost を停止できませんでした。
ko: AppHost를 중지하지 못했습니다.
pl: Nie można zatrzymać hosta aplikacji.
zh_hans: 停止 AppHost 失败。
zh_hant: 無法停止 AppHost。

# MultipleAppHostsNonInteractive
source: Multiple AppHosts are running. Use {0} to specify which one to stop, or use {1} to stop all of them.
de: Mehrere AppHosts sind aktiv. Verwenden Sie {0}, um anzugeben, welche beendet werden soll, oder {1} um sie alle zu beenden.
fr: Plusieurs AppHosts sont en cours d’exécution. Utilisez {0} pour spécifier celui à arrêter, ou utilisez {1} pour tous les arrêter.
ja: 複数の AppHost が実行されています。停止するものを指定するために {0} を使用するか、それらのすべてを停止するために {1} を使用します。
pl: Uruchomiono wiele hostów aplikacji. Użyj {0}, aby wskazać, który zatrzymać, lub użyj {1}, aby zatrzymać je wszystkie.

# MultipleAppHostsRunning
source: Multiple AppHosts are running. Use --apphost to specify which one to stop, or select one:
de: Mehrere AppHosts sind aktiv. Verwenden Sie --apphost, um anzugeben, welcher AppHost gestoppt werden soll, oder wählen Sie einen aus:
fr: Plusieurs AppHosts sont en cours d’exécution. Utilisez --apphost pour spécifier celui à arrêter ou sélectionnez-en un :
ja: 複数の AppHost が実行されています。--apphost を使用して停止するものを指定するか、次のいずれかを選択します。
pl: Uruchomiono wiele hostów aplikacji. Użyj opcji --apphost, aby określić, która ma zostać zatrzymana, lub wybierz jedną z nich:

# ProjectArgumentDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
de: Der Pfad zur Aspire AppHost-Projektdatei.
es: La ruta de acceso al archivo del proyecto host de la AppHost Aspire.
fr: Chemin d’accès au fichier projet AppHost Aspire.
ja: Aspire AppHost プロジェクト ファイルへのパス。
ko: Aspire AppHost 프로젝트 파일의 경로입니다.
pl: Ścieżka do pliku projektu hosta AppHost platformy Aspire.
zh_hans: Aspire AppHost 项目文件的路径。
zh_hant: Aspire AppHost 專案檔案的路徑。

# SelectAppHostAction
source: stop
de: Beenden
fr: arrêter
ja: 停止
pl: zatrzymaj

# StoppingAppHost
source: Stopping Aspire apphost...
cs: Spouští se hostitel aplikací Aspire...
de: Aspire-AppHost wird beendet …
es: Deteniendo apphost de Aspire...
fr: Arrêt d'Aspire apphost...
ja: Aspire apphost を停止しています...
ko: Aspire AppHost를 중지하는 중...
pl: Trwa zatrzymywanie hosta Aspire...
zh_hans: 正在停止 Aspire AppHost...
zh_hant: 正在停止 Aspire AppHost...

# AllAndProjectMutuallyExclusive
source: The {0} and {1} options cannot be used together.
de: Die Optionen {0} und {1} können nicht zusammen verwendet werden.
fr: Les options {0} et {1} ne peuvent pas être utilisées ensemble.
ja: {0} オプションと {1} オプションは同時に使用できません。
pl: Opcji {0} i {1} opcji nie można używać razem.

# AllAndResourceMutuallyExclusive
source: The {0} option cannot be used with a resource argument.
de: Die Option „{0}“ kann nicht mit einem Ressourcenargument verwendet werden.
fr: L’option {0} ne peut pas être utilisée avec un argument de ressource.
ja: {0} オプションは、リソース引数と一緒に使用できません。
pl: Opcji {0} nie można używać z argumentem zasobu.

# MultipleAppHostsRunning
source: Multiple AppHosts are running. Use --project to specify which one to stop, or select one:
cs: Je spuštěno více hostitelů aplikací. Pomocí --project určete, který z nich se má zastavit, nebo vyberte jednoho z nich:
es: Se están ejecutando varios AppHost. Use --project para especificar cuál se va a detener o seleccione uno:
ko: 여러 AppHost가 실행 중입니다. --project를 사용해 중지할 AppHost를 지정하거나 하나를 선택하세요.
zh_hans: 多个 AppHost 正在运行。使用 --project 指定要停止哪一个，或者选择一个:
zh_hant: 多個 AppHost 正在執行。請使用 --project 指定要停止的 AppHost，或從中選取一個:

# NoInScopeAppHostsShowingAll
source: No running AppHosts found in the current directory. Showing all running AppHosts:
cs: V aktuálním adresáři se nenašli žádní spuštění hostitelé aplikací. Zobrazují se všichni spuštění hostitelé aplikací:
es: No se encontró ningún AppHosts en ejecución en el directorio actual. Mostrando todos los AppHosts en ejecución:
ko: 현재 디렉터리에서 실행 중인 AppHost가 없습니다. 실행 중인 모든 AppHost를 표시하는 중입니다.
zh_hans: 当前目录中未找到正在运行的 AppHost。显示所有正在运行的 AppHost:
zh_hant: 目前目錄中找不到正在執行的 AppHost。顯示所有正在執行的 AppHost:

# NoRunningAppHostsFound
source: No running AppHosts found in scope.
cs: V oboru se nenašli žádní spuštění hostitelé aplikací.
es: No se encontraron AppHosts en ejecución en el ámbito.
ko: 범위 내에서 실행 중인 AppHost를 찾을 수 없습니다.
zh_hans: 未在范围内找到正在运行的 AppHost。
zh_hant: 在範圍內找不到正在執行的 AppHost。

source: Scanning for running AppHosts...
cs: Vyhledávání spuštěných hostitelů aplikací...
es: Buscando AppHosts en ejecución...
ko: 실행 중인 AppHost를 검색하는 중...
zh_hans: 正在扫描处于运行状态的 AppHost...
zh_hant: 正在掃描執行中的 AppHost...

# SelectAppHostToStop
source: Select an AppHost to stop:
cs: Vyberte hostitele aplikací, kterého chcete zastavit:
es: Seleccione un AppHost para detener:
ko: 중지할 apphost를 선택하세요.
zh_hans: 选择要停止的 AppHost:
zh_hant: 選取要停止的 AppHost:
