Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/TelemetryCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AppHostNotRunning
source: No running AppHost found. Use 'aspire run' to start one first.
cs: Nenašel se žádný spuštěný hostitel aplikací. Nejprve spusťte spuštění pomocí příkazu „aspire run“.
de: Es wurde kein aktiver AppHost gefunden. Verwenden Sie zuerst „aspire run“, um einen zu starten.
fr: Désolé, aucun AppHost en cours d’exécution n’a été trouvé. Utilisez « aspire run » pour en démarrer un.
it: Non è stato trovato alcun AppHost in esecuzione. Usare prima di tutto "aspire run" per avviarne uno.
ja: 実行中の AppHost は見つかりません。最初に 'aspire run' を使って起動してください。
pt_br: Nenhum AppHost em execução encontrado. Use "aspire run" para iniciar um primeiro.
ru: Запущенные хосты приложений не найдены. Сначала запустите один из них с помощью команды "aspire run".
tr: Çalışan AppHost bulunamadı. Önce birini başlatmak için 'aspire run' komutunu kullanın.
zh_hant: 找不到正在執行的 AppHost。請先使用 'aspire run' 啟動一個。

# DashboardApiNotAvailable
source: Dashboard API is not available. Ensure the AppHost is running with Dashboard enabled.
cs: Rozhraní API řídicího panelu není k dispozici. Ujistěte se, že hostitel aplikací běží s povoleným řídicím panelem.
de: Die Dashboard-API ist nicht verfügbar. Stellen Sie sicher, dass der AppHost mit aktiviertem Dashboard ausgeführt wird.
es: La API de panel no está disponible. Asegúrese de que AppHost se esté ejecutando con Panel habilitado.
fr: Désolé, l’API du tableau de bord n’est pas disponible. Vérifiez que AppHost fonctionne avec le tableau de bord activé.
it: L'API del dashboard non è disponibile. Verificare che AppHost sia in esecuzione con il dashboard abilitato.
ja: ダッシュボード API は利用できません。ダッシュボードが有効になっている状態で AppHost が実行されていることを確認します。
ko: 대시보드 API를 사용할 수 없습니다. AppHost가 대시보드를 활성화한 상태로 실행 중인지 확인하세요.
pl: Interfejs API pulpitu nawigacyjnego jest niedostępny. Upewnij się, że host aplikacji działa z włączonym pulpitem nawigacyjnym.
pt_br: A API do painel não está disponível. Verifique se o AppHost está em execução com o Painel habilitado.
ru: API панели мониторинга недоступен. Убедитесь, что AppHost запущен с включенной панелью мониторинга.
tr: Pano API'si kullanılamıyor. AppHost'un Pano özelliği etkin olarak çalıştığından emin olun.
zh_hans: 仪表板 API 不可用。请确保 AppHost 在运行时启用了仪表板。
zh_hant: 儀表板 API 無法使用。確保 AppHost 執行中且儀表板功能已啟用。

# Description
source: View OpenTelemetry data (logs, spans, traces) from a running apphost.
de: Zeigen Sie Telemetriedaten (Protokolle, Spans, Traces) einer laufenden Aspire-Anwendung an.
es: Ver los datos de telemetría (registros, intervalos, seguimientos) de una aplicación de Aspire en ejecución.
fr: Affichez les données de télémétrie (journaux, spans, traces) d’une application Aspire en cours d’exécution.
ko: 실행 중인 AppHost의 OpenTelemetry 데이터(로그, 범위, 추적)를 확인합니다.
zh_hans: 查看正在运行的 apphost 中的 OpenTelemetry 数据(日志、跨度、跟踪)。

# FailedToFetchTelemetry
source: Failed to fetch telemetry: {0}
cs: Nepodařilo se načíst telemetrii: {0}
de: Fehler beim Abrufen der Telemetrie: {0}
es: Error al capturar la telemetría: {0}
fr: Échec de la récupération de télémétrie : {0}
it: Non è possibile recuperare i dati di telemetria: {0}
ja: テレメトリをフェッチできませんでした: {0}
ko: 원격 분석을 가져오지 못했습니다. {0}
pl: Nie można pobrać telemetrii: {0}
pt_br: Falha ao buscar telemetria: {0}
ru: Не удалось получить телеметрию: {0}
tr: Telemetri getirilemedi: {0}
zh_hans: 未能获取遥测数据: {0}
zh_hant: 無法擷取遙測: {0}

# FollowOptionDescription
source: Stream telemetry in real-time as it arrives.
cs: Umožňuje streamovat telemetrii v reálném čase, jakmile dorazí.
de: Streamen Sie Telemetriedaten in Echtzeit, sobald sie eintreffen.
es: Transmitir datos de telemetría en tiempo real a medida que llegan.
fr: Diffuser la télémétrie en temps réel dès son arrivée.
it: Trasmetti i dati di telemetria in tempo reale non appena arrivano.
ja: テレメトリが到着すると、リアルタイムでストリーミングします。
ko: 원격 분석 데이터를 실시간으로 스트림합니다.
pl: Strumieniuj telemetrię w czasie rzeczywistym, gdy tylko nadejdzie.
pt_br: Transmita telemetria em tempo real conforme ela chega.
ru: Потоковая передача телеметрии в реальном времени по мере поступления.
tr: Telemetri geldikçe gerçek zamanlı olarak akışını yapın.
zh_hans: 在遥测数据到来时，将其实时流式传输。
zh_hant: 在遙測抵達時即時串流遙測。

# FormatOptionDescription
source: Output format (Table or Json).
cs: Výstupní formát (tabulka nebo JSON).
de: Ausgabeformat (Tabelle oder JSON).
es: Formato de salida (tabla o JSON).
fr: Format de sortie (Tableau ou JSON).
it: Formato di output (Tabella o JSON).
ja: 出力形式 (テーブルまたは JSON)。
ko: 출력 형식(테이블 또는 JSON)입니다.
pl: Format wyjściowy (tabela lub JSON).
pt_br: Formato de saída (Tabela ou Json).
ru: Формат вывода (таблица или JSON).
tr: Çıktı biçimi (Tablo veya Json).
zh_hans: 输出格式(表格或 Json)。
zh_hant: 輸出格式 (資料表或 Json)。

# HasErrorOptionDescription
source: Filter by error status (true to show only errors, false to exclude errors).
cs: Umožňuje filtrovat podle chybového stavu (true pro zobrazení pouze chyb, false pro vyloučení chyb).
de: Filtern Sie nach Fehlerstatus (true, um nur Fehler anzuzeigen; false, um Fehler auszuschließen).
es: Filtrar por estado de error (true para mostrar solo los errores, false para excluir errores).
fr: Filtrer selon le statut d’erreur (true pour afficher uniquement les erreurs, false pour exclure les erreurs).
it: Filtra per stato di errore (true per mostrare solo gli errori, false per escluderli).
ja: エラーの状態でフィルター処理します (エラーのみを表示する場合は true、エラーを除外するには false)。
ko: 오류 상태로 필터링합니다(true면 오류만, false면 오류 제외).
pl: Filtruj według statusu błędu (wartość true, aby pokazać tylko błędy, false, aby je wykluczyć).
pt_br: Filtrar por status de erro (true para mostrar apenas erros, false para excluir erros).
ru: Фильтрация по состоянию ошибки (true — показывать только ошибки, false — исключать ошибки).
tr: Hata durumuna göre filtreleyin (yalnızca hataları göstermek için true, hataları hariç tutmak için false).
zh_hans: 按错误状态筛选(true 表示仅显示错误，false 表示排除错误)。
zh_hant: 依錯誤狀態篩選 (true 以僅顯示錯誤，false 以排除錯誤)。

# LimitMustBePositive
source: The --limit value must be a positive number.
cs: Hodnota --tail musí být kladné číslo.
de: Der Wert für --limit muss eine positive Zahl sein.
es: El valor --limit debe ser un número positivo.
fr: La valeur --limit doit être un nombre positif.
it: Il valore --limit deve essere un numero positivo.
ja: --limit の値は正の数値である必要があります。
ko: --limit 값은 양수여야 합니다.
pl: Wartość --limit musi być liczbą dodatnią.
pt_br: O valor --limit deve ser um número positivo.
ru: Значение --limit должно быть положительным числом.
tr: --limit değeri, pozitif bir sayı olmalıdır.
zh_hans: --limit 值必须是正数。
zh_hant: --limit 值必須是正數。

# LimitOptionDescription
source: Maximum number of items to return.
cs: Maximální počet položek, které se mají vrátit.
de: Maximale Anzahl zurückzugebender Elemente.
es: Número máximo de elementos que se van a devolver.
fr: Nombre maximal d’éléments à retourner.
it: Numero massimo di elementi da restituire.
ja: 返される項目の最大数。
ko: 반환할 최대 항목 수입니다.
pl: Maksymalna liczba elementów do zwrócenia.
pt_br: Número máximo de itens a serem retornados.
ru: Максимальное возвращаемое количество элементов.
tr: Döndürülecek maksimum öğe sayısı.
zh_hans: 要返回的最大项目数。
zh_hant: 要傳回的項目數上限。

# LogsDescription
source: View structured logs from the Dashboard telemetry API.
cs: Umožňuje zobrazit strukturované protokoly z rozhraní API telemetrie řídicího panelu.
de: Zeigen Sie strukturierte Protokolle aus der Dashboard-Telemetrie-API an.
es: Ver los registros estructurados desde la API de telemetría del panel.
fr: Afficher les journaux structurés via l’API de télémétrie du tableau de bord.
it: Visualizza i log strutturati dall'API di telemetria del dashboard.
ja: ダッシュボード テレメトリ API から構造化ログを表示します。
ko: 대시보드 원격 분석 API에서 구조화된 로그를 확인합니다.
pl: Wyświetl strukturalne logi z interfejsu API telemetrii pulpitu nawigacyjnego.
pt_br: Veja os logs estruturados da API de telemetria do Painel.
ru: Просмотр структурированных журналов через API телеметрии панели мониторинга.
tr: Pano telemetri API'sinden yapılandırılmış günlükleri görüntüleyin.
zh_hans: 查看仪表板遥测 API 中的结构化日志。
zh_hant: 從儀表板遙測 API 檢視結構化記錄。

# NoInScopeAppHostsShowingAll
source: No AppHosts found in current directory. Showing all running AppHosts.
cs: V aktuálním adresáři se nenašli žádní hostitelé aplikací. Zobrazují se všichni spuštění hostitelé aplikací.
de: Im aktuellen Verzeichnis wurden keine AppHosts gefunden. Es werden alle aktiven AppHosts angezeigt.
fr: Désolé, aucun AppHosts n’a été trouvé dans le répertoire actif. Affichage de tous les AppHosts en cours d’exécution.
it: Nessun AppHost trovato nella directory corrente. Visualizzazione di tutti gli AppHost in esecuzione.
ja: 現在のディレクトリ内に AppHost が見つかりません。実行中のすべての AppHost を表示しています。
pt_br: Nenhum AppHosts encontrado no diretório atual. Mostrando todos os AppHosts em execução.
ru: Хосты приложений не найдены в текущем каталоге. Отображаются все запущенные хосты приложений.
tr: Geçerli dizinde AppHost bulunamadı. Tüm çalışan AppHost'lar gösteriliyor.
zh_hant: 在目前的目錄中找不到 AppHost。顯示所有正在執行的 AppHost。

# ProjectOptionDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
de: Der Pfad zur Aspire AppHost-Projektdatei.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
ja: Aspire AppHost プロジェクト ファイルへのパス。
pt_br: O caminho para o arquivo de projeto do Aspire AppHost.
ru: Путь к файлу проекта Aspire AppHost.
tr: Aspire AppHost proje dosyasının yolu.
zh_hant: Aspire AppHost 專案檔案的路徑。

# ResourceArgumentDescription
source: Filter by resource name.
cs: Filtrovat podle názvu prostředku.
de: Filtern Sie nach Ressourcennamen.
es: Filtrar por nombre de recurso.
fr: Filtrer par nom de ressource.
it: Filtrare per nome della risorsa.
ja: リソース名でフィルター処理します。
ko: 리소스 이름으로 필터링
pt_br: Filtre por nome de recurso.
ru: Фильтровать по имени ресурса.
tr: Kaynak adına göre filtreleyin.
zh_hans: 按资源名称筛选。
zh_hant: 依資源名稱篩選。

source: Scanning for running AppHosts...
cs: Vyhledávání spuštěných hostitelů aplikací...
de: Suche nach aktiven AppHosts …
fr: Recherche des AppHosts en cours d’exécution...
it: Analisi per l'esecuzione di AppHosts in corso...
ja: 実行中の AppHost をスキャンしています...
pt_br: Verificando se há AppHosts em execução...
ru: Выполняется сканирование на наличие запущенных хостов приложений...
tr: Çalışan AppHost'lar taranıyor...
zh_hant: 正在掃描執行中的 AppHost...

# SelectAppHost
source: Select an AppHost:
cs: Vyberte hostitele aplikací:
de: AppHost auswählen:
fr: Sélectionner un AppHost :
it: Selezionare un AppHost:
ja: AppHost を選択:
pt_br: Selecione um AppHost:
ru: Выберите хост приложения:
tr: AppHost seçin:
zh_hant: 選取 AppHost:

# SeverityOptionDescription
source: Filter logs by minimum severity (Trace, Debug, Information, Warning, Error, Critical).
cs: Umožňuje filtrovat protokoly podle minimální závažnosti (trasování, ladění, informace, upozornění, chyba, kritické).
de: Filtern Sie Protokolle nach minimaler Schwere (Trace, Debug, Information, Warnung, Fehler, Kritisch).
es: Filtrar los registros por gravedad mínima (Seguimiento, Depuración, Información, Advertencia, Error, Crítico).
fr: Filtrer les journaux selon la gravité minimale (Trace, Debug, Information, Warning, Error, Critical).
it: Filtra i log in base alla gravità minima (Traccia, Debug, Informazioni, Avviso, Errore, Critico).
ja: 最小重大度 (トレース、デバッグ、情報、警告、エラー、重大) でログをフィルター処理します。
ko: 최소 심각도(Trace, Debug, Information, Warning, Error, Critical)로 로그를 필터링합니다.
pl: Filtruj logi według minimalnego poziomu ważności (Śledzenie, Debugowanie, Informacja, Ostrzeżenie, Błąd, Krytyczne).
pt_br: Filtre os logs por severidade mínima (Rastreamento, Depuração, Informações, Aviso, Erro, Crítico).
ru: Фильтрация журналов по минимальному уровню серьезности (трассировка, отладка, информация, предупреждение, ошибка, критическое).
tr: Günlükleri en düşük önem derecesine göre filtreleyin (İzleme, Hata Ayıklama, Bilgi, Uyarı, Hata, Kritik).
zh_hans: 按最低严重级别(跟踪、调试、信息、警告、错误、严重)筛选日志。
zh_hant: 依最低嚴重性篩選記錄 (追蹤、偵錯、資訊、警告、錯誤、重大)。

# SpansDescription
source: View spans from the Dashboard telemetry API.
cs: Umožňuje zobrazit rozsahy z rozhraní API telemetrie řídicího panelu.
de: Zeigen Sie Bereiche aus der Dashboard-Telemetrie-API an.
es: Ver intervalos de la API de telemetría del panel.
fr: Afficher les intervalles à partir de l’API de télémétrie du tableau de bord.
it: Visualizza gli span dall'API di telemetria del dashboard.
ja: ダッシュボード テレメトリ API からスパンを表示します。
ko: 대시보드 원격 분석 API에서 범위를 확인합니다.
pl: Wyświetl zakresy z interfejsu API telemetrii pulpitu nawigacyjnego.
pt_br: Veja os spans da API de telemetria do Painel.
ru: Просмотр диапазонов через API телеметрии панели мониторинга.
tr: Pano telemetri API'sinden yayılmaları görüntüleyin.
zh_hans: 查看仪表板遥测 API 中的跨度。
zh_hant: 從儀表板遙測 API 檢視範圍。

# TraceIdArgumentDescription
source: The trace ID to view. If not specified, lists all traces.
de: Die anzuzeigende Trace-ID. Wenn keine angegeben wird, werden alle Traces aufgelistet.
es: El id. de rastreo que se desea ver. Si no se especifica, enumera todos los seguimientos.
fr: ID de trace à afficher. Si aucun n’est spécifié, liste toutes les traces.
ja: 表示するトレース ID。指定しない場合は、すべてのトレースが一覧表示されます。
ko: 조회할 추적 ID입니다. 지정하지 않으면 모든 추적이 나열됩니다.
pl: Identyfikator śledzenia do wyświetlenia. Jeśli nie zostanie podany, wyświetli listę wszystkich śledzeń.
ru: Идентификатор трассировки для просмотра. Если не указан, отображаются все трассировки.
zh_hans: 要查看的跟踪 ID。如果未指定，则列出所有跟踪。

# TraceIdOptionDescription
source: Filter by trace ID.
cs: Umožňuje filtrovat podle ID trasování.
de: Nach Ablaufverfolgungs-ID filtern.
es: Filtre por id. de seguimiento.
fr: Filtrer par ID de trace.
it: Filtra per ID traccia.
ja: トレース ID でフィルター処理します。
ko: 추적 ID로 필터링합니다.
pl: Filtruj według identyfikatora śledzenia.
pt_br: Filtrar por ID de rastreamento.
ru: Фильтровать по идентификатору трассировки.
tr: İzleme kimliğine göre filtreleyin.
zh_hans: 按跟踪 ID 筛选。
zh_hant: 依追蹤識別碼篩選。

# TraceNotFound
source: Trace with ID '{0}' was not found.
cs: Trasování s ID {0} nebylo nalezeno.
de: Ablaufverfolgung mit der ID „{0}“ wurde nicht gefunden.
es: No se encontró el seguimiento con el id. "{0}".
fr: La trace avec l’ID « {0} » n’a pas été trouvée.
it: Non sono state trovate tracce con ID '{0}'.
ja: ID '{0}' のトレースが見つかりませんでした。
ko: ID가 '{0}'인 추적을 찾을 수 없습니다.
pl: Nie znaleziono śledzenia o identyfikatorze „{0}”.
pt_br: O rastreamento com a ID ''{0}'' não foi encontrado.
ru: Не удалось найти трассировку с идентификатором "{0}".
tr: Kimliği '{0}' olan bir izleme bulunamadı.
zh_hans: 找不到 ID 为 "{0}" 的跟踪。
zh_hant: 找不到識別碼為 '{0}' 的追蹤。

# TracesDescription
source: View traces from the Dashboard telemetry API.
cs: Umožňuje zobrazit trasování z rozhraní API telemetrie řídicího panelu.
de: Zeigen Sie Ablaufverfolgungen aus der Dashboard-Telemetrie-API an.
es: Ver seguimientos desde la API de telemetría del panel.
fr: Afficher les traces via l’API de télémétrie du tableau de bord.
it: Visualizza le tracce dall'API di telemetria del dashboard.
ja: ダッシュボード テレメトリ API からトレースを表示します。
ko: 대시보드 원격 분석 API에서 추적을 확인하세요.
pl: Wyświetl ślady z interfejsu API telemetrii pulpitu nawigacyjnego.
pt_br: Veja os rastreamentos da API de telemetria do Painel.
ru: Просмотр трассировок через API телеметрии панели мониторинга.
tr: Pano telemetri API'sinden izlemeleri görüntüleyin.
zh_hans: 查看仪表板遥测 API 中的跟踪。
zh_hant: 從儀表板遙測 API 檢視追蹤。

# UnexpectedContentType
source: Dashboard API returned unexpected content type. Expected JSON response.
cs: Rozhraní API řídicího panelu vrátilo neočekávaný typ obsahu. Očekávala se odpověď JSON.
de: Die Dashboard-API hat einen unerwarteten Inhaltstyp zurückgegeben. JSON-Antwort erwartet.
es: La API de panel devolvió un tipo de contenido inesperado. Se esperaba una respuesta JSON.
fr: L’API du tableau de bord a renvoyé un type de contenu inattendu. Une réponse JSON est attendue.
it: L'API del dashboard ha restituito un tipo di contenuto imprevisto. Era prevista una risposta JSON.
ja: ダッシュボード API から予期しないコンテンツ タイプが返されました。JSON 応答が必要です。
ko: 대시보드 API에서 예상치 못한 콘텐츠 형식이 반환되었습니다. JSON 응답이 필요합니다.
pl: Interfejs API pulpitu nawigacyjnego zwrócił nieoczekiwany typ zawartości. Oczekiwano odpowiedzi w formacie JSON.
pt_br: A API do painel retornou um tipo de conteúdo inesperado. Resposta JSON esperada.
ru: API панели мониторинга вернул неожиданный тип содержимого. Ожидался ответ JSON.
tr: Pano API'si beklenmeyen içerik türü döndürdü. JSON yanıtı bekleniyordu.
zh_hans: 仪表板 API 返回了意外的内容类型。预期为 JSON 响应。
zh_hant: 儀表板 API 已傳回未預期的內容類型。預期的 JSON 回應。

# Description
source: View telemetry data (logs, spans, traces) from a running Aspire application.
cs: Umožňuje zobrazit telemetrická data (protokoly, rozsahy, trasování) ze spuštěné aplikace Aspire.
it: Visualizza i dati di telemetria (log, span, tracce) da un'applicazione Aspire in esecuzione.
ja: 実行中の Aspire アプリケーションのテレメトリ データ (ログ、スパン、トレース) を表示します。
pl: Wyświetl dane telemetryczne (logi, zakresy, śledzenia) z uruchomionej aplikacji Aspire.
pt_br: Veja os dados de telemetria (logs, spans, rastreamentos) de um aplicativo Aspire em execução.
ru: Просмотр данных телеметрии (журналы, диапазоны, трассировки) из запущенного приложения Aspire.
tr: Çalışan bir Aspire uygulamasından telemetri verilerini (günlükler, yayılmalar, izlemeler) görüntüleyin.
zh_hant: 從執行中的 Aspire 應用程式檢視遙測資料 (記錄、範圍、追蹤)。

# SelectAppHostAction
source: view telemetry for
ko: 원격 분석 데이터 보기
zh_hans: 查看以下项的遥测:
