Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/TemplatingStrings.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AspireAppHost_Description
source: Apphost project only
de: Aspire-App-Host
pl: Host aplikacji Aspire
pt_br: Host de Aplicativo Aspire

# AspireEmpty_Description
source: Empty apphost with Service Defaults project
de: Leere Aspire-App
pl: Pusta aplikacja Aspire
pt_br: Aplicativo Aspire Vazio

# AspireMSTest_Description
source: MSTest
de: Aspire-Testprojekt (MSTest)
es: Proyecto de prueba de Aspire (MSTest)
pl: Projekt testowy Aspire (MSTest)
pt_br: Projeto de Teste Aspire (MSTest)

# AspireNUnit_Description
source: NUnit
de: Aspire-Testprojekt (NUnit)
es: Proyecto de prueba de Aspire (NUnit)
pl: Projekt testowy Aspire (NUnit)
pt_br: Projeto de Teste Aspire (NUnit)

# AspireServiceDefaults_Description
source: Service Defaults project only
de: Standardwerte für den Aspire-Dienst
pl: Domyślne ustawienia usługi Aspire
pt_br: Padrões do Serviço Do Azure

# AspireStarter_Description
source: Sample starter with frontend and backend services
de: Aspire Starter-App
pl: Aplikacja startowa Aspire
pt_br: Aplicativo Inicial Aspire

# AspireXUnit_Description
source: xUnit
de: Aspire-Testprojekt (xUnit)
es: Proyecto de prueba de Aspire (xUnit)
pl: Projekt testowy Aspire (xUnit)
pt_br: Projeto de Teste Aspire (xUnit)

source: At least one template factory must be provided.
cs: Musí se zadat aspoň jeden objekt pro vytváření šablon.
de: Es muss mindestens eine Vorlagenfactory angegeben werden.
es: Se debe proporcionar al menos un generador de plantillas.
fr: Au moins une fabrique de modèles doit être fournie.
it: È necessario specificare almeno una factory di modelli.
ko: 하나 이상의 템플릿 센터를 제공해야 합니다.
pl: Należy podać co najmniej jedną fabrykę szablonów.
pt_br: Pelo menos uma fábrica de modelo deve ser fornecida.
ru: Необходимо предоставить хотя бы одну фабрику шаблонов.
tr: En az bir şablon atölyesi sağlanmalıdır.
zh_hans: 必须提供至少一个模板工厂。
zh_hant: 至少必須提供一個範本工廠。

# CertificateTrustError
source: An error occurred while trusting the certificates: {0}
cs: Při vytváření vztahu důvěryhodnosti k certifikátům došlo k chybě: {0}
de: Fehler beim Einstufen der Zertifikate als vertrauenswürdig: {0}
es: Se produjo un error al confiar en los certificados: {0}
fr: Une erreur s’est produite lors de l’approbation des certificats : {0}
it: Errore durante la verifica di attendibilità dei certificati: {0}
ko: 인증서의 신뢰성을 확인하는 중에 오류가 발생했습니다. {0}
pl: Wystąpił błąd podczas ustanawiania relacji zaufania z certyfikatem: {0}
pt_br: Ocorreu um erro ao confiar nos certificados: {0}
ru: При доверии сертификатам возникла ошибка: {0}
tr: Sertifikaları güvenilirken bir hata oluştu: {0}
zh_hans: 信任证书时出错: {0}
zh_hant: 信任憑證時發生錯誤: {0}

# CreatingNewProject
source: Creating new Aspire project...
cs: Vytváří se nový projekt Aspire...
de: Neues Aspire-Projekt wird erstellt...
es: Creando un nuevo proyecto de Aspire...
fr: Création d’un nouveau projet Aspire...
it: Creazione del nuovo progetto Aspire in corso...
ko: 새 Aspire 프로젝트를 만드는 중...
pl: Trwa tworzenie nowego projektu Aspire...
pt_br: Criando novo projeto Aspire...
ru: Создается новый проект Aspire...
tr: Yeni Aspire projesi oluşturuluyor...
zh_hans: 正在创建新的 Aspire 项目...
zh_hant: 正在建立新的 Aspire 專案...

# EnterXUnitVersion_Description
source: The version of xUnit.net to use for the test project.
cs: Verze xUnit.net, která se má použít pro testovací projekt
de: Die Version von xUnit.net, die für das Testprojekt verwendet werden soll.
es: La versión de xUnit.net que se utilizará para el proyecto de prueba.
fr: Version de xUnit.net à utiliser pour le projet de test.
it: Versione di xUnit.net da usare per il progetto di test.
ko: 테스트 프로젝트에 사용할 xUnit.net 버전입니다.
pl: Wersja xUnit.net do użycia w projekcie testowym.
pt_br: A versão do xUnit.net a ser usada para o projeto de teste.
ru: Версия xUnit.net, которую следует использовать для тестового проекта.
tr: Test projesi için kullanılacak xUnit.net sürümü.
zh_hans: 要用于测试项目的 xUnit.net 版本。
zh_hant: 測試專案要使用的 xUnit.net 版本。

# EnterXUnitVersion_Prompt
source: Enter the xUnit.net version to use
cs: Zadat verzi xUnit.net, která se má použít
de: Geben Sie die zu verwendende xUnit.net-Version ein.
es: Introduzca la versión de xUnit.net que se va a usar
fr: Entrez la version de xUnit.net à utiliser
it: Immettere la versione xUnit.net da usare
ko: 사용할 xUnit.net 버전을 입력하세요.
pl: Wprowadź wersję xUnit.net do użycia
pt_br: Digite a versão do xUnit.net a ser usada
ru: Укажите версию xUnit.net, которую следует использовать
tr: Kullanılacak xUnit.net sürümünü girin
zh_hans: 输入要使用的 xUnit.net 版本
zh_hant: 輸入要使用的 xUnit.net 版本

source: No
cs: Ne
de: Nein
fr: Non
ko: 아니요
pl: Nie
pt_br: Não
ru: Нет
tr: Hayır
zh_hans: 否
zh_hant: 否

# NoTemplateVersionsFound
source: No template versions were found. Please check your internet connection or NuGet source configuration.
cs: Nenašly se žádné verze šablon. Zkontrolujte prosím připojení k internetu nebo zdrojovou konfiguraci NuGet.
de: Es wurden keine Vorlagenversionen gefunden. Überprüfen Sie Ihre Internetverbindung oder NuGet-Quellkonfiguration.
es: No se encontraron versiones de plantilla. Compruebe la conexión a Internet o la configuración de origen de NuGet.
fr: Aucune version de modèle n’a été trouvée. Veuillez vérifier votre connexion Internet ou la configuration de la source NuGet.
it: Non sono state trovate versioni del modello. Controllare la connessione Internet o la configurazione dell'origine NuGet.
ko: 템플릿 버전을 찾을 수 없습니다. 인터넷 연결 또는 NuGet 원본 구성을 확인하세요.
pl: Nie znaleziono żadnych wersji szablonu. Sprawdź połączenie internetowe lub konfigurację źródła NuGet.
pt_br: Nenhuma versão de modelo foi encontrada. Verifique sua conexão com a internet ou a configuração da fonte NuGet.
ru: Версии шаблонов не найдены. Проверьте подключение к Интернету и конфигурацию источника NuGet.
tr: Herhangi bir şablon sürümü bulunamadı. Lütfen internet bağlantınızı veya NuGet kaynak yapılandırmanızı kontrol edin.
zh_hans: 找不到模板版本。请检查 Internet 连接或 NuGet 源配置。
zh_hant: 找不到範本版本。請檢查您的網際網路連線或 NuGet 來源設定。

source: None
cs: Žádné
de: Keine
es: Ninguno
fr: Aucun
it: Nessuno
ko: 없음
pl: Brak
pt_br: Nenhum
ru: Нет
tr: Hiçbiri
zh_hans: 无
zh_hant: 無

# ProjectCreatedSuccessfully
source: Project created successfully in {0}.
cs: Projekt se úspěšně vytvořil v cestě {0}.
de: Das Projekt wurde erfolgreich in {0} erstellt.
es: Proyecto creado correctamente en {0}.
fr: Projet créé avec succès dans {0}.
it: Progetto creato con successo in {0}.
ko: {0}에 프로젝트가 성공적으로 생성되었습니다.
pl: Pomyślnie utworzono projekt w programie {0}.
pt_br: Projeto criado com êxito no {0}.
ru: Проект успешно создан в {0}.
tr: Proje {0} konumunda başarıyla oluşturuldu.
zh_hans: 已在 {0} 中成功创建项目。
zh_hant: 已成功在 {0} 中建立專案。

# ProjectCreationFailed
source: Project creation failed with exit code {0}. For more information run with --debug switch.
cs: Vytvoření projektu se nezdařilo s ukončovacím kódem {0}. Další informace získáte spuštěním s přepínačem --debug.
de: Fehler bei der Projekterstellung. Exitcode {0}: Weitere Informationen erhalten Sie, wenn Sie mit dem Schalter „--debug“ ausführen.
es: Error al crear el proyecto con el código de salida {0}. Para obtener más información, ejecute con el modificador --debug.
fr: Échec de la création du projet avec le code de sortie {0}. Pour plus d’informations, exécutez avec le commutateur --debug.
it: Creazione del progetto non riuscita con codice di uscita {0}. Per altre informazioni, eseguire con l'opzione --debug.
ko: {0} 종료 코드를 이용하여 프로젝트 만들기에 실패했습니다. 자세한 내용을 보려면 --debug 스위치를 이용하여 실행하세요.
pl: Tworzenie projektu nie powiodło się z kodem zakończenia {0}. Aby uzyskać więcej informacji, uruchom polecenie przełącznika --debug.
pt_br: Falha na criação do projeto com código de saída {0}. Para mais informações, execute com a opção --debug.
ru: Не удалось создать проект. Код завершения: {0}. Для получения дополнительных сведений запустите команду с параметром --debug.
tr: Proje oluşturma başarısız oldu, çıkış kodu {0}. Daha fazla bilgi için --debug anahtarıyla çalıştırın.
zh_hans: 项目创建失败，退出代码为 {0}。有关详细信息，请使用 --debug 开关运行。
zh_hant: 專案建立失敗，結束代碼為 {0}。如需詳細資訊，請使用 --debug 切換執行。

# PromptForTFMOptions_Description
source: Configures whether to create a project for integration tests using MSTest, NUnit, or xUnit.net.
cs: Konfiguruje, jestli se má vytvořit projekt pro testy integrace pomocí MSTest, NUnit nebo xUnit.net.
de: Konfiguriert, ob ein Projekt für Integrationstests mit MSTest, NUnit oder xUnit.net erstellt werden soll.
es: Configura si se va a crear un proyecto para las pruebas de integración mediante MSTest, NUnit o xUnit.net.
fr: Configure s’il faut créer un projet pour les tests d’intégration à l’aide de MSTest, NUnit ou xUnit.net.
it: Consente di configurare se creare un progetto per i test di integrazione usando MSTest, NUnit o xUnit.net.
ko: MSTest, NUnit, xUnit.net을 사용하여 통합 테스트용 프로젝트를 만들지 여부를 구성합니다.
pl: Konfiguruje, czy utworzyć projekt na potrzeby testów integracji przy użyciu narzędzia MSTest, NUnit lub xUnit.net.
pt_br: Configura se será criado um projeto para testes de integração usando MSTest, NUnit ou xUnit.net.
ru: Указывает, с помощью какого средства создавать проект для интеграционных тестов: MSTest, NUnit или xUnit.net.
tr: MSTest, NUnit veya xUnit.net kullanarak tümleştirme testleri için bir proje oluşturulup oluşturulmayacağını yapılandırır.
zh_hans: 配置是使用 MSTest、NUnit 还是 xUnit.net 来创建集成测试的项目。
zh_hant: 設定是否要使用 MSTest、NUnit、或 xUnit.net 專案為整合測試建立專案。

# PromptForTFMOptions_Prompt
source: Do you want to create a test project?
cs: Chcete vytvořit testovací projekt?
de: Möchten Sie ein Testprojekt erstellen?
es: ¿Quiere crear un proyecto de prueba?
fr: Voulez-vous créer un projet de test ?
it: Si desidera creare un progetto di test?
ko: 테스트 프로젝트를 만드시겠어요?
pl: Czy chcesz utworzyć projekt testowy?
pt_br: Deseja criar um projeto de teste?
ru: Хотите создать тестовый проект?
tr: Bir test projesi oluşturmak ister misiniz?
zh_hans: 是否要创建测试项目?
zh_hant: 您要建立測試專案嗎？

# PromptForTFM_Prompt
source: Select a test framework
cs: Vybrat testovací architekturu
de: Testframework auswählen
es: Seleccione un marco de pruebas
fr: Sélectionnez un cadre de test
it: Selezionare un framework di test
ko: 테스트 프레임워크 선택
pl: Wybierz strukturę testową
pt_br: Selecionar uma estrutura de teste
ru: Выберите тестовую платформу
tr: Bir test çerçevesi seçin
zh_hans: 选择测试框架
zh_hant: 選取測試框架

# PromptForTFM_UsingForTesting
source: Using {0} for testing.
cs: Používá se {0} k testování.
de: {0} wird zu Testzwecken verwendet.
es: Uso de {0} para pruebas.
fr: Utilisation de {0} pour les tests.
it: Uso {0} per il test.
ko: 테스트에 {0} 사용을 진행합니다.
pl: Używanie {0} do testowania.
pt_br: Usando {0} para teste.
ru: Для тестирования используется {0}.
tr: Test için {0} kullanılıyor.
zh_hans: 使用 {0} 进行测试。
zh_hant: 使用 {0} 進行測試。

# SearchingForAvailableTemplateVersions
source: Searching for available project template versions...
cs: Hledají se dostupné verze šablon projektu...
de: Verfügbare Projektvorlagenversionen werden gesucht...
es: Buscando versiones de plantillas de proyecto disponibles...
fr: Recherche des versions de modèles de projet disponibles...
it: Ricerca delle versioni dei modelli di progetto disponibili in corso...
ko: 사용 가능한 프로젝트 템플릿 버전을 검색하는 중...
pl: Trwa wyszukiwanie dostępnych wersji szablonu projektu...
pt_br: Procurando versões disponíveis do modelo de projeto...
ru: Производится поиск доступных версий шаблонов проекта...
tr: Kullanılabilir proje şablonu sürümleri aranıyor...
zh_hans: 正在搜索可用的项目模板版本...
zh_hant: 正在搜尋可用的專案範本版本...

# TemplateInstallationFailed
source: The template installation failed with exit code {0}. For more information run with --debug switch.
cs: Instalace balíčku se nezdařila s ukončovacím kódem {0}. Další informace získáte spuštěním s přepínačem --debug.
de: Fehler bei der Vorlageninstallation. Exitcode {0}: Weitere Informationen erhalten Sie, wenn Sie mit dem Schalter „--debug“ ausführen.
es: La instalación de la plantilla falló con el código de salida {0}. Para obtener más información, ejecute con el modificador --debug.
fr: L’installation du modèle a échoué avec le code de sortie {0}. Pour plus d’informations, exécutez avec le commutateur --debug.
it: L'installazione del modello non è riuscita con codice di uscita {0}. Per altre informazioni, eseguire con l'opzione --debug.
ko: {0} 종료 코드를 이용한 템플릿 설치에 실패했습니다. 자세한 내용을 보려면 --debug 스위치를 이용하여 실행하세요.
pl: Instalacja szablonu nie powiodła się z kodem zakończenia {0}. Aby uzyskać więcej informacji, uruchom polecenie przełącznika --debug.
pt_br: A instalação do modelo falhou com o código de saída {0}. Para mais informações, execute com a opção --debug.
ru: Не удалось установить шаблон. Код завершения: {0}. Для получения дополнительных сведений запустите команду с параметром --debug.
tr: Şablon yüklemesi, {0} çıkış koduyla başarısız oldu. Daha fazla bilgi için --debug anahtarıyla çalıştırın.
zh_hans: 模板安装失败，退出代码为 {0}。有关详细信息，请使用 --debug 开关运行。
zh_hant: 範本安裝失敗，結束代碼為 {0}。如需詳細資訊，請使用 --debug 切換執行。

source: Unknown
cs: Neznámý
de: Unbekannt
es: Desconocido
fr: Inconnue
it: Unbekannt
ko: 알 수 없음
pl: Nieznany
pt_br: Desconhecido
ru: Unbekannt
tr: Bilinmiyor
zh_hans: 未知
zh_hant: 不明

# UseRedisCache_Description
source: Configures whether to setup the application to use Redis for caching.
cs: Nakonfiguruje, jestli se má aplikace nastavit tak, aby pro ukládání do mezipaměti používala Redis.
de: Konfiguriert, ob die Anwendung für die Verwendung von Redis für die Zwischenspeicherung eingerichtet werden soll.
es: Configura si se va a configurar la aplicación para que use Redis para el almacenamiento en caché.
fr: Permet la configuration s’il faut configurer l’application afin qu’elle utilise Redis pour la mise en cache.
it: Configurare se impostare l'applicazione per l'utilizzo di Redis per la memorizzazione nella cache.
ko: 캐싱에 Redis를 사용하도록 애플리케이션을 설정할지 여부를 구성합니다.
pl: Określa, czy konfigurować aplikację do korzystania z magazynu danych Redis na potrzeby buforowania.
pt_br: Configura se a aplicação será configurada para usar Redis como cache.
ru: Определяет, указывать ли приложению, что для кэширования следует использовать Redis.
tr: Uygulamanın önbelleğe alma için Redis’i kullanmak üzere ayarlanıp ayarlanmayacağını yapılandırır.
zh_hans: 配置是否将应用程序设置为使用 Redis 进行缓存。
zh_hant: 設定是否要將應用程式設為使用 Redis 進行快取。

# UseRedisCache_Prompt
source: Use Redis Cache
cs: Použít Redis Cache
de: Redis Cache verwenden
es: Usar Redis Cache
fr: Utiliser le cache Redis
it: Usare Cache Redis
ko: Redis Cache 사용
pl: Korzystanie z Redis Cache
pt_br: Usar Redis Cache
ru: Использовать Redis Cache
tr: Redis Cache'i kullan
zh_hans: 使用 Redis 缓存
zh_hant: 使用 Azure Cache for Redis

# UseRedisCache_UnexpectedChoice
source: Unexpected choice for Redis Cache option
cs: Neočekávaná volba pro možnost Redis Cache
de: Unerwartete Auswahl für Redis Cache-Option
es: Elección inesperada para la opción de Redis Cache
fr: Choix inattendu pour l’option de cache Redis
it: Scelta imprevista per l'opzione Cache Redis
ko: 예기치 않은 Redis Cache 옵션 선택
pl: Nieoczekiwany wybór opcji pamięci podręcznej Redis Cache
pt_br: Opção inesperada para Redis Cache
ru: Неожиданный выбор параметра Redis Cache
tr: Redis Cache seçeneği için beklenmedik tercih
zh_hans: Redis 缓存选项的意外选择
zh_hant: Redis 快取選項的未預期選擇

# UseRedisCache_UsingRedisCache
source: Using Redis Cache for caching.
cs: Používá se Redis Cache pro ukládání do mezipaměti.
de: Verwenden von Redis Cache zum Zwischenspeichern.
es: Uso de Redis Cache para el almacenamiento en caché.
fr: Utilisation de Redis Cache pour la mise en cache.
it: Utilizzo di Cache Redis per la memorizzazione nella cache.
ko: 캐싱을 위해 Redis Cache를 사용하고 있습니다.
pl: Używanie pamięci podręcznej Redis Cache do buforowania.
pt_br: Usando Redis Cache para cache.
ru: Для кэширования используется Redis Cache.
tr: Önbellekleme için Redis Cache kullanımı.
zh_hans: 使用 Redis 缓存进行缓存。
zh_hant: 使用 Redis 快取進行快取。

# UsingProjectTemplatesVersion
source: Using project templates version: {0}
cs: Použití verze šablon projektů: {0}
de: Verwenden der Projektvorlagenversion: {0}
es: Uso de la versión de plantillas de proyecto: {0}
fr: Utilisation de la version des modèles de projet : {0}
it: Uso della versione dei modelli di progetto: {0}
ko: 프로젝트 템플릿의 {0} 버전 사용
pl: Korzystanie z wersji szablonów projektu: {0}
pt_br: Usando versão dos modelos de projeto: {0}
ru: Используется версия шаблонов проекта: {0}
tr: Proje şablonları sürümü kullanılıyor: {0}
zh_hans: 使用项目模板版本: {0}
zh_hant: 使用專案範本版本: {0}

source: Yes
cs: Ano
de: Ja
es: Sí
fr: Oui
it: Sì
ko: 예
pl: Tak
pt_br: Sim
ru: Да
tr: Evet
zh_hans: 是
zh_hant: 是

# AspireEmpty_Description
source: AppHost and service defaults
cs: AppHost a výchozí nastavení služby
fr: AppHost et les paramètres par défaut du service
it: Impostazioni predefinite di AppHost e del servizio
ko: AppHost 및 서비스 기본값
ru: AppHost и службы по умолчанию
tr: AppHost ve hizmet varsayılanları
zh_hans: AppHost 和服务默认值
zh_hant: AppHost 和服務預設值

# AspireServiceDefaults_Description
source: Service defaults
cs: Výchozí hodnoty služby
fr: Paramètres par défaut du service
it: Impostazioni predefinite del servizio
ko: 서비스 기본값
ru: Значения по умолчанию для службы
tr: Hizmet varsayılanları
zh_hans: 服务默认值
zh_hant: 服務預設值

# AspireStarter_Description
source: Starter template
cs: Úvodní šablona
es: Aplicación de inicio de Aspire
fr: Modèle de démarrage
it: Modello di avvio
ko: 시작 템플릿
ru: Шаблон для начинающих
tr: Başlangıç şablonu
zh_hans: 入门模板
zh_hant: 入門範本

source: Getting templates...
cs: Načítají se šablony...
fr: Obtention des modèles...
it: Recupero dei modelli in corso...
ko: 템플릿을 가져오는 중...
ru: Получение шаблонов...
tr: Şablonlar alınıyor...
zh_hans: 正在获取模板...
zh_hant: 正在取得範本...

# IntegrationTestsTemplate_Description
source: Integration tests
cs: Integrační testy
fr: Tests d'intégration
it: Test di integrazione
ko: 통합 테스트
ru: Тесты интеграции
tr: Tümleştirme testleri
zh_hans: 集成测试
zh_hant: 整合測試

# ProjectAlreadyExists
source: The new project cannot be created because it would overwrite existing files in the output folder. Please remove or move the conflicting files, or choose a different location.
cs: Nový projekt nelze vytvořit, protože by přepsal existující soubory ve výstupní složce. Odeberte nebo přesuňte konfliktní soubory nebo zvolte jiné umístění.
fr: Nous ne pouvons pas créer le nouveau projet, car il écraserait les fichiers existants dans le dossier de sortie. Veuillez supprimer ou déplacer les fichiers en conflit, ou choisir un autre emplacement.
it: Non è possibile creare il nuovo progetto perché sovrascriverebbe i file esistenti nella cartella di output. Rimuovere o spostare i file in conflitto oppure scegliere un percorso diverso.
ru: Невозможно создать новый проект, так как он перезапишет существующие файлы в выходной папке. Удалите или переместите конфликтующие файлы либо выберите другое расположение.
tr: Yeni proje, çıktı klasöründeki mevcut dosyaları üzerine yazacağı için oluşturulamıyor. Çakışan dosyaları silin veya taşıyın ya da farklı bir konum seçin.
zh_hans: 无法创建新项目，因为它将覆盖输出文件夹中的现有文件。请移除或移动冲突的文件，或选择其他位置。
zh_hant: 無法建立新專案，因為它會覆寫輸出資料夾中的現有檔案。請移除或移動衝突的檔案，或選擇不同的位置。

# AspireAppHost_Description
source: Apphost only
es: Host de aplicaciones de Aspire

# AspireEmpty_Description
source: Apphost and service defaults
es: Aplicación vacía de Aspire

# AspireServiceDefaults_Description
source: Service defaults only
es: Valores predeterminados del servicio de Aspire
