Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/UpdateCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddedFeedFormat
source: Added: {0}
cs: Přidáno: {0}
de: Hinzugefügt: {0}
es: Agregado: {0}
fr: Ajouté : {0}
it: Aggiunto: {0}
ja: 追加済み: {0}
ko: 추가됨: {0}
pl: Dodano: {0}
pt_br: Adicionado: {0}
ru: Добавлено: {0}
tr: Eklendi: {0}
zh_hans: 已添加: {0}
zh_hant: 已新增: {0}

source: Analyze App Host
cs: Analyzovat hostitele aplikací
de: App-Host analysieren
es: Analizar host de aplicación
fr: Analyser l’hôte d’application
it: Analizza host delle app
ja: アプリ ホスティング プロセスの分析
ko: 앱 호스트 분석
pl: Analizowanie hosta aplikacji
pt_br: Analisar o Host de Aplicativo
ru: Анализ хоста приложений
tr: Uygulama Ana İşlemi
zh_hans: 分析应用主机
zh_hant: 分析應用程式主機

source: Analyze App Host SDK
cs: Analyzovat sadu SDK hostitele aplikací
de: App-Host-SDK analysieren
es: Analizar el SDK de host de aplicaciones
fr: Analyser le SDK hôte d’application
it: Analizza SDK dell'host delle app
ja: アプリ ホスティング プロセス SDK の分析
ko: 앱 호스트 SDK 분석
pl: Analizowanie zestawu SDK hosta aplikacji
pt_br: Analisar o SDK do Host de Aplicativo
ru: Анализ SDK хоста приложений
tr: Uygulama Ana İşlemi SDK’sini Analiz Etme
zh_hans: 分析应用主机 SDK
zh_hant: 分析應用程式主機 SDK

# AnalyzeProjectFormat
source: Analyze project: {0}
cs: Analyzovat projekt: {0}
de: Projekt analysieren: {0}
es: Analizar proyecto: {0}
fr: Analyser le projet : {0}
it: Analizza progetto: {0}
ja: 次のプロジェクトを分析: {0}
ko: 프로젝트 분석: {0}
pl: Analizowanie projektu: {0}
pt_br: Analisar o projeto: {0}
ru: Анализ проекта: {0}
tr: Projeyi analiz et: {0}
zh_hans: 分析项目: {0}
zh_hant: 分析專案: {0}

# AnalyzingProjectStatus
source: Analyzing project...
cs: Analyzuje se projekt…
de: Projekt wird analysiert …
es: Analizando proyecto...
fr: Analyse en cours du projet... Merci de patienter.
it: Analisi del progetto in corso...
ja: プロジェクトを分析しています...
ko: 프로젝트를 분석하는 중...
pl: Trwa analizowanie projektu...
pt_br: Analisando o projeto...
ru: Анализ проекта...
tr: Proje analiz ediliyor...
zh_hans: 正在分析项目...
zh_hant: 正在分析專案...

# ApplyChangesToNuGetConfig
source: Apply these changes to NuGet.config?
cs: Chcete tyto změny použít v souboru NuGet.config?
de: Diese Änderungen in NuGet.config übernehmen?
es: ¿Aplicar estos cambios en NuGet.config?
fr: Voulez-vous appliquer ces modifications à NuGet.config ?
it: Applicare le modifiche a NuGet.config?
ja: これらの変更を NuGet.config に適用しますか?
ko: NuGet.config에 이러한 변경 내용을 적용하시겠습니까?
pl: Czy zastosować te zmiany do pliku NuGet.config?
pt_br: Aplicar essas alterações ao NuGet.config?
ru: Применить эти изменения к NuGet.config?
tr: Bu değişiklikler NuGet.config dosyasına uygulansın mı?
zh_hans: 是否将这些更改应用到 NuGet.config?
zh_hant: 是否將這些變更套用至 NuGet.config?

# CentralPackageManagementNotSupported
source: Central package management is currently not supported by 'aspire update'.
cs: Centrální správa balíčků není v současné době přes aspire update podporována.
de: Die zentrale Paketverwaltung wird von „aspire update“ zurzeit nicht unterstützt.
es: La administración central de paquetes no es compatible actualmente con "aspire update".
fr: Actuellement, la gestion centralisée des packages n’est pas prise en charge par « aspire update ».
it: La gestione centralizzata dei pacchetti non è attualmente supportata da "aspire update".
ja: 現在、中央パッケージ管理では、'aspire update' によるサポートがありません。
ko: 중앙 패키지 관리는 현재 'aspire update'에서 지원되지 않습니다.
pl: Centralne zarządzanie pakietami nie jest obecnie obsługiwane przez „aktualizację Aspire”.
pt_br: No momento, o gerenciamento central de pacotes por “atualização de atualização” não ´possui suporte.
ru: Централизованное управление пакетами в настоящее время не поддерживается функцией "обновление Aspire".
tr: Merkezi paket yönetimi şu anda 'aspire update' tarafından desteklenmiyor.
zh_hans: "aspire update" 当前不支持中央包管理。
zh_hant: 中央套件管理目前不受 'aspire update' 支援。

# ChannelOptionDescription
source: Channel to update to (stable, daily)
es: Canal al que actualizar (estable, diario)
fr: Canal vers lequel effectuer une mise à jour (stable, quotidien)
it: Canale da aggiornare a (stabile, giornaliero)
ko: 업데이트할 채널(안정, 데일리)
pl: Kanał, do którego należy zaktualizować (stabilny, dzienny)
pt_br: Canal para o qual atualizar (estável, diariamente)
ru: Канал для обновления (стабильный, ежедневный)
zh_hans: 要更新到的频道(稳定，每日)
zh_hant: 要更新的通道 (穩定、每日)

# ChannelOptionDescriptionWithStaging
source: Channel to update to (stable, staging, daily)
es: Canal al que se va a actualizar (estable, de ensayo, diario)
fr: Canal vers lequel effectuer une mise à jour (stable, gestion intermédiaire, quotidien)
it: Canale da aggiornare a (stabile, staging, giornaliero)
ko: 업데이트할 채널(안정, 스테이징, 데일리)
pl: Kanał, do którego należy zaktualizować (stabilny, przejściowy, dzienny)
pt_br: Canal para o qual atualizar (estável, preparo, diariamente)
ru: Канал для обновления (стабильный, промежуточный, ежедневный)
zh_hans: 要更新到的频道(稳定、暂存、每日)
zh_hant: 要更新的通道 (穩定、暫存、每日)

# CouldNotFindPackageVersionInDirectoryPackagesProps
source: Could not find PackageVersion element for '{0}' in {1}
cs: Nepovedlo se najít element PackageVersion pro: {0} v: {1}
de: Das PackageVersion-Element für „{0}“ wurde in {1} nicht gefunden.
es: No se pudo encontrar el elemento PackageVersion para '{0}' en {1}
fr: Élément PackageVersion introuvable pour « {0} » dans {1}
it: Non è possibile trovare l'elemento PackageVersion per '{0}' in {1}
ja: {1} 内に '{0}' の PackageVersion 要素が見つかりませんでした
ko: {1}에서 '{0}'에 대한 PackageVersion 요소를 찾을 수 없습니다.
pl: Nie można odnaleźć elementu PackageVersion dla „{0}” w {1}
pt_br: Não foi possível localizar o elemento PackageVersion para "{0}" em {1}
ru: Не удалось найти элемент PackageVersion для "{0}" в {1}
tr: {1} içinde '{0}' için PackageVersion öğesi bulunamadı
zh_hans: 在 {1} 中找不到 ‘{0}’ 的 PackageVersion 元素
zh_hant: 在{1}中找不到 '{0}' 的 PackageVersion 元素

# CouldNotFindRootProjectElementFormat
source: Could not find root <Project> element in {0}
cs: V {0} se nepovedlo najít kořenový element <Project>
de: Das Root-Element <Project> wurde in {0} nicht gefunden.
es: No se encontró el elemento raíz <Project> en {0}
fr: Élément racine <Project> introuvable dans {0}
it: Non è possibile trovare l'elemento radice <Project> in {0}
ja: {0} 内に、ルート <Project> 要素が見つかりませんでした
ko: {0}에서 <Project> 루트 요소를 찾을 수 없습니다.
pl: Nie można odnaleźć elementu głównego <Project> w {0}
pt_br: Não foi possível localizar o elemento <Project> raiz no {0}
ru: Не удалось найти корневой элемент <Project> в {0}
tr: {0} içinde <Project> bileşeni bulunamadı
zh_hans: 在 {0} 中找不到根 <Project>元素
zh_hant: 在 {0} 中找不到根 <Project> 元素

# CouldNotFindSdkElementFormat
source: Could not find <Sdk Name='Aspire.AppHost.Sdk' /> element in {0}
cs: Nepovedlo se najít element <Sdk Name='Aspire.AppHost.Sdk' /> v {0}
de: Das Element <Sdk Name='Aspire.AppHost.Sdk' /> wurde in {0} nicht gefunden.
es: No se encontró el elemento <Sdk Name='Aspire.AppHost.Sdk' /> en {0}
fr: Élément <Sdk Name='Aspire.AppHost.Sdk' /> introuvable dans {0}
it: Non è possibile trovare l'elemento <Sdk Name='Aspire.AppHost.Sdk' /> in {0}
ja: {0} 内に、<Sdk Name='Aspire.AppHost.Sdk' /> 要素が見つかりませんでした
ko: {0}에서 <Sdk Name='Aspire.AppHost.Sdk' /> 요소를 찾을 수 없습니다.
pl: Nie można odnaleźć elementu <Sdk Name='Aspire.AppHost.Sdk' /> w {0}
pt_br: Não foi possível localizar o elemento <Sdk Name='Host.AppHost.Sdk' /> no {0}
ru: Не удалось найти элемент <Sdk Name='Aspire.AppHost.Sdk' /> в {0}
tr: {0} içinde <Sdk Name='Aspire.AppHost.Sdk' /> öğesi bulunamadı
zh_hans: 在 {0} 中找不到 <Sdk Name='Aspire.AppHost.Sdk' />元素
zh_hant: 在 {0} 中找不到 <Sdk Name='Aspire.AppHost.Sdk' /> 元素

# Description
source: Update integrations in the Aspire project. (Preview)
cs: Aktualizujte integrace v projektu Aspire. (Preview)
de: Dient zum Aktualisieren von Integrationen im Aproject. (Vorschau)
es: Actualizar las integraciones en el proyecto Aspire. (Versión preliminar)
fr: Mettre à jour les intégrations dans le projet Aspire. (Préversion)
it: Consente di aggiornare le integrazioni nel progetto di Aspire. (Anteprima)
ja: Aspire プロジェクトの統合を更新します。(プレビュー)
ko: Aspire 프로젝트에서 통합을 업데이트합니다. (미리 보기)
pl: Zaktualizuj integracje w projekcie Aspire. (Wersja zapoznawcza)
pt_br: Atualizar integrações no projeto Aspire. (Versão Prévia)
ru: Обновление интеграций в проекте Aspire. (предварительная версия)
tr: Aspire projesindeki tümleştirme güncelleştirmelerini yapın. (Önizleme)
zh_hans: 更新 Aspire 项目中的集成。(预览版)
zh_hant: 更新 Aspire 專案中的整合。(預覽)

# DotNetToolSelfUpdateMessage
source: To update the Aspire CLI when installed as a .NET tool, run:
it: Per aggiornare l'interfaccia della riga di comando di Aspire quando è installata come strumento .NET, eseguire:
ko: .NET 도구로 설치된 Aspire CLI를 업데이트하려면 다음 명령을 실행합니다.
ru: Чтобы обновить Aspire CLI при установке в качестве инструмента .NET, запустите:
zh_hans: 若要在 Aspire CLI 作为 .NET 工具安装时对其进行更新，请运行:

# ExecutingUpdateStepFormat
source: Executing: {0}
cs: Spouští se: {0}
de: Wird ausgeführt: {0}
es: Ejecutando: {0}
fr: Exécution : {0}
it: Esecuzione in corso: {0}
ja: 次を実行しています: {0}
ko: 실행 중: {0}
pl: Wykonywanie: {0}
pt_br: Executando: {0}
ru: Выполнение: {0}
tr: Yürütülüyor: {0}
zh_hans: 正在执行: {0}
zh_hant: 正在執行: {0}

# FailedDiscoverNuGetConfig
source: Failed to discover NuGet.config files.
cs: Nepodařilo se zjistit soubory NuGet.config.
de: Beim Auffinden der NuGet.config-Dateien ist ein Fehler aufgetreten.
es: Error al detectar los archivos NuGet.config.
fr: Échec de la découverte des fichiers NuGet.config.
it: Non è possibile individuare i file NuGet.config.
ja: NuGet.config ファイルを検出できませんでした。
ko: NuGet.config 파일을 검색하지 못했습니다.
pl: Nie można odnaleźć plików NuGet.config.
pt_br: Falha ao descobrir os arquivos NuGet.config.
ru: Не удалось обнаружить файлы NuGet.config.
tr: NuGet.config dosyalarını bulunamadı.
zh_hans: 未能发现 NuGet.config 文件。
zh_hant: 無法探索 NuGet.config 檔案。

# FailedFetchItemsAndPropertiesFormat
source: Failed to fetch items and properties for project: {0}
cs: Nepovedlo se načíst položky a vlastnosti pro projekt: {0}
de: Beim Abrufen von Elementen und Eigenschaften für das Projekt {0} ist ein Fehler aufgetreten.
es: Error al capturar los elementos y propiedades del proyecto: {0}
fr: Échec de la récupération des éléments et des propriétés du projet : {0}
it: Non è possibile recuperare elementi e proprietà per il progetto: {0}
ja: プロジェクト {0} のアイテムとプロパティのフェッチに失敗しました
ko: 프로젝트의 항목 및 속성을 가져오지 못했습니다. {0}
pl: Nie można pobrać elementów i właściwości projektu: {0}
pt_br: Falha ao buscar itens e propriedades para o projeto: {0}
ru: Не удалось получить элементы и свойства для проекта: {0}
tr: Proje için öğeler ve özellikler getirilemedi: {0}
zh_hans: 无法提取项目的项和属性: {0}
zh_hant: 無法為專案擷取項目與屬性: {0}

# FailedUpdatePackageReferenceFormat
source: Failed to update package reference for {0} in project {1}.
cs: Nepodařilo se aktualizovat odkaz na balíček pro {0} v projektu {1}.
de: Beim Aktualisieren des Paketverweises für {0} im Projekt {1} ist ein Fehler aufgetreten.
es: No se pudo actualizar la referencia del paquete para {0} en el proyecto {1}.
fr: Échec de la mise à jour de la référence de package pour {0} dans le projet {1}.
it: Non è possibile aggiornare il riferimento al pacchetto per {0} nel progetto {1}.
ja: プロジェクト {1} の {0} に対するパッケージ参照の更新に失敗しました。
ko: 프로젝트 {1}에서 {0}에 대한 패키지 참조를 업데이트하지 못 했습니다.
pl: Nie można zaktualizować odwołania do pakietu {0} w projekcie {1}.
pt_br: Falha ao atualizar a referência de pacote para {0} no projeto {1}.
ru: Не удалось обновить ссылку на пакет для {0} в проекте {1}.
tr: {1} projesinde {0} için paket başvurusu güncellenemedi.
zh_hans: 未能更新项目 {1} 中 {0} 的包引用。
zh_hant: 無法更新專案 {1} 中 {0} 的套件參考。

# FallbackParsingWarning
source: Note: Update plan generated using fallback parsing due to unresolvable AppHost SDK. Dependency analysis may have reduced accuracy.
cs: Poznámka: Plán aktualizace byl vygenerován pomocí náhradní analýzy kvůli nevyřešitelné sadě AppHost SDK. Analýza závislostí může mít sníženou přesnost.
de: Hinweis: Aktualisieren Sie den Plan, der mithilfe der Fallbackanalyse generiert wurde, da das AppHost-SDK nicht auflösbar ist. Die Abhängigkeitsanalyse weist möglicherweise eine geringere Genauigkeit auf.
es: Nota: El plan de actualización se generó usando un análisis alternativo debido a un SDK de AppHost no resoluble. El análisis de dependencias puede ser menos preciso.
fr: Remarque : plan de mise à jour généré à l’aide de l’analyse de secours en raison d’un Kit de développement logiciel (SDK) AppHost non résolu. L’analyse des dépendances peut avoir une précision réduite.
it: Nota: il piano di aggiornamento è stato generato usando l'analisi di fallback perché AppHost SDK non è risolvibile. L'analisi delle dipendenze potrebbe risultare meno accurata.
ja: 注: 解決できない AppHost SDK が原因でフォールバック解析を使用して生成されたプランを更新します。依存関係分析の精度が低下する可能性があります。
ko: 참고: 해결할 수 없는 AppHost SDK 때문에 대체 구문 분석을 사용하여 업데이트 계획이 생성되었습니다. 종속성 분석의 정확도가 낮아질 수 있습니다.
pl: Uwaga: plan aktualizacji został wygenerowany przy użyciu analizy zapasowej z powodu nierozpoznanego zestawu AppHost SDK. Analiza zależności może być mniej dokładna.
pt_br: Observação: o plano de atualização gerado usando a análise de fallback devido ao SDK do AppHost não resolvido. A análise de dependência pode ter uma precisão reduzida.
ru: Примечание. План обновления создан с использованием резервного анализа из-за невозможности разрешить SDK AppHost. Точность анализа зависимостей может быть снижена.
zh_hans: 注意: 由于 AppHost SDK 无法解析，已采用回退解析生成更新计划。依赖项分析的准确性可能有所降低。
zh_hant: 注意: 由於無法解析的 AppHost SDK，已使用後援剖析產生更新計劃。相依性分析的正確性可能因此降低。

# MappingAddedFormat
source: Mapping: {0} (added)
cs: Mapování: {0} (přidáno)
de: Zuordnung: {0} (hinzugefügt)
es: Asignación: {0} (agregado)
fr: Mappage : {0} (ajouté)
it: Mapping: {0} (aggiunto)
ja: マッピング: {0} (追加済み)
ko: 매핑: {0}(추가됨)
pl: Mapowanie: {0} (dodano)
pt_br: Mapeamento: {0} (adicionado)
ru: Сопоставление: {0} (добавлено)
tr: Eşleme: {0} (eklendi)
zh_hans: 映射: {0} (已添加)
zh_hant: 對應: {0} (已新增)

# MappingRemovedFormat
source: Mapping: {0} (removed)
cs: Mapování: {0} (odebráno)
de: Zuordnung: {0} (entfernt)
es: Asignación: {0} (quitado)
fr: Mappage : {0} (supprimé)
it: Mapping: {0} (rimosso)
ja: マッピング: {0} (削除済み)
ko: 매핑: {0}(제거됨)
pl: Mapowanie: {0} (usunięto)
pt_br: Mapeamento: {0} (removido)
ru: Сопоставление: {0} (удалено)
tr: Eşleme: {0} (kaldırıldı)
zh_hans: 映射: {0} (已移除)
zh_hant: 對應: {0} (已移除)

# MappingRetainedFormat
source: Mapping: {0}
cs: Mapování: {0}
de: Zuordnung: {0}
es: Asignación: {0}
fr: Mappage : {0}
ja: マッピング: {0}
ko: 매핑: {0}
pl: Mapowanie: {0}
pt_br: Mapeamento: {0}
ru: Сопоставление: {0}
tr: Eşleme: {0}
zh_hans: 映射: {0}
zh_hant: 對應: {0}

# NoAppHostFoundUpdateCliPrompt
source: No Aspire AppHost project found. Would you like to update the Aspire CLI instead?
es: No se encontró ningún proyecto de AppHost. ¿Quiere actualizar la CLI de Aspire en su lugar?
fr: Aucun projet Aspire AppHost trouvé. Voulez-vous plutôt mettre à jour l’interface CLI Aspire ?
it: Nessun progetto Aspire AppHost trovato. Aggiornare invece l'interfaccia della riga di comando Aspire?
ko: Azure AppHost 프로젝트를 찾을 수 없습니다. 대신 Aspire CLI를 업데이트하시겠어요?
pl: Nie znaleziono projektu Aspire AppHost. Czy chcesz zamiast tego zaktualizować narzędzie Aspire CLI?
pt_br: Não foram encontrados projetos AppHost do Aspire. Você quer atualizar a CLI do Aspire em vez disso?
ru: Проект Aspire AppHost не найден. Хотите вместо этого обновить Aspire CLI?
zh_hans: 找不到 Aspire AppHost 项目。是否改为更新 Aspire CLI?
zh_hant: 找不到任何 Aspire AppHost 專案。您是否要改為更新 Aspire CLI？

source: No changes detected in NuGet.config
cs: V souboru NuGet.config se nezjistily žádné změny.
de: In NuGet.config wurden keine Änderungen festgestellt.
es: No se detectaron cambios en NuGet.config
fr: Aucune modification n’a été détectée dans NuGet.config
it: Nessuna modifica rilevata in NuGet.config
ja: NuGet.config に変更は検出されませんでした
ko: NuGet.config에서 변경 내용이 검색되지 않음
pl: Nie wykryto żadnych zmian w pliku NuGet.config
pt_br: Nenhuma alteração detectada no NuGet.config
ru: Изменений в NuGet.config не обнаружено
tr: NuGet.config dosyasında değişiklik algılanmadı
zh_hans: NuGet.config 中未检测到任何更改
zh_hant: 未偵測到 NuGet.config 中的變更

# NoPackageFoundFormat
source: No package found with ID '{0}' in channel '{1}'.
cs: V kanálu {1} nebyl nalezen žádný balíček s ID {0}.
de: Im Kanal „{0}“ wurde kein Paket mit der ID „{1}“ gefunden.
es: No se encontró ningún paquete con id. "{0}" en el canal "{1}".
fr: Aucun package trouvé avec l’ID « {0} » dans le canal « {1} ».
it: Non sono stati trovati pacchetti con ID "{0}" nel canale "{1}".
ja: チャネル '{1}' 内に、ID '{0}' を含むパッケージが見つかりませんでした。
ko: 채널 '{1}'에서 ID '{0}'의 패키지를 찾을 수 없습니다.
pl: Nie znaleziono pakietu o identyfikatorze „{0}” w kanale „{1}”.
pt_br: Nenhum pacote encontrado com a ID “{0}” no canal “{1}”.
ru: Не найден пакет с идентификатором "{0}" в канале "{1}".
tr: '{1}' kanalında '{0}' kimliğine sahip paket bulunamadı.
zh_hans: 在频道 "{0}" 中找不到 ID 为 "{1}" 的包。
zh_hant: 在通道 '{1}' 中找不到識別碼為 '{0}' 的套件。

# PackageReferenceNoIdentity
source: Package reference does not have Identity.
cs: Odkaz na balíček nemá identitu.
de: Der Paketverweis hat keine Identität.
es: La referencia del paquete no tiene identidad.
fr: La référence de package n’a pas d’identité.
it: Il riferimento al pacchetto non ha l'identità.
ja: パッケージ参照に ID がありません。
ko: 패키지 참조에 ID가 없습니다.
pl: Odwołanie do pakietu nie ma tożsamości.
pt_br: A referência do pacote não tem Identidade.
ru: Ссылка на пакет не содержит удостоверение.
tr: Paket başvurusunda Kimlik yok.
zh_hans: 包引用没有标识。
zh_hant: 套件參考沒有 Identity。

# PackageReferenceNoVersion
source: Package reference does not have Version.
cs: Odkaz na balíček nemá verzi.
de: Der Paketverweis hat keine Version.
es: La referencia del paquete no tiene versión.
fr: La référence de package n’a pas de version.
it: Il riferimento al pacchetto non ha la versione.
ja: パッケージ参照にバージョンがありません。
ko: 패키지 참조에 버전이 없습니다.
pl: Odwołanie do pakietu nie ma wersji.
pt_br: A referência de pacote não tem a Versão.
ru: Ссылка на пакет не содержит версию.
tr: Paket başvurusunda Sürüm yok.
zh_hans: 包引用没有版本。
zh_hant: 套件參考沒有 Version。

# PerformUpdatesPrompt
source: Perform updates?
cs: Provést aktualizace?
de: Update ausführen?
es: ¿Desea realizar actualizaciones?
fr: Voulez-vous exécuter la mise à jour maintenant ?
it: Eseguire gli aggiornamenti?
ja: 更新を実行しますか?
ko: 업데이트를 수행하시겠습니까?
pl: Wykonać aktualizacje?
pt_br: Executar atualizações?
ru: Выполнить обновления?
tr: Güncelleştirmeler uygulansın mı?
zh_hans: 是否执行更新?
zh_hant: 執行更新?

# ProjectArgumentDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
de: Der Pfad zur Aspire AppHost-Projektdatei.
es: La ruta de acceso al archivo del proyecto host de la AppHost Aspire.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
ja: Aspire アプリ ホスティング プロセス プロジェクト ファイルへのパス。
ko: Aspire AppHost 프로젝트 파일의 경로입니다.
pl: Ścieżka do pliku projektu hosta AppHost platformy Aspire.
pt_br: O caminho para o arquivo de projeto do Aspire AppHost.
ru: Путь к файлу проекта Aspire AppHost.
tr: Aspire AppHost proje dosyasının yolu.
zh_hans: Aspire AppHost 项目文件的路径。
zh_hant: Aspire AppHost 專案檔案的路徑。

# ProjectReferenceNoFullPath
source: Project reference does not have FullPath.
cs: Odkaz na projekt nemá FullPath.
de: Der Projektverweis hat keinen FullPath.
es: La referencia del proyecto no tiene FullPath.
fr: Désolé, la référence de projet n’a pas de chemin complet.
it: Il riferimento al progetto non contiene FullPath.
ja: プロジェクト参照に FullPath がありません。
ko: 프로젝트 참조에 FullPath가 없습니다.
pl: Odwołanie do projektu nie ma pełnej ścieżki.
pt_br: A referência do Project não tem FullPath.
ru: Ссылка на проект не содержит полный путь.
tr: Proje başvurusunda FullPath yok.
zh_hans: 项目引用没有 FullPath。
zh_hant: 專案參考沒有 FullPath。

# ProjectUpToDateMessage
source: Project is up to date! (no updates necessary)
cs: Projekt je aktuální! (nejsou potřeba žádné aktualizace)
de: Das Projekt ist auf dem neuesten Stand. (keine Updates erforderlich)
es: ¡El proyecto está al día! (no es necesario actualizar)
fr: Le projet est à jour ! (aucune mise à jour nécessaire)
it: Il progetto è aggiornato. (non sono necessari aggiornamenti)
ja: プロジェクトは最新の状態です!(更新は必要ありません)
ko: 프로젝트가 최신 상태입니다! (업데이트 필요 없음)
pl: Projekt jest aktualny. (nie są wymagane żadne aktualizacje)
pt_br: O Project foi atualizado! (nenhuma atualização necessária)
ru: Проект обновлен! (обновления не требуются)
tr: Proje güncel! (güncelleştirme gerekmiyor)
zh_hans: 项目已是最新!(无需更新)
zh_hant: 專案為最新!(不需要更新)

# QualityOptionDescription
source: Quality level to update to (stable, daily)
es: Nivel de calidad a actualizar a (estable, diario)
fr: Niveau de qualité vers lequel effectuer une mise à jour (stable, quotidien)
it: Livello di qualità da aggiornare a (stabile, giornaliero)
ko: 업데이트할 품질 수준(안정, 데일리)
pl: Poziom jakości, do którego należy zaktualizować (stabilny, dzienny)
pt_br: Nível de qualidade para o qual atualizar (estável, diariamente)
ru: Уровень качества для обновления (стабильный, ежедневно)
zh_hans: 要更新到的质量级别(稳定、每日)
zh_hant: 要更新的品質等級 (穩定、每日)

# QualityOptionDescriptionWithStaging
source: Quality level to update to (stable, staging, daily)
es: Nivel de calidad al que se va a actualizar (estable, de ensayo, diario)
fr: Niveau de qualité vers lequel effectuer une mise à jour (stable, gestion intermédiaire, quotidien)
it: Livello di qualità da aggiornare a (stabile, staging, giornaliero)
ko: 업데이트할 품질 수준(안정, 스테이징, 데일리)
pl: Poziom jakości, do którego należy zaktualizować (stabilny, przejściowy, dzienny)
pt_br: Nível de qualidade para o qual atualizar (estável, preparo, diariamente)
ru: Уровень качества для обновления (стабильный, промежуточный, ежедневный)
zh_hans: 要更新到的质量级别(稳定、暂存、每日)
zh_hant: 要更新的品質等級 (穩定、暫存、每日)

# RemovedFeedFormat
source: Removed: {0}
cs: Odebráno: {0}
de: Entfernt: {0}
es: Quitado: {0}
fr: Supprimé : {0}
it: Rimosso: {0}
ja: 削除済み: {0}
ko: 제거됨: {0}
pl: Usunięto: {0}
pt_br: Removido: {0}
ru: Удалено: {0}
tr: Kaldırıldı: {0}
zh_hans: 已移除: {0}
zh_hant: 已移除: {0}

# RetainedFeedFormat
source: Retained: {0}
cs: Zachováno: {0}
de: Beibehalten: {0}
es: Retenido: {0}
fr: Retenu : {0}
it: Mantenuto: {0}
ja: 保持済み: {0}
ko: 보존됨: {0}
pl: Utrzymano: {0}
pt_br: Retidos: {0}
ru: Сохранено: {0}
tr: Korundu: {0}
zh_hans: 已保留: {0}
zh_hant: 已保留: {0}

# SelectChannelPrompt
source: Select a channel:
cs: Vyberte kanál:
de: Wählen Sie einen Kanal aus.
es: Seleccionar un canal:
fr: Sélectionnez un canal :
it: Selezionare un canale:
ja: チャネルを選択:
ko: 채널 선택:
pl: Wybierz kanał:
pt_br: Selecionar um canal:
ru: Выберите канал:
tr: Kanal seçin:
zh_hans: 选择频道:
zh_hant: 選取通道:

# UnxpectedCodePath
source: Unexpected code path.
cs: Neočekávaná cesta kódu.
de: Unerwarteter Codepfad
es: Ruta de acceso al código inesperada.
fr: Chemin de code inattendu.
it: Percorso del codice imprevisto.
ja: 予期しないコード パスです。
ko: 예기치 않은 코드 경로입니다.
pl: Nieoczekiwana ścieżka w kodzie.
pt_br: Caminho de código inesperado.
ru: Непредвиденный путь к коду.
tr: Beklenmeyen kod yolu.
zh_hans: 意外的代码路径。
zh_hant: 未預期的程式碼路徑。

# UpdateCliAfterProjectUpdatePrompt
source: An update is available for the Aspire CLI. Would you like to update it now?
es: Hay una actualización disponible para la CLI de Aspire. ¿Quieres actualizarla ahora?
fr: Une mise à jour est disponible pour l’interface CLI Aspire. Voulez-vous la mettre à jour maintenant ?
it: È disponibile un aggiornamento per l'interfaccia della riga di comando Aspire. Aggiornarla ora?
ko: Aspire CLI 업데이트가 있습니다. 지금 업데이트하시겠어요?
pl: Dostępna jest aktualizacja narzędzia Aspire CLI. Czy chcesz teraz zaktualizować?
pt_br: Há uma atualização disponível para a CLI do Aspire. Você quer atualizá-la agora?
ru: Доступно обновление для Aspire CLI. Хотите обновить его сейчас?
zh_hans: Aspire CLI 有可用更新。是否现在更新?
zh_hant: 更新可用於 Aspire CLI。您現在要更新嗎？
