Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/UpdateCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UpdatePackageFormat
source: Update package {0} from {1} to {2}
cs: Aktualizovat balíček {0} z {1} na {2}
de: Paket {0} von {1} auf {2} aktualisieren
es: Actualizar paquete {0} de {1} a {2}
fr: Mettre à jour le package {0} de {1} à {2}
it: Aggiorna il pacchetto {0} da {1} a {2}
ja: パッケージ {0} を {1} から {2} に更新する
ko: 패키지 {0}을(를) {1}에서 {2}(으)로 업데이트
pl: Aktualizacja {0} z {1} do {2}
pt_br: Atualizar o pacote {0} de {1} para {2}
ru: Обновить пакет {0} с{1} до {2}
tr: {1} olan {0} paketini {2} olarak güncelleyin
zh_hans: 将包 {0} 从 {1} 更新为 {2}
zh_hant: 將套件 {0} 從 {1} 更新到 {2}

# UpdateSuccessfulMessage
source: Update successful!
cs: Aktualizace proběhla úspěšně!
de: Update erfolgreich.
es: ¡Actualización correcta!
fr: Mise à jour correcte !
it: Aggiornamento riuscito.
ja: 正常に更新されました!
ko: 업데이트 성공!
pl: Aktualizacja zakończyła się powodzeniem.
pt_br: Atualização bem-sucedida
ru: Обновлено!
tr: Güncelleme başarılı!
zh_hans: 更新成功!
zh_hant: 更新成功!

# WhichDirectoryNuGetConfigPrompt
source: Which directory for NuGet.config file?
cs: Který adresář pro soubor NuGet.config?
de: Welches Verzeichnis für die NuGet.config-Datei?
es: ¿Qué directorio del archivo NuGet.config?
fr: Quel répertoire pour le fichier NuGet.config ?
it: Quale directory per il file NuGet.config?
ja: NuGet.config ファイル用の、どのディレクトリですか?
ko: NuGet.config 파일의 디렉터리는 무엇인가요?
pl: Który katalog dla pliku NuGet.config?
pt_br: Qual diretório para o arquivo NuGet.config?
ru: Какой каталог для файла NuGet.config?
tr: NuGet.config dosyası için hangi dizin kullanılsın?
zh_hans: NuGet.config 文件位于哪个目录?
zh_hant: 哪個目錄用於 NuGet.config 檔案?
