Repository: dotnet/aspire
Catalog: src/Aspire.Cli/Resources/xlf/WaitCommandStrings.*.xlf
Languages: cs, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Description
source: Wait for a resource to reach a target status.
cs: Počkejte, až prostředek dosáhne cílového stavu.
es: Espere a que un recurso alcance un estado de destino.
fr: Attendez qu’une ressource atteigne un état cible.
it: Attendere che una risorsa raggiunga uno stato di destinazione.
ja: リソースがターゲットの状態になるまで待ちます。
ko: 리소스가 목표 상태에 도달할 때까지 기다립니다.
pl: Poczekaj, aż zasób osiągnie docelowy stan.
pt_br: Aguarde até que um recurso alcance um status de destino.
ru: Ожидание, пока ресурс не достигнет целевого состояния.
tr: Bir kaynağın hedef duruma ulaşmasını bekleyin.
zh_hans: 等待资源达到目标状态。
zh_hant: 等待資源達到目標狀態。

# InvalidStatusValue
source: Invalid status value '{0}'. Valid values are: healthy, up, down.
cs: Neplatná hodnota stavu „{0}“. Platné hodnoty jsou: healthy, up, down.
es: Valor de estado no válido: "{0}". Los valores válidos son: correcto, arriba, abajo.
fr: Valeur de statut non valide « {0} ». Les valeurs valides sont : en bonne santé, en haut, en bas.
it: Valore di stato non valido '{0}'. I valori validi sono: integro, su, giù.
ja: 状態値 '{0}' が無効です。有効な値は、healthy、up、down です。
ko: 잘못된 상태 값 '{0}'입니다. 유효한 값은 정상, 위, 아래입니다.
pl: Nieprawidłowa wartość stanu „{0}”. Dozwolone wartości to: healthy, up, down.
pt_br: Valor de status inválido "{0}". Os valores válidos são: íntegro, para cima, para baixo.
ru: Недопустимое значение состояния "{0}". Допустимые значения: healthy, up, down.
tr: Geçersiz durum değeri '{0}'. Geçerli değerler: healthy, up, down.
zh_hans: 无效状态值“{0}”。有效值为: healthy、up、down。
zh_hant: 無效的狀態值 '{0}'。有效的值為: 良好、開啟、關閉。

# NoInScopeAppHostsShowingAll
source: No running AppHosts found in the current directory. Showing all running AppHosts:
cs: V aktuálním adresáři se nenašli žádní spuštění hostitelé aplikací. Zobrazují se všichni spuštění hostitelé aplikací:
fr: Désolé, aucun AppHost en cours d’exécution n’a été trouvé dans le répertoire actif. Affichage de tous les AppHosts en cours d’exécution :
it: Non sono stati trovati AppHost in esecuzione nella directory corrente. Visualizzazione di tutti gli AppHost in esecuzione:
tr: Geçerli dizinde çalışan AppHost bulunamadı. Tüm çalışan AppHost'lar gösteriliyor:

source: No running AppHosts found.
cs: Nebyl nalezen žádný spuštěný hostitel aplikací.
fr: Désolé, aucun AppHost en cours d’exécution n’a été trouvé.
it: Non sono stati trovati AppHost in esecuzione.
tr: Çalışan AppHost bulunamadı.

# ProjectOptionDescription
source: The path to the Aspire AppHost project file.
cs: Cesta k souboru projektu Aspire AppHost.
fr: Chemin d’accès au fichier projet AppHost Aspire.
it: Percorso del file di un progetto AppHost di Aspire.
tr: Aspire AppHost proje dosyasının yolu.

# ResourceArgumentDescription
source: The name of the resource to wait for.
cs: Název prostředku, na který se má čekat.
es: Nombre del recurso que se va a esperar.
fr: Le nom de la ressource auquel s’attendre.
it: Nome della risorsa da attendere.
ja: 待機するリソースの名前。
ko: 대기할 리소스의 이름입니다.
pl: Nazwa zasobu, na który trzeba czekać.
pt_br: O nome do recurso a ser aguardado.
ru: Имя ресурса для ожидания.
tr: Beklenecek kaynağın adı.
zh_hans: 要等待的资源的名称。
zh_hant: 要等候的資源名稱。

# ResourceEnteredFailedState
source: Resource '{0}' entered a failed state: {1}.
cs: Prostředek {0} vstoupil do stavu selhání: {1}.
es: El recurso "{0}" entró en un estado de error: {1}.
fr: La ressource « {0} » est passée en état d’échec : {1}.
it: La risorsa '{0}' è entrata in stato di errore: {1}.
ja: リソース '{0}' がエラー状態になりました: {1}。
ko: 리소스 '{0}'이(가) 실패 상태로 전환되었습니다. {1}.
pl: Zasób „{0}” przeszedł w stan błędu: {1}.
pt_br: O recurso "{0}" entrou em um estado de falha: {1}.
ru: Ресурс "{0}" перешёл в состояние сбоя: {1}.
tr: '{0}' kaynağı başarısız bir duruma girdi: {1}.
zh_hans: 资源“{0}”进入失败状态: {1}。
zh_hant: 資源 '{0}' 已進入失敗狀態: {1}。

# ResourceNotFound
source: Resource '{0}' was not found.
cs: Prostředek „{0}“ se nenašel.
es: No se encontró el recurso "{0}".
fr: Ressource i» {0} »ntrouvable.
it: Non è possibile trovare la risorsa '{0}'.
ja: リソース '{0}' が見つかりませんでした。
ko: 리소스 '{0}'을(를) 찾을 수 없습니다.
pl: Nie znaleziono zasobu „{0}”.
pt_br: O recurso "{0}" não foi encontrado.
ru: Ресурс "{0}" не найден.
tr: '{0}' kaynağı bulunamadı.
zh_hans: 未找到资源“{0}”。
zh_hant: 找不到資源 '{0}'。

# ResourceReachedTargetStatus
source: Resource '{0}' is {1}. ({2:F1}s)
cs: Prostředek {0} je {1}. ({2:F1} s)
es: El recurso "{0}" está {1}. ({2:F1}s)
fr: La ressource « {0} » est {1}. ({2:F1}s)
it: La risorsa '{0}' è {1}. ({2:F1}s)
ja: リソース '{0}' は {1} です。({2:F1}s)
ko: 리소스 '{0}'이(가) {1}입니다. ({2:F1}s)
pl: Zasób „{0}” jest {1}. ({2:F1}s)
pt_br: O recurso "{0}" é {1}. ({2:F1}s)
ru: Ресурс "{0}" находится в состоянии {1}. ({2:F1} с)
tr: Kaynak '{0}' {1}‘dir. ({2:F1} sn)
zh_hans: 资源“{0}”已{1}。({2:F1}秒)
zh_hant: 資源 '{0}' 為 {1}。({2:F1}秒)

source: Scanning for running AppHosts...
cs: Vyhledávání spuštěných hostitelů aplikací...
fr: Recherche des AppHosts en cours d’exécution...
it: Analisi per l'esecuzione di AppHosts in corso...
tr: Çalışan AppHost'lar taranıyor...

# SelectAppHost
source: Select an AppHost:
cs: Vyberte hostitele aplikací:
fr: Sélectionner un AppHost :
it: Selezionare un AppHost:
tr: AppHost seçin:

# StatusOptionDescription
source: The target status to wait for (healthy, up, down). Defaults to healthy.
cs: Cílový stav, na který se má čekat (healthy, up, down). Ve výchozím nastavení je healthy.
es: Estado de destino que se va a esperar (correcto, arriba, abajo). El valor predeterminado es correcto.
fr: Le statut cible à attendre (en bonne santé, en haut, en bas.). Par défaut, en bonne santé.
it: Stato di destinazione da attendere (integro, su, giù). L'impostazione predefinita è integro.
ja: 待機するターゲットの状態 (healthy、up、down)。既定値は healthy です。
ko: 대기할 대상 상태(정상, 위, 아래)입니다. 기본값은 정상입니다.
pl: Stan docelowy, na który należy czekać (healthy, up, down). Domyślnie jest w dobrej kondycji.
pt_br: O status de destino a ser aguardado (íntegro, para cima, para baixo). O padrão é íntegro.
ru: Целевое состояние для ожидания (healthy, up, down). По умолчанию — healthy.
tr: Beklenecek hedef durum (healthy, up, down). Varsayılan değer healthy'dir.
zh_hans: 要等待的目标状态(healthy、up、down)。默认值为 healthy。
zh_hant: 要等候的目標狀態 (良好、開啟、關閉)。預設為良好。

# TimeoutMustBePositive
source: Timeout must be a positive number of seconds.
cs: Časový limit musí být kladný počet sekund.
es: El tiempo de espera debe ser un número positivo de segundos.
fr: Le délai d’attente doit être un nombre positif de secondes.
it: Il timeout deve essere un numero positivo di secondi.
ja: タイムアウトは正の秒数である必要があります。
ko: 시간 제한은 양수(초)여야 합니다.
pl: Limit czasu musi być dodatnią liczbą sekund.
pt_br: O tempo limite deve ser um número positivo de segundos.
ru: Время ожидания должно быть положительным количеством секунд.
tr: Zaman aşımı pozitif bir saniye sayısı olmalıdır.
zh_hans: 超时时间必须是正数(以秒为单位)。
zh_hant: 逾時必須是正數的秒數。

# TimeoutOptionDescription
source: Maximum time to wait in seconds. Defaults to 120.
cs: Maximální doba čekání v sekundách. Výchozí hodnota je 120.
es: Tiempo máximo de espera en segundos. Tiene como valor predeterminado el 120.
fr: Durée maximale d’attente en secondes. La valeur par défaut est 120.
it: Tempo massimo di attesa in secondi. Il valore predefinito è 120.
ja: 最大待機時間 (秒)。既定値は 120 です。
ko: 대기할 최대 시간(초)입니다. 기본값은 120입니다.
pl: Maksymalny czas oczekiwania w sekundach. Przyjmuje domyślnie wartość 120.
pt_br: Tempo máximo de espera em segundos. O padrão é 120.
ru: Максимальное время ожидания в секундах. Значение по умолчанию: 120.
tr: Bekleme süresinin maksimum süresi saniye cinsindendir. Varsayılan değer 120'tür.
zh_hans: 最长等待时间(秒)。默认为 120。
zh_hant: 等候的時間上限 (秒)。預設為 120。

# WaitTimedOut
source: Timed out waiting for resource '{0}' to be {1} after {2}s.
cs: Při čekání, až prostředek {0} bude {1}, po {2} s vypršel časový limit.
es: Se agotó el tiempo de espera para que el recurso '{0}' se {1} después de {2} s.
fr: Délai d’attente dépassé pour la ressource « {0} » à être {1} après {2}s.
it: Timeout durante l'attesa che la risorsa '{0}' raggiunga lo stato {1} dopo {2} sec.
ja: リソース '{0}' が {2} 秒後に {1} になるのを待機中にタイムアウトになりました。
ko: {2}초 후 리소스 ‘{0}’이(가) {1}이(가) 되기까지 기다리는 동안 시간이 초과되었습니다.
pl: Przekroczono limit czasu podczas oczekiwania na zasób „{0}” do stanu {1} po {2} s.
pt_br: Tempo limite atingido ao aguardar o recurso "{0}" ser {1} após {2}s.
ru: Истекло время ожидания ресурса "{0}" для {1} после {2} с.
tr: '{0}' kaynağının {2} saniye sonra {1} olması beklenirken zaman aşımı oluştu.
zh_hans: 等待 {2} 秒后，资源“{0}”未能{1}，操作超时。
zh_hant: 等候資源 '{0}' 於 {2} 後成為 {1} 已逾時。

# WaitingForResource
source: Waiting for resource '{0}' to be {1}...
cs: Čeká se, až prostředek {0} bude {1}...
es: Esperando a que el recurso "{0}" sea {1}...
fr: En attente que la ressource « {0} » soit {1}...
it: In attesa che risorsa '{0}' raggiunga lo stato {1}...
ja: リソース '{0}' が {1} になるのを待機しています...
ko: 리소스 '{0}'이(가) {1}이(가) 되기까지 기다리는 중...
pl: Trwa oczekiwanie na zasób „{0}” do stanu {1}...
pt_br: Aguardando o recurso "{0}" ser {1}...
ru: Ожидание для ресурса "{0}" состояния {1}...
tr: '{0}' kaynağının {1} olması bekleniyor...
zh_hans: 正在等待资源“{0}”{1}...
zh_hant: 正在等候資源 '{0}' 成為 {1}...

# SelectAppHostAction
source: connect to
es: conectarse a
ja: 接続先
ko: 연결 대상
pl: połącz z
zh_hant: 連線至
