Repository: dotnet/aspire
Catalog: src/Aspire.Hosting.DevTunnels/Resources/xlf/MessageStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AuthenticationExpiredNotification
source: Dev tunnels authentication has expired. Restart the dev tunnel resources to re-authenticate.
cs: Platnost ověření vývojových tunelů vypršela. Restartujte prostředky vývojového tunelu, aby se znovu ověřily.
de: Die Authentifizierung für Devtunnel ist abgelaufen. Starten Sie die Devtunnel-Ressourcen neu, um sich erneut zu authentifizieren.
es: La autenticación de los túneles de desarrollo ha expirado. Reinicie los recursos del túnel de desarrollo para volver a autenticarse.
fr: L’authentification des tunnels de développement a expiré. Redémarrez les ressources du tunnel de développement pour vous authentifier à nouveau.
it: L'autenticazione dei tunnel dev è scaduta. Riavviare le risorse del tunnel dev per autenticarsi nuovamente.
ja: 開発トンネル認証の有効期限が切れました。開発トンネル リソースを再起動して再認証してください。
ko: 개발 터널 인증이 만료되었습니다. 개발 터널 리소스를 다시 시작하여 다시 인증합니다.
pl: Uwierzytelnianie tuneli deweloperskich wygasło. Uruchom ponownie zasoby tunelu deweloperskiego, aby przeprowadzić ponowne uwierzytelnienie.
pt_br: A autenticação do túnel do desenvolvedor expirou. Reinicie os recursos do túnel do desenvolvedor para autenticar novamente.
ru: Срок действия проверки подлинности туннелей разработки истек. Перезапустите ресурсы туннелей разработки для повторной проверки подлинности.
tr: Geliştirme tünellerinin kimlik doğrulama süresi doldu. Yeniden kimlik doğrulaması yapmak için geliştirme tüneli kaynaklarını yeniden başlatın.
zh_hans: 开发隧道身份验证已过期。请重启开发隧道资源以重新进行身份验证。
zh_hant: 開發通道驗證已過期。請重新啟動開發通道資源以重新驗證。

# AuthenticationRequiredNotification
source: Dev tunnels requires authentication to continue:
cs: Vývojové tunely vyžadují ověření, aby bylo možné pokračovat:
de: Dev Tunnels erfordern eine Authentifizierung, um fortzufahren:
es: Los túneles de desarrollo requieren autenticación para continuar:
fr: Les tunnels de développement nécessitent une authentification pour continuer :
it: Per continuare, è necessario autenticare i tunnel dev:
ja: 開発トンネルを続行するには、認証が必要です。
ko: 개발자 터널을 계속 사용하려면 인증이 필요합니다.
pl: Tunele deweloperskie wymagają uwierzytelniania, aby kontynuować:
pt_br: O túnel do desenvolvedor exige autenticação para continuar:
ru: Туннелям разработки требуется проверка подлинности для продолжения:
tr: Geliştirme tünelleri devam etmek için kimlik doğrulama gerektirir:
zh_hans: 开发隧道需要身份验证才能继续:
zh_hant: 開發通道需要驗證才能繼續:

# DevTunnelHealthy
source: Dev tunnel '{0}' is active with {1} host connections and {2} ports.
cs: Vývojový tunel {0} je aktivní s {1} připojeními hostitele a {2} porty.
de: Der Devtunnel „{0}“ ist mit {1} Hostverbindungen und {2} Ports aktiv.
es: El túnel de desarrollo '{0}' está activo con {1} conexiones de host y {2} puertos.
fr: Le tunnel de développement « {0} » est actif avec {1} connexions hôtes et {2} ports.
it: Il tunnel dev '{0}' è attivo con {1} connessioni host e {2} porte.
ja: 開発トンネル '{0}' は、{1} 個のホスト接続と {2} 個のポートでアクティブです。
ko: 개발 터널 '{0}'이(가) {1} 호스트 연결 및 {2} 포트에서 활성화되어 있습니다.
pl: Tunel dewelopera „{0}” jest aktywny z {1} połączeniami hosta i {2} portami.
pt_br: O túnel do desenvolvedor "{0}" está ativo com {1} conexões de host e {2} portas.
ru: Туннель разработки "{0}" активен с подключениями к узлу ({1}) и портами ({2}).
tr: Geliştirme tüneli '{0}', {1} ana bilgisayar bağlantısı ve {2} bağlantı noktası ile etkindir.
zh_hans: 开发隧道 "{0}" 处于活动状态，拥有 {1} 个主机连接和 {2} 个端口。
zh_hant: 開發通道 '{0}' 處於作用中，擁有 {1} 個主機連線和 {2} 個連接埠。

# DevTunnelPortHealthy
source: Dev tunnel port '{0}' on dev tunnel '{1}' is active.
cs: Port vývojového tunelu {0} ve vývojovém tunelu {1} je aktivní.
de: Der Devtunnel-Port „{0}“ im Devtunnel „{1}“ ist aktiv.
es: El puerto '{0}' del túnel de desarrollo '{1}' está activo.
fr: Le port du tunnel de développement « {0} » sur le tunnel de développement « {1} » est actif.
it: La porta del tunnel dev '{0}' nel tunnel dev '{1}' è attiva.
ja: 開発トンネル '{1}' の開発トンネル ポート '{0}' がアクティブです。
ko: 개발 터널 '{1}'의 개발 터널 포트 '{0}'이(가) 활성화되어 있습니다.
pl: Port tunelu deweloperskiego „{0}” w tunelu deweloperskim „{1}” jest aktywny.
pt_br: A porta de túnel do desenvolvedor "{0}" no túnel do desenvolvedor "{1}" está ativa.
ru: Порт туннеля разработки "{0}" в туннеле разработки "{1}" активен.
tr: Geliştirme tüneli ‘{1}’ üzerindeki geliştirme tüneli ‘{0}’ etkindir.
zh_hans: 开发隧道 "{1}" 上的开发隧道端口 "{0}" 处于活动状态。
zh_hant: 開發通道 '{1}' 上的開發通道埠 '{0}' 處於作用中。

# DevTunnelPortUnhealthy_Error
source: Failed to check port '{0}' on dev tunnel '{1}': {2}
cs: Nepovedlo se zkontrolovat port {0} ve vývojovém tunelu {1}: {2}
de: Fehler beim Überprüfen des Ports „{0}“ im Dev Tunnel „{1}“: {2}
es: No se pudo comprobar el puerto '{0}' en el túnel de desarrollo '{1}': {2}
fr: Nous n’avons pas pu vérifier le port « {0} » sur le tunnel de développement « {1} » : {2}
it: Non è possibile verificare la porta '{0}' nel tunnel dev '{1}': {2}
ja: 開発トンネル '{1}' のポート '{0}' を確認できませんでした: {2}
ko: 개발 터널 '{1}'에서 포트 '{0}'을(를) 확인하지 못했습니다. {2}
pl: Nie można sprawdzić portu „{0}” w tunelu deweloperskim „{1}”: {2}
pt_br: Falha ao verificar a porta "{0}" no túnel do desenvolvedor "{1}": {2}
ru: Не удалось проверить порт "{0}" в туннеле разработки "{1}": {2}
tr: Geliştirme tüneli '{1}' üzerindeki '{0}' bağlantı noktasını kontrol edemedi: {2}
zh_hans: 未能在开发隧道 "{1}" 上检查端口 "{0}": {2}
zh_hant: 無法檢查開發通道 '{1}' 上的連接埠 '{0}': {2}

# DevTunnelPortUnhealthy_StatusUnknown
source: Dev tunnel port '{0}' on dev tunnel '{1}' status is not known.
cs: Stav portu vývojového tunelu {0} ve vývojovém tunelu {1} není známý.
de: Der Status des Devtunnel-Ports „{0}“ im Devtunnel „{1}“ ist unbekannt.
es: No se conoce el puerto de túnel de desarrollo '{0}' en el estado de túnel de desarrollo '{1}'.
fr: Le statut du port du tunnel de développement « {0} » sur le tunnel de développement « {1} » est inconnu.
it: Lo stato della porta del tunnel dev '{0}' nel tunnel dev '{1}' non è noto.
ja: 開発トンネル '{1}' の開発トンネル ポート '{0}' の状態が不明です。
ko: 개발 터널 '{1}'의 개발 터널 포트 '{0}' 상태를 알 수 없습니다.
pl: Stan portu tunelu deweloperskiego „{0}” w tunelu deweloperskim „{1}” jest nieznany.
pt_br: O status da porta de túnel do desenvolvedor "{0}" no túnel do desenvolvedor "{1}" não é conhecido.
ru: Состояние порта туннеля разработки "{0}" в туннеле разработки "{1}" неизвестно.
tr: '{0}' geliştirme tünelindeki '{1}' dev tünelinin durumu bilinmiyor.
zh_hans: 开发隧道 "{1}" 上的开发隧道端口 "{0}" 状态未知。
zh_hant: 開發通道 '{1}' 上的開發通道埠 '{0}' 狀態未知。

# DevTunnelUnhealthy_Error
source: Failed to check dev tunnel '{0}': {1}
cs: Nepovedlo se zkontrolovat vývojový tunel {0}: {1}
de: Fehler beim Überprüfen des Dev Tunnels „{0}“: {1}
es: No se pudo comprobar el túnel de desarrollo '{0}': {1}
fr: Nous n’avons pas pu vérifier le tunnel de développement « {0} » : {1}
it: Non è possibile controllare il tunnel dev '{0}': {1}
ja: 開発トンネル '{0}' を確認できませんでした: {1}
ko: 개발 터널 '{0}'을(를) 확인하지 못했습니다. {1}
pl: Nie można sprawdzić tunelu deweloperskiego „{0}”: {1}
pt_br: Falha ao verificar o túnel do desenvolvedor "{0}": {1}
ru: Не удалось проверить туннель разработки "{0}": {1}
tr: Geliştirme tüneli '{0}' kontrol edilemedi: {1}
zh_hans: 未能检查开发隧道 "{0}": {1}
zh_hant: 無法檢查開發通道 '{0}': {1}

# DevTunnelUnhealthy_NoActiveHostConnections
source: Dev tunnel '{0}' has no active host connections.
cs: Vývojový tunel {0} nemá žádná aktivní připojení hostitele.
de: Dev Tunnel „{0}“ hat keine aktiven Hostverbindungen.
es: El túnel de desarrollo '{0}' no tiene conexiones activas de host.
fr: Le tunnel de développement « {0} » n’a aucune connexion d’hôte active.
it: Il tunnel dev '{0}' non dispone di connessioni host attive.
ja: 開発トンネル '{0}' にアクティブなホスト接続がありません。
ko: 개발 터널 '{0}'에 활성 호스트 연결이 없습니다.
pl: Tunel dewelopera „{0}” nie ma aktywnych połączeń hosta.
pt_br: O túnel do desenvolvedor "{0}" não tem conexões de host ativas.
ru: У туннеля разработки "{0}" нет активных подключений к узлу.
tr: Geliştirme tüneli '{0}' etkin ana bilgisayar bağlantısı yok.
zh_hans: 开发隧道 "{0}" 没有活动的主机连接。
zh_hant: 開發通道 '{0}' 沒有任何有效的主機連線。

# DevTunnelUnhealthy_PortInactive
source: Dev tunnel '{0}' port '{1}' is not active.
cs: Port {1} vývojového tunelu {0} není aktivní.
de: Dev Tunnel „{0}“ Port „{1}“ ist nicht aktiv.
es: El túnel de desarrollo '{0}' del puerto '{1}' no está activo.
fr: Le tunnel de développement « {0} » du port du tunnel de développement « {1} » n’est pas actif.
it: La porta '{0}' del tunnel dev '{1}' non è attiva.
ja: 開発トンネル '{0}' のポート '{1}' はアクティブではありません。
ko: 개발 터널 '{0}'의 포트 '{1}'이(가) 활성화되지 않았습니다.
pl: Port „{1}” tunelu deweloperskiego „{0}” nie jest aktywny.
pt_br: A porta "{1}" do túnel do desenvolvedor "{0}" não está ativa.
ru: Порт "{1}" туннеля разработки "{0}" не активен.
tr: Geliştirme tüneli '{0}' bağlantı noktası '{1}' etkin değil.
zh_hans: 开发隧道 "{0}" 端口 "{1}" 未处于活动状态。
zh_hant: 開發通道 '{0}' 連接埠 '{1}' 未啟用。

# DevtunnelCliVersionNotSupported
source: The installed devtunnel CLI version {0} is not supported. Version {1} or higher is required.
cs: Nainstalovaná verze příkazového řádku devtunnel {0} není podporovaná. Vyžaduje se verze {1} nebo vyšší.
de: Die installierte devtunnel-CLI-Version {0} wird nicht unterstützt. Version {1} oder höher ist erforderlich.
es: La versión instalada de la CLI de devtunnel {0} no es compatible. Se requiere la versión {1} o superior.
fr: La version installée de l’interface CLI devtunnel {0} n’est pas prise en charge. La version {1} ou supérieure est requise.
it: La versione installata dell'interfaccia della riga di comando del tunnel dev {0} non è supportata. È necessaria la versione {1} o successiva.
ja: インストールされている devtunnel CLI バージョン {0} はサポートされていません。バージョン {1} 以上が必要です。
ko: 설치된 devtunnel CLI 버전 {0}은(는) 지원되지 않습니다. 버전 {1} 이상이 필요합니다.
pl: Zainstalowana wersja {0} interfejsu wiersza polecenia tunelu deweloperskiego nie jest obsługiwana. Wymagana jest wersja {1} lub nowsza.
pt_br: Não há suporte para a versão da CLI {0} do túnel do desenvolvedor instalada. A versão {1} ou superior é necessária.
ru: Установленная версия CLI devtunnel {0} не поддерживается. Требуется версия {1} или более поздняя.
tr: Yüklü devtunnel CLI sürümü {0} desteklenmiyor. Sürüm {1} veya üstü gereklidir.
zh_hans: 安装的 devtunnel CLI 版本 {0} 不受支持。需要版本 {1} 或更高版本。
zh_hant: 不支援已安裝的 devtunnel CLI 版本 {0}。需要版本 {1} 或更高版本。

source: Installation instructions
cs: Pokyny k instalaci
de: Installationsanleitung
es: Instrucciones de instalación
fr: Instructions d’installation
it: Istruzioni per l'installazione
ja: インストール手順
ko: 설치 지침
pl: Instrukcje instalacji
pt_br: Instruções de instalação
ru: Инструкции по установке
tr: Yükleme yönergeleri
zh_hans: 安装说明
zh_hant: 安裝指示

source: Login with GitHub
cs: Přihlásit se pomocí GitHubu
de: Mit GitHub anmelden
es: Iniciar sesión con GitHub
fr: Connexion avec GitHub
it: Accedi con GitHub
ja: GitHub でログイン
ko: GitHub로 로그인
pl: Zaloguj się za pomocą usługi GitHub
pt_br: Fazer logon com o GitHub
ru: Войти с помощью GitHub
tr: GitHub ile oturum açma
zh_hans: 使用 GitHub 登录
zh_hant: 使用 GitHub 登入

source: Login with Microsoft
cs: Přihlásit se pomocí účtu Microsoft
de: Bei Microsoft anmelden
es: Iniciar sesión con Microsoft
fr: Se connecter avec Microsoft
it: Accedi con Microsoft
ja: Microsoft でログインする
ko: Microsoft로 로그인
pl: Zaloguj się za pomocą konta Microsoft
pt_br: Fazer logon com a Microsoft
ru: Войти с помощью учетной записи Майкрософт
tr: Microsoft ile oturum açın
zh_hans: 使用 Microsoft 登录
zh_hant: 使用 Microsoft 登入

# RequiredCommandNotification
source: Required command '{0}' was not found on PATH or at a specified location.
cs: Požadovaný příkaz {0} nebyl nalezen v cestě PATH nebo v zadaném umístění.
de: Der erforderliche Befehl „{0}“ wurde weder im PATH noch an einem angegebenen Speicherort gefunden.
es: No se encontró el comando requerido '{0}' en la ruta de acceso ni en la ubicación especificada.
fr: La commande requise « {0} » est introuvable dans le CHEMIN ou à l’emplacement spécifié.
it: Il comando richiesto '{0}' non è stato trovato in PATH o nel percorso specificato.
ja: 必要なコマンド '{0}' が PATH または指定された場所に見つかりませんでした。
ko: PATH 또는 지정된 위치에서 필수 명령 '{0}'을(를) 찾을 수 없습니다.
pl: Nie znaleziono wymaganego polecenia „{0}” w ścieżce PATH lub w określonej lokalizacji.
pt_br: O comando necessário "{0}" não foi encontrado em PATH ou em um local especificado.
ru: Требуемая команда "{0}" не найдена в PATH или в указанном расположении.
tr: Gerekli komut '{0}' PATH'de veya belirtilen konumda bulunamadı.
zh_hans: 在 PATH 或指定位置找不到所需命令 "{0}"。
zh_hant: 在 PATH 或指定位置找不到必要的指令碼 '{0}'。

# RequiredCommandNotificationWithLink
source: Required command '{0}' was not found. See installation instructions for more details.
cs: Požadovaný příkaz {0} nebyl nalezen. Další podrobnosti najdete v pokynech k instalaci.
de: Der erforderliche Befehl „{0}“ wurde nicht gefunden. Weitere Informationen finden Sie in den Installationsanweisungen.
es: No se encontró el comando necesario '{0}'. Consulte las instrucciones de instalación para obtener más detalles.
fr: La commande nécessaire « {0} » n’a pas été fournie. Consultez les instructions d’installation pour obtenir plus d’informations.
it: Il comando obbligatorio '{0}' non è stato trovato. Per altri dettagli, vedere le istruzioni di installazione.
ja: 必要なコマンド '{0}' が見つかりませんでした。詳細については、インストール手順を参照してください。
ko: 필수 명령 '{0}'을(를) 찾을 수 없습니다. 자세한 내용은 설치 지침을 참조하세요.
pl: Nie znaleziono wymaganego polecenia „{0}”. Zobacz instrukcje instalacji, aby uzyskać więcej szczegółów.
pt_br: O comando necessário "{0}" não foi encontrado. Consulte as instruções de instalação para obter mais detalhes.
ru: Обязательная команда "{0}" не найдена. Дополнительные сведения см. в инструкциях по установке.
tr: Gerekli komut '{0}' bulunamadı. Daha fazla bilgi için yükleme yönergelerine bakın.
zh_hans: 找不到所需命令 "{0}"。有关详细信息，请参阅安装说明。
zh_hant: 找不到所需的命令 '{0}'。如需詳細資料，請參閱安裝指示。

# RequiredCommandNotificationWithValidation
source: {0} See installation instructions for more details.
cs: {0} Další podrobnosti najdete v pokynech k instalaci.
de: {0} Weitere Informationen finden Sie in den Installationsanweisungen.
es: {0} Consulte las instrucciones de instalación para obtener más detalles.
fr: {0} Consultez les instructions d’installation pour obtenir plus de détails.
it: {0} Per altri dettagli, vedere le istruzioni di installazione.
ja: {0} 詳細については、インストール手順を参照してください。
ko: {0} 자세한 내용은 설치 지침을 참조하세요.
pl: {0} Zobacz instrukcje instalacji, aby uzyskać więcej szczegółów.
pt_br: {0} Consulte as instruções de instalação para obter mais detalhes.
ru: {0} Дополнительные сведения см. в инструкциях по установке.
tr: {0} Daha fazla bilgi için yükleme yönergelerine bakın.
zh_hans: {0} 有关详细信息，请参阅安装说明。
zh_hant: {0} 如需詳細資料，請參閱安裝指示。
