Repository: dotnet/aspire
Catalog: extension/loc/xlf/aspire-vscode.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# aspire-vscode.strings.launchingWithDirectory
source: Launching Aspire debug session using directory {0}: attempting to determine effective apphost...
cs: Spouští se ladicí relace Aspire používající adresáře {0}: probíhá pokus o určení efektivního hostitele aplikací...
de: Die Aspire-Debugsitzung wird mithilfe des Verzeichnisses {0} gestartet: es wird versucht, einen effektiven Apphost zu ermitteln …
es: Iniciando sesión de depuración de Aspire usando el directorio {0}: intentando determinar el apphost efectivo...
fr: Lancement de la session de débogage Aspire en utilisant le répertoire {0} : tentative de détermination de l’apphost effectif...
it: Avvio della sessione di debug Aspire tramite la directory {0}: tentativo di determinare l'apphost valido...
ja: ディレクトリ {0} を使用して Aspire デバッグ セッションを起動中: 有効な apphost を判定しています...
ko: 디렉터리 {0}을(를) 사용하여 Aspire 디버그 세션을 시작하는 중입니다. 유효한 apphost를 확인하는 중...
pl: Trwa uruchamianie sesji debugowania Aspire przy użyciu katalogu {0}: próba określenia efektywnego hostu aplikacji...
pt_br: Iniciando a sessão de depuração do Aspire usando o diretório {0}: tentando determinar o apphost efetivo...
ru: Запуск сеанса отладки Aspire с помощью каталога {0}: попытка определить действующий apphost...
tr: {0} dizini kullanılarak Aspire hata ayıklama oturumu başlatılıyor: etkili apphost'u belirlemeye çalışılıyor...
zh_hans: 正在使用目录 {0} 启动 Aspire 调试会话: 正在尝试确定有效的 apphost...
zh_hant: 正在使用目錄 {0} 啟動 Aspire 偵錯工作階段: 正在嘗試判斷有效的 apphost...

# command.config
source: Manage configuration settings
cs: Spravovat nastavení konfigurace
de: Konfigurationseinstellungen verwalten
es: Administrar las opciones de configuración
fr: Gérer les paramètres de configuration
it: Gestire le impostazioni di configurazione
ja: 構成設定の管理
ko: 구성 설정 관리
pl: Zarządzaj ustawieniami konfiguracji
pt_br: Gerencie as definições de configuração
ru: Управление параметрами конфигурации
tr: Yapılandırma ayarlarını yönetin
zh_hans: 管理配置设置
zh_hant: 管理組態設定

# command.new
source: New Aspire project
cs: Nový projekt Aspire
de: Neues Aspire-Projekt
es: Nuevo proyecto de Aspire
fr: Nouveau projet Aspire
it: Nuovo progetto Aspire
ja: 新しい Aspire プロジェクト
ko: 새 Aspire 프로젝트
pl: Nowy projekt Aspire
pt_br: Novo projeto do Aspire
ru: Новый проект Aspire
tr: Yeni Aspire projesi
zh_hans: 新建 Aspire 项目
zh_hant: 新增 Aspire 專案

# aspire-vscode.strings.no
source: No
cs: Ne
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pl: Nie
pt_br: Não
ru: Нет
tr: Hayır
zh_hans: 否
zh_hant: 否

# aspire-vscode.strings.noCsharpBuildTask
source: No C# Dev Kit build task found.
cs: Nenašla se žádná úloha sestavení C# Dev Kit.
de: Es wurde keine C#-Dev Kit-Buildaufgabe gefunden.
es: No se encontró ninguna tarea de compilación del kit de desarrollo de C#.
fr: Tâche de génération du Kit de développement C# introuvable.
it: Nessuna attività di compilazione di C# Dev Kit trovata.
ja: C# 開発キットのビルド タスクが見つかりませんでした。
ko: C# 개발 키트 빌드 작업을 찾을 수 없습니다.
pl: Nie znaleziono zadania kompilacji zestawu deweloperskiego języka C#.
pt_br: Não foram encontradas tarefas de compilação do Kit de Desenvolvimento C#.
ru: Задачи сборки C# Dev Kit не найдены.
tr: C# Dev Kit derleme görevi bulunamadı.
zh_hans: 找不到 C# 开发工具包生成任务。
zh_hant: 找不到 C# 開發人員套件建置工作。

# aspire-vscode.strings.noCsprojFound
source: No apphost found in the current workspace.
cs: V aktuálním pracovním prostoru se nenašel žádný hostitel aplikací.
de: Im aktuellen Arbeitsbereich wurde kein Apphost gefunden.
es: No se encontró ningún apphost en el área de trabajo actual.
fr: Apphost introuvable dans l’espace de travail actuel.
it: Nessun apphost trovato nell'area di lavoro corrente.
ja: 現在のワークスペースに apphost が見つかりません。
ko: 현재 작업 영역에서 apphost를 찾을 수 없습니다.
pl: Nie znaleziono hosta aplikacji w bieżącym obszarze roboczym.
pt_br: O item apphost não foi encontrado no espaço de trabalho atual.
ru: В текущей рабочей области не найден apphost.
tr: Geçerli çalışma alanında apphost bulunamadı.
zh_hans: 在当前工作区中找不到 apphost。
zh_hant: 在目前的工作區中找不到 apphost。

# aspire-vscode.strings.noOutputFromMsbuild
source: No output from msbuild.
cs: Žádný výstup z nástroje msbuild.
de: Keine Ausgabe von msbuild.
es: No hay resultados de MSBuild.
fr: Aucune sortie de MSBuild.
it: Nessun output da msbuild.
ja: msbuild からの出力はありません。
ko: msbuild에서 출력이 없습니다.
pl: Brak danych wyjściowych z programu Microsoft Build Engine.
pt_br: Não há saídas do msbuild.
ru: Нет вывода из MSBuild.
tr: msbuild'den çıktı yok.
zh_hans: 没有来自 msbuild 的输出。
zh_hant: 沒有來自 msbuild 的輸出。

# aspire-vscode.strings.noWatchTask
source: No watch task found. Please ensure a watch task is defined in your workspace.
cs: Nenašel se žádný úkol sledování. Ujistěte se prosím, že je ve vašem pracovním prostoru definovaná úloha sledování.
de: Es wurde keine Überwachungsaufgabe gefunden. Stellen Sie sicher, dass in Ihrem Arbeitsbereich eine Überwachungsaufgabe definiert ist.
es: No se encontró ninguna tarea de inspección. Asegúrese de que se haya definido una tarea de inspección en el área de trabajo.
fr: Aucune tâche de surveillance trouvée. Vérifiez qu’une tâche de surveillance est définie dans votre espace de travail.
it: Nessuna attività di controllo trovata. Assicurarsi che nell'area di lavoro sia definita un'attività di controllo.
ja: 監視タスクが見つかりません。ワークスペースで監視タスクが定義されていることを確認してください。
ko: 감시 작업을 찾을 수 없습니다. 작업 영역에 감시 작업이 정의되어 있는지 확인하세요.
pl: Nie znaleziono zadania obserwowania. Upewnij się, że zadanie obserwowania jest zdefiniowane w obszarze roboczym.
pt_br: Não foram encontradas tarefas de monitoramento. Verifique se uma tarefa de monitoramento está definida no seu espaço de trabalho.
ru: Задача наблюдения не найдена. Убедитесь, что в рабочей области определена задача наблюдения.
tr: İzleme görevi bulunamadı. Çalışma alanınızda bir izleme görevi tanımlandığından emin olun.
zh_hans: 找不到监视任务。请确保工作区中定义了监视任务。
zh_hant: 找不到監視工作。請確保您的工作區中已定義監視工作。

# aspire-vscode.strings.noWorkspaceFolder
source: No workspace folder found.
cs: Nenašla se žádná složka pracovního prostoru.
de: Kein Arbeitsbereichsordner gefunden.
es: No se encontró ninguna carpeta del área de trabajo.
fr: Dossier de l’espace de travail introuvable.
it: Nessuna cartella dell'area di lavoro trovata.
ja: ワークスペース フォルダーが見つかりません。
ko: 작업 영역 폴더를 찾을 수 없습니다.
pl: Nie znaleziono folderu obszaru roboczego.
pt_br: Não foram encontradas pastas do espaço de trabalho.
ru: Не найдена папка рабочей области.
tr: Çalışma alanı klasörü bulunamadı.
zh_hans: 找不到工作区文件夹。
zh_hant: 找不到工作區資料夾。

# aspire-vscode.strings.noWorkspaceOpen
source: No workspace is open. Please open a folder or workspace before running this command.
cs: Není otevřený žádný pracovní prostor. Před spuštěním tohoto příkazu prosím otevřete složku nebo pracovní prostor.
de: Es ist kein Arbeitsbereich geöffnet. Öffnen Sie einen Ordner oder Arbeitsbereich, bevor Sie diesen Befehl ausführen.
es: No hay ningún área de trabajo abierta. Abra una carpeta o un área de trabajo antes de ejecutar este comando.
fr: Aucun espace de travail n’est ouvert. Ouvrez un dossier ou un espace de travail avant d’exécuter cette commande.
it: Nessuna area di lavoro aperta. Aprire una cartella o un'area di lavoro prima di eseguire questo comando.
ja: ワークスペースが開いていません。このコマンドを実行する前に、フォルダーまたはワークスペースを開いてください。
ko: 열려 있는 작업 영역이 없습니다. 이 명령을 실행하기 전에 폴더나 작업 영역을 여세요.
pl: Żaden obszar roboczy nie jest otwarty. Przed uruchomieniem tego polecenia otwórz folder lub obszar roboczy.
pt_br: Não há espaços de trabalho abertos. Abra uma pasta ou espaço de trabalho antes de executar este comando.
ru: Рабочая область не открыта. Перед выполнением команды откройте папку или рабочую область.
tr: Hiçbir çalışma alanı açık değil. Bu komutu çalıştırmadan önce bir klasör veya çalışma alanı açın.
zh_hans: 未打开工作区。请先打开文件夹或工作区，再运行此命令。
zh_hant: 未開啟工作區。執行此命令之前，請先開啟資料夾或工作區。

# extension.description
source: Official Aspire extension for Visual Studio Code
cs: Oficiální rozšíření Aspire pro Visual Studio Code
de: Offizielle Erweiterung für Visual Studio Code
es: Extensión oficial de La Visual Studio Code
fr: Extension officielle Aspire pour Visual Studio Code
it: Estensione ufficiale di Aspire per Visual Studio Code
ja: Visual Studio Code の公式 Aspire 拡張機能
ko: Visual Studio Code 공식 Aspire 확장
pl: Oficjalne rozszerzenie dla aplikacji Aspire dla programu Visual Studio Code
pt_br: Extensão oficial do Aspire para Visual Studio Code
ru: Официальное расширение Aspire для Visual Studio Code
tr: Visual Studio Code için resmi Aspire uzantısı
zh_hans: Visual Studio Code 的官方 Aspire 扩展
zh_hant: Visual Studio Code 的官方 Aspire 延伸模組

# command.openTerminal
source: Open Aspire terminal
cs: Otevřít terminál Aspire
de: Aspire-Terminal öffnen
es: Abrir terminal de Aspire
fr: Ouvrir le terminal Aspire
it: Apri terminale Aspire
ja: Aspire ターミナルを開く
ko: Aspire 터미널 열기
pl: Otwórz terminal Aspire
pt_br: Abrir o terminal do Aspire
ru: Открыть терминал Aspire
tr: Aspire terminalini açın
zh_hans: 打开 Aspire 终端
zh_hant: 開啟 Aspire 終端

# aspire-vscode.strings.codespacesLink
source: Open codespaces URL
cs: Otevřít adresu URL Codespaces
de: Codespaces-URL öffnen
es: Abrir la dirección URL de codespaces
fr: Ouvrir l’URL des codespaces
it: Apri l'URL di Codespaces
ja: codespaces URL を開く
ko: codespaces URL 열기
pl: Otwórz adres URL usługi Codespaces
pt_br: Abrir a URL dos codespaces
ru: Открыть URL-адрес Codespaces
tr: Codespaces'i aç URL'si
zh_hans: 打开 codespaces URL
zh_hant: 開啟 Codespaces URL

# aspire-vscode.strings.directLink
source: Open local URL
cs: Otevřít místní adresu URL
de: Lokale URL öffnen
es: Abrir dirección URL local
fr: Ouvrir l’URL locale
it: Apri URL locale
ja: ローカル URL を開く
ko: 로컬 URL 열기
pl: Otwórz lokalny adres URL
pt_br: Abrir a URL local
ru: Открыть локальный URL-адрес
tr: Yerel URL'yi aç
zh_hans: 打开本地 URL
zh_hant: 開啟本機 URL

# extension.debug.program
source: Path to the apphost to run
cs: Cesta ke hostiteli aplikací, který se má spustit
de: Pfad zum auszuführenden Apphost
es: Ruta de acceso al apphost que se va a ejecutar
fr: Chemin de l’apphost à exécuter
it: Percorso dell'apphost da eseguire
ja: 実行する apphost へのパス
ko: 실행할 apphost의 경로
pl: Ścieżka do hosta aplikacji do uruchomienia
pt_br: Caminho do apphost a ser executado
ru: Путь к apphost для запуска
tr: Çalıştırılacak apphost'a giden yol
zh_hans: 要运行的 apphost 路径
zh_hant: 要執行的 apphost 的路徑

# aspire-vscode.strings.processExitedWithCode
source: Process exited with code {0}.
cs: Proces byl ukončen s kódem {0}.
de: Der Prozess wurde mit Code {0} beendet.
es: Proceso cerrado con el código {0}.
fr: Le processus s'est arrêté avec le code {0}.
it: Processo terminato con codice {0}.
ja: プロセスがコード {0} で終了しました。
ko: 프로세스가 코드 {0}(으)로 종료됨
pl: Proces został zakończony z kodem {0}.
pt_br: Processo encerrado com o código {0}.
ru: Процесс завершил работу с кодом {0}.
tr: İşlem, {0} koduyla sonlandırıldı.
zh_hans: 已退出进程，代码为 {0}。
zh_hant: 程序已結束，代碼為 {0}。

# command.publish
source: Publish deployment artifacts
cs: Publikovat artefakty nasazení
de: Veröffentlichen von Bereitstellungsartefakten
es: Publicación de artefactos de implementación
fr: Publier des artefacts de déploiement
it: Pubblicare artefatti di distribuzione
ja: デプロイ成果物を公開する
ko: 배포 아티팩트 게시
pl: Opublikuj artefakty wdrożenia
pt_br: Publicar artefatos de implantação
ru: Опубликовать артефакты развертывания
tr: Dağıtım yapılarını yayımlayın
zh_hans: 发布部署工件
zh_hant: 發佈部署成品

# aspire-vscode.strings.rpcServerError
source: RPC server error: {0}.
cs: Chyba serveru RPC: {0}.
de: RPC-Serverfehler: {0}.
es: Error del servidor RPC: {0}.
fr: Erreur du serveur RPC : {0}.
it: Errore del server RPC: {0}.
ja: RPC サーバー エラー: {0}。
ko: RPC 서버 오류: {0}.
pl: Błąd serwera RPC: {0}.
pt_br: Erro do servidor RPC: {0}.
ru: Ошибка сервера RPC: {0}.
tr: RPC sunucu hatası: {0}.
zh_hans: RPC 服务器错误: {0}。
zh_hant: RPC 伺服器錯誤: {0}。

# aspire-vscode.strings.rpcServerNotInitialized
source: RPC server is not initialized.
cs: Server RPC není inicializován.
de: Der RPC-Server wurde nicht initialisiert.
es: El servidor RPC no está inicializado.
fr: Le serveur RPC n’est pas initialisé.
it: Il server RPC non è inizializzato.
ja: RPC サーバーが初期化されていません。
ko: RPC 서버가 초기화되지 않았습니다.
pl: Serwer RPC nie został zainicjowany.
pt_br: O servidor RPC não foi inicializado.
ru: RPC-сервер не инициализирован.
tr: RPC sunucusu başlatılmadı.
zh_hans: RPC 服务器未初始化。
zh_hant: RPC 伺服器未初始化。

# aspire-vscode.strings.requiredCapability
source: Required capability: {0}.
cs: Požadovaná funkce: {0}.
de: Erforderliche Funktion: {0}.
es: Funcionalidad necesaria: {0}.
fr: Fonctionnalité requise : {0}.
it: Funzionalità richiesta: {0}.
ja: 必要な機能: {0}。
ko: 필수 기능: {0}.
pl: Wymagana możliwość: {0}.
pt_br: Funcionalidade necessária: {0}.
ru: Требуемая возможность: {0}.
tr: Gerekli yetenek: {0}.
zh_hans: 所需功能: {0}。
zh_hant: 需要的功能: {0}。

# aspire-vscode.strings.incompatibleAppHostError
source: The apphost is not compatible. Consider upgrading the apphost or Aspire CLI.
cs: Hostitel aplikací není kompatibilní. Zvažte možnost upgradovat hostitele aplikací nebo rozhraní příkazového řádku Aspire.
de: Der Apphost ist nicht kompatibel. Erwägen Sie ein Upgrade des App-Hosts oder von Aspire CLI.
es: El apphost no es compatible. Considere actualizar apphost o la CLI de Aspire.
fr: L’apphost n’est pas compatible. Envisagez de mettre à jour l’apphost ou l’interface Aspire CLI.
it: L'apphost non è compatibile. Valutare la possibilità di aggiornare l'apphost o l'interfaccia della riga di comando di Aspire.
ja: apphost に互換性がありません。apphost または Aspire CLI のアップグレードを検討してください。
ko: apphost가 호환되지 않습니다. apphost나 Aspire CLI를 업그레이드하는 것이 좋습니다.
pl: Host aplikacji jest niezgodny. Rozważ uaktualnienie hosta aplikacji lub interfejsu wiersza polecenia aplikacji Aspire.
pt_br: O apphost não é compatível. Considere atualizar o apphost ou a CLI do Aspire.
ru: Узел приложения несовместим. Рассмотрите возможность перевода apphost или Aspire CLI на более высокий уровень.
tr: Apphost uyumlu değil. Apphost veya Aspire CLI'yi yükseltmeyi düşünün.
zh_hans: apphost 不兼容。请考虑升级 apphost 或 Aspire CLI。
zh_hant: apphost 不相容。考慮升級 apphost 或 Aspire CLI。

# aspire-vscode.strings.fieldRequired
source: This field is required.
cs: Toto pole je povinné.
de: Dies ist ein Pflichtfeld.
es: Este campo es obligatorio.
fr: Ce champ est obligatoire.
it: Questo campo è obbligatorio.
ja: このフィールドは必須です。
ko: 필수 입력 필드입니다.
pl: To pole jest wymagane.
pt_br: Este campo é obrigatório.
ru: Это обязательное поле.
tr: Bu alan gereklidir.
zh_hans: 此字段是必填字段。
zh_hant: 這是必要欄位。

# command.update
source: Update integrations
cs: Aktualizovat integrace
de: Aktualisieren von Integrationen
es: Actualizar integraciones
fr: Mettre à jour les intégrations
it: Aggiorna integrazioni
ja: 統合の更新
ko: 통합 업데이트
pl: Zaktualizuj integracje
pt_br: Atualizar integrações
ru: Обновить интеграции
tr: Tümleştirmeleri güncelleştir
zh_hans: 更新集成
zh_hant: 更新整合

# aspire-vscode.strings.watchProject
source: Watch {0} ({1})
cs: Sledovat {0} ({1})
de: {0} ansehen ({1})
es: Inspeccionar {0} ({1})
fr: Regarder {0} ({1})
it: Controlla {0} ({1})
ja: {0} を視聴 ({1})
ko: {0}({1}) 보기
pl: Obejrzyj {0} ({1})
pt_br: Inspeção {0} ({1})
ru: Смотреть {0} ({1})
tr: {0} ({1}) izle
zh_hans: 观看 {0} ({1})
zh_hant: 監視 {0} ({1})

# aspire-vscode.strings.yes
source: Yes
cs: Ano
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pl: Tak
pt_br: Sim
ru: Да
tr: Evet
zh_hans: 是
zh_hant: 是

# extension.title
source: Aspire VSCode
es: VsCode de Aspire
