Repository: dotnet/aspire
Catalog: extension/loc/xlf/aspire-vscode.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# aspire-vscode.strings.debugSessionAlreadyExists
source: A debug session is already active for id {0}.
cs: Ladicí relace ke již aktivní pro ID {0}.
de: Für die ID {0} ist bereits eine Debugsitzung aktiv.
es: Ya hay una sesión de depuración activa para el identificador {0}.
fr: Une session de débogage est déjà active pour l’ID {0}.
it: Sessione di debug già attiva per l'ID {0}.
ja: ID {0} のデバッグ セッションは既にアクティブです。
ko: id {0}에 대한 디버그 세션이 이미 활성화되어 있습니다.
pl: Sesja debugowania jest już aktywna dla identyfikatora {0}.
pt_br: Uma sessão de depuração já está ativa na ID {0}.
ru: Сеанс отладки с идентификатором {0} уже активен.
tr: {0} kimliği için bir hata ayıklama oturumu zaten etkin.
zh_hans: ID {0} 的调试会话已处于活动状态。
zh_hant: 識別碼 {0} 的偵錯工作階段已在使用中。

# command.add
source: Add an integration
cs: Přidat integraci
de: Hinzufügen einer Integration
es: Agregar una integración
fr: Ajouter une intégration
it: Aggiungi un'integrazione
ja: 統合の追加
ko: 통합 추가
pl: Dodaj integrację
pt_br: Adicionar uma integração
ru: Добавить интеграцию
tr: Bir tümleştirme ekleyin
zh_hans: 添加集成
zh_hant: 新增整合

# aspire-vscode.strings.aspireCliVersion
source: Aspire CLI Version: {0}.
cs: Verze Aspire CLI: {0}.
es: Versión de la CLI de Aspire: {0}.
fr: Version de l’interface CLI Aspire : {0}.
it: Versione dell'interfaccia della riga di comando di Aspire: {0}.
ja: Aspire CLI バージョン: {0}。
ko: Aspire CLI 버전: {0}
pl: Wersja interfejsu wiersza polecenia platformy Aspire: {0}.
pt_br: Versão da CLI do Azure: {0}.
ru: Версия Aspire CLI: {0}.
tr: Aspire CLI Sürümü: {0}.
zh_hans: Aspire CLI 版本: {0}。
zh_hant: Aspire CLI 版本: {0}。

# aspire-vscode.strings.aspireOutputChannelName
source: Aspire Extension
cs: Rozšíření Aspire
de: Aspire-Erweiterung
es: Extensión Aspire
fr: Extension Aspire
it: Estensione Aspire
ja: Aspire 拡張機能
ko: Aspire 확장
pl: Rozszerzenie aplikacji Aspire
pt_br: Extensão do Aspire
ru: Расширение Aspire
tr: Aspire Uzantısı
zh_hans: Aspire 扩展
zh_hant: Aspire 延伸模組

# aspire-vscode.strings.aspireHostingSdkVersion
source: Aspire Hosting SDK Version: {0}.
cs: Verze sady SDK pro hostování Aspire: {0}.
de: Aspire-Version des Hosting-SDK: {0}.
es: Versión del SDK de Aspire Hosting: {0}.
fr: Version du SDK d’hébergement Aspire : {0}.
it: Versione Aspire Hosting SDK: {0}.
ja: Aspire ホスティング SDK バージョン: {0}。
ko: Aspire Hosting SDK 버전: {0}.
pl: Aspire Hosting SDK Wersja: {0}.
pt_br: Versão do SDK de Hospedagem Aspire: {0}.
ru: Версия SDK для размещения в Hosting: {0}.
tr: Aspire Hosting SDK Sürümü: {0}.
zh_hans: Aspire Hosting SDK 版本: {0}。
zh_hant: Aspire Hosting SDK 版本: {0}。

# aspire-vscode.strings.aspireConfigExists
source: Aspire launch configuration already exists in launch.json.
cs: Konfigurace spuštění Aspire už v launch.json existuje.
de: Die Aspire-Startkonfiguration ist bereits in launch.json vorhanden.
es: La configuración de inicio de Aspire ya existe en launch.json.
fr: La configuration de lancement Aspire existe déjà dans launch.json.
it: La configurazione di avvio Aspire esiste già in launch.json.
ja: Aspire の起動構成は既に launch.json に存在します。
ko: launch.json에 Aspire 시작 구성이 이미 존재합니다.
pl: Konfiguracja uruchamiania aplikacji Aspire już istnieje w pliku launch.json.
pt_br: Já existe uma configuração de inicialização do Aspire no launch.json.
ru: Конфигурация запуска Aspire уже существует в launch.json.
tr: Aspire başlatma yapılandırması launch.json dosyasında zaten mevcut.
zh_hans: launch.json 中已存在 Aspire 启动配置。
zh_hant: Aspire 個啟動設定已存在於 launch.json。

# aspire-vscode.strings.aspireTerminalName
source: Aspire terminal
cs: Terminál Aspire
es: Terminal de Aspire
fr: Terminal Aspire
it: Terminale Aspire
ja: Aspire ターミナル
ko: Aspire 터미널
pl: Terminal Aspire
pt_br: Terminal do Aspire
ru: Терминал Aspire
tr: Aspire terminali
zh_hans: Aspire 终端
zh_hant: Aspire 終端

# extension.debug.defaultConfiguration.name
source: Aspire: Launch default apphost
cs: Aspire: spuštění výchozího hostitele aplikací
de: Aspire: Standard-Apphost starten
es: Aspire: Iniciar apphost predeterminado
fr: Aspire : Lancez l’apphost par défaut
it: Aspire: avvia apphost predefinito
ja: Aspire: 既定の apphost を起動する
ko: Aspire: 기본 apphost 시작
pl: Aspire: uruchom domyślny host aplikacji
pt_br: Aspire: iniciar o apphost padrão
ru: Aspire: запуск приложения apphost по умолчанию
tr: Aspire: Varsayılan apphost'u başlat
zh_hans: Aspire: 启动默认 apphost
zh_hant: Aspire: 啟動預設的 apphost

# aspire-vscode.strings.unsupportedResourceType
source: Attempted to start unsupported resource type: {0}.
cs: Byl proveden pokus o spuštění nepodporovaného typu prostředku: {0}.
de: Es wurde versucht, den nicht unterstützten Ressourcentyp zu starten: {0}.
es: Se intentó iniciar el tipo de recurso no admitido: {0}.
fr: Tentative de démarrage du type de ressource non pris en charge : {0}.
it: Tentativo di avviare un tipo di risorsa non supportato: {0}.
ja: サポートされていないリソースの種類を開始しようとしました: {0}。
ko: 지원되지 않는 리소스 종류를 시작하려고 했습니다. {0}.
pl: Podjęto próbę uruchomienia nieobsługiwanego typu zasobu: {0}.
pt_br: Tentativa de iniciar o tipo de recurso sem suporte: {0}.
ru: Попытка запуска неподдерживаемого типа ресурса: {0}.
tr: Desteklenmeyen kaynak türü başlatılmaya çalışıldı: {0}.
zh_hans: 已尝试启动不受支持的资源类型: {0}。
zh_hant: 已嘗試啟動不支援的資源類型: {0}。

# aspire-vscode.strings.buildFailedWithExitCode
source: Build failed with exit code {0}.
cs: Sestavení se nezdařilo s ukončovacím kódem {0}.
de: Fehler bei dem Build mit Exitcode {0}.
es: Error de compilación con código de salida {0}.
fr: Échec de la build avec le code de sortie {0}.
it: Compilazione non riuscita con codice di uscita {0}.
ja: ビルドが終了コード {0} により失敗しました。
ko: 종료 코드 {0}(으)로 빌드하지 못했습니다.
pl: Kompilacja nie powiodła się z kodem zakończenia {0}.
pt_br: Falha na compilação com o código {0}.
ru: Сбой сборки с кодом завершения {0}.
tr: Derleme, çıkış kodu {0} ile başarısız oldu.
zh_hans: 生成失败，退出代码为 {0}。
zh_hant: 建置失敗，結束代碼 {0}。

# aspire-vscode.strings.csharpSupportNotEnabled
source: C# support is not enabled in this workspace. This project should have started through the Aspire CLI.
cs: Podpora jazyka C# není v tomto pracovním prostoru povolena. Tento projekt by se měl spustit přes rozhraní příkazového řádku Aspire.
de: Die C#-Unterstützung ist in diesem Arbeitsbereich nicht aktiviert. Dieses Projekt sollte über die Aspire-CLI gestartet worden sein.
es: La compatibilidad con C# no está habilitada en esta área de trabajo. Este proyecto debería haberse iniciado a través de la CLI de Aspire.
fr: La prise en charge de C# n’est pas activée dans cet espace de travail. Ce projet aurait dû être lancé via l’interface Aspire CLI.
it: Il supporto C# non è abilitato in questa area di lavoro. Questo progetto dovrebbe essere avviato tramite l'interfaccia della riga di comando di Aspire.
ja: このワークスペースでは、C# のサポートは有効になっていません。このプロジェクトは、Aspire CLI を使用して開始する必要があります。
ko: 이 작업 영역에서는 C# 지원을 사용할 수 없습니다. 이 프로젝트는 Aspire CLI를 통해 시작해야 합니다.
pl: Obsługa języka C# nie jest włączona w tym obszarze roboczym. Ten projekt powinien zostać rozpoczęty za pośrednictwem interfejsu wiersza polecenia aplikacji Aspire.
pt_br: O suporte a C# não está habilitado neste espaço de trabalho. Este projeto deve ter sido iniciado pela CLI do Aspire.
ru: Поддержка C# не включена в этой рабочей области. Этот проект должен запускаться через Aspire CLI.
tr: Bu çalışma alanında C# desteği etkinleştirilmemiştir. Bu proje Aspire CLI aracılığıyla başlatılmalıydı.
zh_hans: 此工作区未启用 C# 支持。该项目应通过 Aspire CLI 启动。
zh_hant: 未在此工作區中啟用 C# 支援。此專案應該已透過 Aspire CLI 啟動。

# extension.debug.debuggers
source: Configuration to apply when launching resources of specific types
cs: Konfigurace, která se má použít při spouštění prostředků konkrétních typů
de: Konfiguration, die beim Starten von Ressourcen bestimmter Typen angewendet werden soll
es: Configuración que se aplicará al iniciar recursos de tipos específicos
fr: Configuration à appliquer lors du lancement de ressources de types spécifiques
it: Configurazione da applicare all'avvio delle risorse di tipi specifici
ja: 特定の種類のリソースを起動するときに適用する構成
ko: 특정 유형의 리소스를 시작할 때 적용할 구성
pl: Konfiguracja stosowana podczas uruchamiania zasobów określonych typów
pt_br: Configuração a ser aplicada ao iniciar os recursos de tipos específicos
ru: Конфигурация для применения при запуске ресурсов определённых типов
tr: Belirli türdeki kaynakları başlatırken uygulanacak yapılandırma
zh_hans: 启动特定类型的资源时应用的配置
zh_hant: 啟動特定類型資源時要套用的設定

# command.configureLaunchJson
source: Configure launch.json file
cs: Nakonfigurovat soubor launch.json
de: Konfigurieren der launch.json Datei
es: Configurar launch.json archivo
fr: Configurer le fichier launch.json
it: Configura file launch.json
ja: launch.json ファイルの構成
ko: launch.json 파일 구성
pl: Konfigurowanie pliku launch.json
pt_br: Configurar o arquivo launch.json
ru: Настроить файл launch.json
tr: launch.json dosyasını yapılandırın
zh_hans: 配置 launch.json 文件
zh_hant: 設定 launch.json 檔案

# aspire-vscode.strings.dcpServerNotInitialized
source: DCP server not initialized - cannot forward debug output.
cs: Server DCP není inicializován – nelze předat výstup ladění.
de: DCP-Server nicht initialisiert – Debugausgabe kann nicht weitergeleitet werden.
es: Servidor DCP no inicializado: no se puede reenviar la salida de depuración.
fr: Serveur DCP non initialisé : impossible de transférer la sortie de débogage.
it: Server DCP non inizializzato: non è possibile inoltrare l'output di debug.
ja: DCP サーバーが初期化されていないため、デバッグ出力を転送できません。
ko: DCP 서버가 초기화되지 않았습니다. 디버그 출력을 전달할 수 없습니다.
pl: Serwer DCP nie został zainicjowany – nie można przesłać dalej danych wyjściowych debugowania.
pt_br: Servidor DCP não inicializado - não é possível encaminhar a saída de depuração.
ru: Сервер DCP не инициализирован — невозможно переслать отладочные данные вывода.
tr: DCP sunucusu başlatılmadı - hata ayıklama çıktısı iletilemiyor.
zh_hans: DCP 服务器未初始化，无法转发调试输出。
zh_hant: DCP 伺服器未初始化 - 無法轉送偵錯輸出。

# aspire-vscode.strings.debugProject
source: Debug {0}
cs: Ladit {0}
de: {0} debuggen
es: Depurar {0}
fr: Déboguer {0}
it: Eseguire il debug di {0}
ja: {0} のデバッグ
ko: {0} 디버그
pl: Debuguj element {0}
pt_br: Depurar {0}
ru: Отладка {0}
tr: {0} öğesinin hatalarını ayıklayın
zh_hans: 调试 {0}
zh_hant: 偵錯 {0}

# command.deploy
source: Deploy app
cs: Nasadit aplikaci
de: App bereitstellen
es: Implementar aplicación
fr: Déployer l’application
it: Distribuisci l'app
ja: アプリのデプロイ
ko: 앱 배포
pl: Wdróż aplikację
pt_br: Implantar o aplicativo
ru: Развернуть приложение
tr: Uygulama dağıtın
zh_hans: 部署应用
zh_hant: 部署應用程式

# aspire-vscode.strings.directUrl
source: Direct: {0}
cs: Přímé: {0}
de: Direkt: {0}
es: Directo: {0}
it: Diretto: {0}
ja: ダイレクト: {0}
ko: 직접: {0}
pl: Bezpośredni: {0}
pt_br: Direto: {0}
ru: Прямое: {0}
tr: Doğrudan: {0}
zh_hans: 直接: {0}
zh_hant: 直接: {0}

# aspire-vscode.strings.disconnectingFromSession
source: Disconnecting from Aspire debug session... Child processes will be stopped.
cs: Odpojování od ladicí relace Aspire... Podřízené procesy budou zastaveny.
de: Die Verbindung mit der Aspire-Debugsitzung wird getrennt … Untergeordnete Prozesse werden beendet.
es: Desconectando de la sesión de depuración de Aspire... Se detendrán los procesos secundarios.
fr: Déconnexion de la session de débogage Aspire... Les processus enfants seront arrêtés.
it: Disconnessione dalla sessione di debug di Aspire in corso... I processi figlio verranno arrestati.
ja: Aspire デバッグ セッションから切断しています...子プロセスは停止されます。
ko: Aspire 디버그 세션에서 연결을 끊는 중... 자식 프로세스가 중지됩니다.
pl: Trwa rozłączanie od sesji debugowania Aspire... Procesy podrzędne zostaną zatrzymane.
pt_br: Desconectando da sessão de depuração do Aspire... Os processos filhos serão interrompidos.
ru: Отключение от сеанса отладки Aspire... Дочерние процессы будут остановлены.
tr: Aspire hata ayıklama oturumundan bağlantı kesiliyor... Alt süreçler durdurulacaktır.
zh_hans: 正在断开与 Aspire 调试会话的连接...子进程将停止。
zh_hant: 正在中斷與 Aspire 偵錯工作階段的連線...子程序將會停止。

# aspire-vscode.strings.processExceptionOccurred
source: Encountered an exception ({0}) while running the following command: {1}.
cs: Při spuštění následujícího příkazu došlo k výjimce ({0}): {1}.
de: Ausnahme ({0}) beim Ausführen des folgenden Befehls: {1}.
es: Se encontró una excepción ({0}) al ejecutar el siguiente comando: {1}.
fr: Une exception ({0}) s’est produite lors de l’exécution de la commande suivante : {1}.
it: Eccezione ({0}) riscontrata durante l'esecuzione del comando seguente: {1}.
ja: 次のコマンドの実行中に例外 ({0}) が発生しました: {1}。
ko: 다음 명령을 실행하는 동안 예외({0})가 발생했습니다. {1}.
pl: Napotkano wyjątek ({0}) podczas uruchamiania następującego polecenia: {1}.
pt_br: Ocorreu uma exceção ({0}) ao executar o seguinte comando: {1}.
ru: Обнаружено исключение ({0}) при выполнении следующей команды: {1}.
tr: Aşağıdaki komutu çalıştırırken bir özel durum ({0}) ile karşılaşıldı: {1}.
zh_hans: 运行以下命令时遇到异常({0}): {1}。
zh_hant: 執行下列命令時發生例外狀況 ({0}): {1}。

# aspire-vscode.strings.errorRetrievingAppHosts
source: Error retrieving apphosts in the current workspace. Debug options may be incomplete.
cs: Při načítání hostitelů aplikací v aktuálním pracovním prostoru došlo k chybě. Možnosti ladění můžou být neúplné.
de: Fehler beim Abrufen von Apphosts im aktuellen Arbeitsbereich. Debugoptionen sind möglicherweise unvollständig.
es: Error al recuperar apphosts en el área de trabajo actual. Las opciones de depuración pueden estar incompletas.
fr: Erreur lors de la récupération des apphosts dans l’espace de travail actuel. Les options de débogage peuvent être incomplètes.
it: Errore durante il recupero degli apphost nell'area di lavoro corrente. Le opzioni di debug potrebbero non essere complete.
ja: 現在のワークスペースで apphost を取得中にエラーが発生しました。デバッグ オプションが不完全である可能性があります。
ko: 현재 작업 영역에서 apphost를 검색하는 중 오류가 발생했습니다. 디버그 옵션이 불완전할 수 있습니다.
pl: Błąd podczas pobierania hostów aplikacji w bieżącym obszarze roboczym. Opcje debugowania mogą być niekompletne.
pt_br: Ocorre um erro ao recuperar os apphosts no espaço de trabalho atual. É possível que as opções de depuração estejam incompletas.
ru: Ошибка при получении apphost в текущей рабочей области. Параметры отладки могут быть неполными.
tr: Geçerli çalışma alanında apphosts alınırken hata oluştu. Hata ayıklama seçenekleri eksik olabilir.
zh_hans: 检索当前工作区中的 apphost 时出错。调试选项可能不完整。
zh_hant: 在目前的工作區中擷取 apphosts 時發生錯誤。偵錯選項可能不完整。

# aspire-vscode.strings.error
source: Error: {0}
cs: Chyba: {0}
de: Fehler: {0}
fr: Erreur : {0}
it: Errore: {0}
ja: エラー: {0}
ko: 오류: {0}
pl: Błąd: {0}
pt_br: Ocorreu um erro: {0}
ru: Ошибка: {0}
tr: Hata: {0}
zh_hans: 错误: {0}
zh_hant: 錯誤: {0}

# aspire-vscode.strings.extensionContextNotInitialized
source: Extension context is not initialized.
cs: Kontext rozšíření není inicializován.
de: Der Erweiterungskontext wurde nicht initialisiert.
es: No se ha inicializado el contexto de extensión.
fr: Le contexte d’extension n’est pas initialisé.
it: Contesto dell'estensione non inizializzato.
ja: 拡張コンテキストが初期化されていません。
ko: 확장 컨텍스트가 초기화되지 않았습니다.
pl: Kontekst rozszerzenia nie został zainicjowany.
pt_br: O contexto da extensão não foi inicializado.
ru: Контекст расширения не инициализирован.
tr: Uzantı bağlamı başlatılmadı.
zh_hans: 扩展上下文未初始化。
zh_hant: 延伸模組內容未初始化。

# aspire-vscode.strings.failedToConfigureLaunchJson
source: Failed to configure launch.json: {0}.
cs: Nepodařilo se nakonfigurovat launch.json: {0}.
de: Fehler beim Konfigurieren launch.json: {0}.
es: Error al configurar launch.json: {0}.
fr: Échec de la configuration de launch.json : {0}.
it: Non è possibile configurare launch.json: {0}.
ja: launch.jsonを構成できませんでした: {0}。
ko: launch.json을 구성하지 못했습니다. {0}.
pl: Nie udało się skonfigurować pliku launch.json: {0}.
pt_br: Falha ao configurar launch.json: {0}.
ru: Не удалось настроить launch.json: {0}.
tr: launch.json yapılamadı: {0}.
zh_hans: 未能配置 launch.json: {0}。
zh_hant: 無法設定 launch.json: {0}。

# aspire-vscode.strings.addressError
source: Failed to get RPC server address. The extension may not function correctly.
cs: Nepodařilo se načíst adresu serveru RPC. Rozšíření nemusí fungovat správně.
de: Fehler beim Abrufen der RPC-Serveradresse. Die Erweiterung funktioniert möglicherweise nicht ordnungsgemäß.
es: Error al obtener la dirección del servidor RPC. Es posible que la extensión no funcione correctamente.
fr: Échec de l’obtention de l’adresse du serveur RPC. L’extension peut ne pas fonctionner correctement.
it: Non è possibile ottenere l'indirizzo del server RPC. L'estensione potrebbe non funzionare correttamente.
ja: RPC サーバー アドレスを取得できませんでした。拡張機能が正しく機能しない可能性があります。
ko: RPC 서버 주소를 가져오지 못했습니다. 확장이 제대로 작동하지 않을 수 있습니다.
pl: Nie można pobrać adresu serwera zdalnego wywoływania procedury. Rozszerzenie może nie działać poprawnie.
pt_br: Falha ao obter o endereço do servidor RPC. É possível que a extensão não funcione corretamente.
ru: Не удалось получить адрес RPC-сервера. Расширение может работать некорректно.
tr: RPC sunucu adresi alınamadı. Uzantı düzgün çalışmayabilir.
zh_hans: 未能获取 RPC 服务器地址。扩展可能无法正常运行。
zh_hant: 無法取得 RPC 伺服器位址。延伸模組可能無法正確運作。

# aspire-vscode.strings.failedToGetTargetPath
source: Failed to get TargetPath: {0}.
cs: Nepodařilo se načíst TargetPath: {0}.
de: Fehler beim Abrufen von TargetPath: {0}.
es: Error al obtener TargetPath: {0}.
fr: Échec de l’obtention de TargetPath : {0}.
it: Non è possibile ottenere TargetPath: {0}.
ja: TargetPath を取得できませんでした: {0}。
ko: TargetPath를 가져오지 못했습니다. {0}.
pl: Nie można pobrać ścieżki docelowej: {0}.
pt_br: Falha ao obter o TargetPath: {0}.
ru: Не удалось получить TargetPath: {0}.
tr: TargetPath alınamadı: {0}..
zh_hans: 未能获取 TargetPath: {0}。
zh_hant: 無法取得 TargetPath: {0}。

# aspire-vscode.strings.failedToShowPromptEmpty
source: Failed to show prompt, text was empty.
cs: Zobrazení výzvy se nezdařilo, text byl prázdný.
de: Fehler beim Anzeigen der Eingabeaufforderung. Der Text war leer.
es: Error al mostrar el mensaje, el texto estaba vacío.
fr: Échec de l’affichage de l’invite, le texte était vide.
it: Non è possibile visualizzare il prompt, il testo era vuoto.
ja: プロンプトを表示できませんでした。テキストが空でした。
ko: 프롬프트를 표시하지 못했습니다. 텍스트가 비어 있습니다.
pl: Nie można wyświetlić polecenia, tekst był pusty.
pt_br: Falha ao mostrar o prompt, o texto estava vazio.
ru: Не удалось отобразить запрос — текст пуст.
tr: İstemi gösterilemedi, metin boştu.
zh_hans: 未能显示提示，文本为空。
zh_hant: 無法顯示提示，文字是空的。

# aspire-vscode.strings.failedToStartPythonProgram
source: Failed to start Python program: {0}.
cs: Spuštění programu Python se nezdařilo: {0}.
de: Fehler beim Starten des Python-Programms: {0}.
es: No se pudo iniciar el programa Python: {0}.
fr: Échec du démarrage du programme Python : {0}.
it: Non è possibile avviare il programma Python: {0}.
ja: Python プログラムを起動できませんでした: {0}。
ko: Python 프로그램을 시작하지 못했습니다. {0}.
pl: Nie można uruchomić programu języka Python: {0}.
pt_br: Falha ao iniciar o programa Python: {0}.
ru: Не удалось запустить программу Python: {0}.
tr: Python programı başlatılamadı: {0}.
zh_hans: 未能启动 Python 程序: {0}。
zh_hant: 無法啟動 Python 程式: {0}。

# aspire-vscode.strings.failedToStartDebugSession
source: Failed to start debug session.
cs: Nepodařilo se spustit ladicí relaci.
de: Fehler beim Starten der Debugsitzung.
es: Error al iniciar la sesión de depuración.
fr: Échec du démarrage de la session de débogage.
it: Non è possibile avviare la sessione di debug.
ja: デバッグ セッションを開始できませんでした。
ko: 디버그 세션을 시작하지 못했습니다.
pl: Nie można uruchomić sesji debugowania.
pt_br: Falha ao iniciar a sessão de depuração.
ru: Не удалось запустить сеанс отладки.
tr: Hata ayıklama oturumu başlatılamadı.
zh_hans: 未能启动调试会话。
zh_hant: 無法啟動偵錯工作階段。

# aspire-vscode.strings.failedToStartProject
source: Failed to start project: {0}.
cs: Nezdařilo se spuštění projektu: {0}.
de: Fehler beim Starten des Projekts: {0}
es: No se ha podido iniciar el proyecto: {0}.
fr: Échec du démarrage du projet : {0}.
it: Avvio del progetto non riuscito: {0}.
ja: プロジェクトを開始できませんでした: {0}。
ko: 프로젝트를 시작하지 못했습니다. {0}.
pl: Nie można uruchomić projektu: {0}.
pt_br: Falha ao iniciar o processo: {0}.
ru: Не удалось запустить проект: {0}.
tr: Proje başlatılamadı: {0}.
zh_hans: 未能启动项目: {0}。
zh_hant: 無法啟動專案: {0}。

# command.init
source: Initialize Aspire
cs: Inicializovat Aspire
de: Initialisieren von Aspire
es: Inicializar Aspire
fr: Initialiser Aspire
it: Inizializza Aspire
ja: Aspire の初期化
ko: Aspire 초기화
pl: Inicjuj aplikację Aspire
pt_br: Inicializar o Aspire
ru: Инициализировать Aspire
tr: Aspire'ı başlat
zh_hans: 初始化 Aspire
zh_hant: 初始化 Aspire

# aspire-vscode.strings.invalidLaunchConfiguration
source: Invalid launch configuration for {0}.
cs: Neplatná konfigurace spuštění pro {0}.
de: Ungültige Startkonfiguration für {0}.
es: Configuración de inicio no válida para {0}.
fr: Configuration de lancement non valide pour {0}.
it: Configurazione di avvio non valida per {0}.
ja: {0} の起動構成が無効です。
ko: {0}에 대한 시작 구성이 잘못되었습니다.
pl: Nieprawidłowa konfiguracja uruchamiania dla {0}.
pt_br: Configuração de inicialização inválida para {0}.
ru: Недопустимая конфигурация запуска для {0}.
tr: {0} için geçersiz başlatma yapılandırması.
zh_hans: {0} 的启动配置无效。
zh_hant: {0} 無效的啟動設定。

# aspire-vscode.strings.invalidTokenProvided
source: Invalid token provided.
cs: Byl zadán neplatný token.
de: Ungültiges Token angegeben.
es: Se proporcionó un token no válido.
fr: Jeton fourni non valide.
it: Token fornito non valido.
ja: 無効なトークンが指定されました。
ko: 잘못된 토큰이 제공되었습니다.
pl: Podano nieprawidłowy token.
pt_br: Token inválido fornecido.
ru: Указан недопустимый токен.
tr: Geçersiz belirteç sağlandı.
zh_hans: 提供的令牌无效。
zh_hant: 提供的權杖無效。

# aspire-vscode.strings.openAspireDashboard
source: Launch Aspire Dashboard
cs: Spustit řídicí panel Aspire
de: Starten des Aspire-Dashboards
es: Iniciar panel de Aspire
fr: Lancer le tableau de bord Aspire
it: Avvia dashboard di Aspire
ja: Aspire ダッシュボードの起動
ko: Aspire 대시보드 시작
pl: Uruchom pulpit nawigacyjny pulpitu nawigacyjnego
pt_br: Iniciar o Painel do Aspire
ru: Запустить панель мониторинга Aspire
tr: Aspire Panosunu başlatın
zh_hans: 启动 Aspire 仪表板
zh_hant: 啟動 Aspire 儀表板

# extension.debug.defaultConfiguration.description
source: Launch the effective Aspire apphost in your workspace
cs: Spuštění efektivního hostitele aplikací Aspire ve vašem pracovním prostoru
de: Starten sie den effektiven Aspire-Apphost in Ihrem Arbeitsbereich
es: Iniciar el host de aplicaciones efectivo de Aspire en su área de trabajo.
fr: Lancez l’apphost Aspire effectif dans votre espace de travail
it: Avvia l'apphost Aspire valido nell'area di lavoro
ja: ワークスペースで有効な Aspire apphost を起動する
ko: 작업 영역에서 유효한 Aspire apphost를 시작하세요.
pl: Uruchom wydajną aplikację Aspire AppHost w swoim obszarze roboczym
pt_br: Inicie o apphost efetivo do Aspire no seu espaço de trabalho
ru: Запуск действующего apphost Aspire в рабочей области
tr: Çalışma alanınızda etkili Aspire apphost'u başlatın
zh_hans: 在工作区中启动有效的 Aspire apphost
zh_hant: 啟動您的工作區中有效的 Aspire apphost

# aspire-vscode.strings.launchingWithAppHost
source: Launching Aspire debug session for apphost {0}...
cs: Spouští se ladicí relace Aspire pro hostitele aplikací {0}...
de: Die Aspire-Debugsitzung für Apphost {0} wird gestartet …
es: Iniciando la sesión de depuración de Aspire para apphost {0}...
fr: Lancement de la session de débogage de l’apphost {0}...
it: Avvio della sessione di debug Aspire per apphost {0} in corso...
ja: apphost {0} の Aspire デバッグ セッションを起動しています...
ko: apphost {0}에 대한 Aspire 디버그 세션을 시작하는 중...
pl: Trwa uruchamianie sesji debugowania przerzutu dla hosta aplikacji {0}...
pt_br: Iniciando a sessão de depuração Aspire para apphost {0}...
ru: Запуск сеанса отладки Aspire для apphost {0}...
tr: Apphost {0} için Aspire hata ayıklama oturumu başlatılıyor...
zh_hans: 正在为 apphost {0} 启动 Aspire 调试会话...
zh_hant: 正在啟動 apphost {0} 的 Aspire 偵錯工作階段...
